[
  {
    "专利名": "一种基于人工智能的综合频率源设备的动态控制方法",
    "申请号": "CN202410770119.0",
    "公开日": "20240719",
    "IPC 分类号": "G06F18/25;G06F18/2411;G06F18/213;G06F18/243;G05B19/042;G06F18/20",
    "申请人": "深圳市君威科技有限公司",
    "关键词": "实时监测、相位特征提取、稳定性分析、特征筛选、线性特征融合、增益检测、异常分析、动态补偿、无缝切换控制、射频控制技术、综合频率源设备",
    "摘要": "本发明涉及射频控制技术领域，揭露了一种基于人工智能的综合频率源设备的动态控制方法，其中方法包括：对主频率源进行实时监测，得到频率源环境数据以及频率源输出数据，对频率源输出数据进行相位特征提取以及稳定性分析，得到频率输出特征；根据频率输出特征对输出数据进行相关特征筛选以及线性特征融合，得到主频率源特征；根据主频率源特征对主频率源进行增益检测以及异常分析，得到主频率源异常状态；根据主频率源异常状态对主频率源进行动态补偿以及补偿分析，得到动态调节状态；利用预设的副频率源以及动态调节状态以及对主频率源进行无缝切换控制以及控制反馈，得到控制日志。本发明能够提高综合频率源设备控制的灵活性。",
    "说明书": "一种基于人工智能的综合频率源设备的动态控制方法技术领域本发明涉及射频控制技术领域，尤其涉及一种基于人工智能的综合频率源设备的动态控制方法。背景技术综合频率源设备是一种高级频率生成和管理系统，能够提供广泛频率范围内的高精度、稳定和可控的信号输出，综合频率源设备综合了多种频率生成技术，并具备动态控制能力，以满足复杂应用需求，综合频率源设备常用于需要高性能信号源的领域，如通信、雷达、测试与测量以及科学研究。现有的综合频率源设备的控制方法通常采用基于直接数字合成的控制方法，即利用数字相位累加器和查找表生成正弦波，产生的频率由相位累加器的步长决定，然而，实际应用中，综合频率源设备的合成的频率受温度、电压等环境因素影响较大，且在综合频率源设备出现故障时无法进行快速的修复，可能导致进行综合频率源设备控制时的灵活性较低。发明内容本发明提供一种基于人工智能的综合频率源设备的动态控制方法，其主要目的在于解决进行综合频率源设备控制时的灵活性较低的问题。为实现上述目的，本发明提供的一种基于人工智能的综合频率源设备的动态控制方法，包括：对主频率源进行实时监测，得到频率源环境数据以及频率源输出数据，对所述频率源输出数据进行相位特征提取以及稳定性分析，得到频率输出特征；根据所述频率输出特征对所述频率源环境数据进行相关特征筛选以及线性特征融合，得到主频率源特征；根据所述主频率源特征对所述主频率源进行异常分析，得到主频率源异常状态；根据所述主频率源异常状态对所述主频率源进行动态补偿以及补偿分析，得到动态调节状态；利用预设的副频率源以及所述动态调节状态以及对所述主频率源进行无缝切换控制以及控制反馈，得到控制日志。可选地，所述对所述频率源输出数据进行相位特征提取以及稳定性分析，得到频率输出特征，包括：根据预设的采样间隔对所述频率输出数据进行时频变换，得到频谱输出数据；对所述频谱输出数据进行信号分离，得到噪声频谱数据以及载波频谱数据；利用如下的相位频谱算法计算出所述噪声频谱数据对应的相位噪声特征：根据所述采样间隔对所述频率输出数据进行稳定性分析，得到输出稳定特征；对所述载波频谱数据进行频域特征提取，得到输出频域特征；对所述输出频域特征、所述相位噪声特征以及所述输出稳定特征进行特征拼接融合，得到频率输出特征。可选地，所述根据所述采样间隔对所述频率输出数据进行稳定性分析，得到输出稳定特征，包括：根据所述采样间隔对所述频率输出数据进行相位提取，得到信号相位序列；对所述信号相位序列进行相位偏差计算，得到时间偏差序列；利用如下的时间稳定系数公式计算出所述时间偏差序列对应的时间稳定系数：根据采样间隔对所述频率输出数据进行频率提取，得到输出频率序列；对所述输出频率序列进行频率偏差计算，得到频率偏差序列；利用如下的频率稳定系数公式计算出所述频率偏差序列对应的频率稳定系数：对所述时间稳定系数以及所述频率稳定系数进行特征拼接，得到输出稳定特征。可选地，所述根据所述频率输出特征对所述频率源环境数据进行相关特征筛选以及线性特征融合，得到主频率源特征，包括：对所述频率源环境数据进行稳定性时序特征提取，得到频率环境特征；对所述频率环境特征进行特征标准化操作，得到标准环境特征；对所述频率输出特征进行特征标准化操作，得到标准输出特征；对所述标准环境特征以及所述标准输出特征进行相关特征降维操作，得到相关融合特征；对所述相关融合特征进行线性特征降维操作，得到主频率源特征。可选地，所述对所述频率源环境数据进行稳定性时序特征提取，得到频率环境特征，包括：对所述频率源环境数据进行频时变换，得到时序环境数据；对所述时序环境数据进行时序卷积，得到时序环境特征；对所述时序环境特征进行注意力编码，得到注意力环境特征；将所述时序环境特征和所述注意力环境特征全连接融合成频率环境特征。可选地，所述对所述标准环境特征以及所述标准输出特征进行相关特征降维操作，得到相关融合特征，包括：对所述标准环境特征进行特征矩阵化操作，得到环境特征矩阵；对所述标准输出特征进行特征矩阵化操作，得到输出特征矩阵；对所述环境特征矩阵和所述输出特征矩阵进行协方差运算，得到频率协方差矩阵；对所述频率协方差矩阵进行特征值分解，得到频率特征值和频率特征向量；根据所述频率特征值对所述频率特征向量进行相关性筛选，得到相关特征向量；利用所述频率协方差矩阵对所述相关特征向量进行降维投影，得到相关融合特征。可选地，所述对所述相关融合特征进行线性特征降维操作，得到主频率源特征，包括：对所述相关融合特征进行类内分布计算，得到类内频率矩阵；对所述相关融合特征进行类间分布计算，得到类间频率矩阵；对所述类间频率矩阵和所述类内频率矩阵进行逆和乘积运算，得到逆和频率矩阵；对所述逆和频率矩阵进行特征值分解，得到融合特征值和融合特征向量；根据所述融合特征值对所述融合特征向量进行相关性筛选，得到线性特征向量；利用所述相关融合特征对所述线性特征向量进行降维投影，得到主频率源特征。详细地，所述根据所述主频率源特征对所述主频率源进行异常分析，得到主频率源异常状态，包括：对所述主频率源特征进行特征变换以及特征激活，得到激活异常特征；对所述激活异常特征进行残差激活，得到残差异常特征；对所述残差异常特征进行决策树分裂，得到决策异常特征；对所述决策异常特征进行状态映射，得到主频率源异常状态。详细地，所述根据所述主频率源异常状态对所述主频率源进行动态补偿以及补偿分析，得到动态调节状态，包括：利用所述主频率源异常状态对所述主频率源进行相位累加，得到累加主频率源；对所述累加主频率源进行相位幅度转换以及数模转换，得到模拟主频率源；对所述模拟主频率源进行相位比较以及环路滤波，得到滤波主频率源；对所述滤波主频率源进行压控振荡，得到补偿主频率源；对所述补偿主频率源进行输出提取以及补偿异常分析，得到动态调节状态。详细地，所述利用预设的副频率源以及所述动态调节状态以及对所述主频率源进行无缝切换控制以及控制反馈，得到控制日志，包括：利用所述主频率源对预设的副频率源进行输出同步，得到同步副频率源；根据所述动态调节状态对所述主频率源进行设备休眠，并对所述同步副频率源进行设备唤醒；对所述同步副频率源进行输出提取以及异常分析，得到同步异常状态；根据所述同步异常状态对所述同步副频率源进行相位锁定以及频率压控，得到标准副频率源；对所述主频率源以及所述标准副频率源进行输出记录，得到控制日志。本发明实施例通过进行相位特征提取，能够提取出信号的相位噪声随频率偏移的分布情况，通过进行稳定性分析，能够获取频率信号以及相位信号在不同时间尺度下的稳定性评价，从而更好地进行主频率源的动态控制和优化，通过进行相关特征筛选，能够筛选出所述频率输出特征以及所述频率源环境数据中的相关性较强的特征进行融合，所述线性特征融合，能够进一步对融合后的特征进行降维，从而减少后续异常分析的运算量，通过进行异常分析，能够结合支持向量机以及决策树等模型对主频率源设备的异常状态进行分析，从而了解主频率设备需要进行补偿的具体幅度，提高主频率设备输出控制的精确度。通过进行动态补偿以及补偿分析，能够根据异常的幅度进行高频率高分辨率以及低噪的输出补偿，从而提高频率源设备控制的精确度，通过进行无缝切换控制以及控制反馈，能够在主频率源故障时实现快速且低误差的控制切换，从而提高了综合频率源设备控制的灵活性。因此本发明提出的基于人工智能的综合频率源设备的动态控制方法，可以解决进行综合频率源设备控制时的灵活性较低的问题。"
  },
  {
    "专利名": "一种基于大语言模型的数据处理方法、装置及设备",
    "申请号": "CN202410772348.6",
    "公开日": "20240716",
    "IPC 分类号": "G06F16/332;G06F16/335",
    "申请人": "新华三人工智能科技有限公司",
    "关键词": "大语言模型、数据处理、提示词、目标问题参数、目标问题描述、特征数据库、运维系统、目标运维数据、自然语言交互、助手代理、智能运维",
    "摘要": "本申请提供一种基于大语言模型的数据处理方法、装置及设备，该方法包括：将原始输入问题和提示词输入给大语言模型，通过所述大语言模型基于所述提示词对所述原始输入问题进行处理得到目标问题参数和目标问题描述；其中，所述提示词包括问题样例、问题参数样例和问题描述样例；从特征数据库中查询所述目标问题描述对应的目标访问参数；其中，所述特征数据库包括访问描述与访问参数之间的对应关系；基于所述目标访问参数和所述目标问题参数生成运维系统操作数据；通过所述运维系统操作数据对运维系统进行操作，得到与所述原始输入问题对应的目标运维数据，将所述目标运维数据返回给用户。通过本申请的技术方案，能够节省计算资源，节省时间开销。",
    "说明书": "一种基于大语言模型的数据处理方法、装置及设备技术领域本申请涉及人工智能技术领域，尤其是涉及一种基于大语言模型（LargeLanguage Model，简称LLM）的数据处理方法、装置及设备。背景技术随着网络技术的快速发展，网络数据越来越多，为了从大量网络数据中检索到用户所需数据，需要由用户提供原始输入问题，服务器基于原始输入问题从大量网络数据中检索到用户所需数据，并将数据返回给用户。然而，由于网络数据的数据量很大，服务器需要消耗大量计算资源才能够从大量网络数据中检索到用户所需数据，且服务器需要花费大量时间，从而导致服务器的大量资源消耗，且用户很长时间才能够获知所需数据。发明内容本申请提供一种基于大语言模型的数据处理方法，所述方法包括：将原始输入问题和提示词输入给大语言模型，通过所述大语言模型基于所述提示词对所述原始输入问题进行处理得到目标问题参数和目标问题描述；其中，所述提示词包括问题样例、问题参数样例和问题描述样例；从特征数据库中查询所述目标问题描述对应的目标访问参数；其中，所述特征数据库包括访问描述与访问参数之间的对应关系；基于所述目标访问参数和所述目标问题参数生成运维系统操作数据；通过所述运维系统操作数据对运维系统进行操作，得到与所述原始输入问题对应的目标运维数据，将所述目标运维数据返回给用户。本申请提供一种基于大语言模型的数据处理装置，所述装置包括：处理模块，用于将原始输入问题和提示词输入给大语言模型，通过所述大语言模型基于所述提示词对所述原始输入问题进行处理得到目标问题参数和目标问题描述；其中，所述提示词包括问题样例、问题参数样例和问题描述样例；查询模块，用于从特征数据库中查询所述目标问题描述对应的目标访问参数；其中，所述特征数据库包括访问描述与访问参数之间的对应关系；操作模块，用于基于所述目标访问参数和所述目标问题参数生成运维系统操作数据，并通过所述运维系统操作数据对运维系统进行操作，得到与所述原始输入问题对应的目标运维数据，将所述目标运维数据返回给用户。本申请提供一种电子设备，包括：处理器和机器可读存储介质，所述机器可读存储介质存储有能够被所述处理器执行的机器可执行指令；所述处理器用于执行机器可执行指令，以实现上述基于大语言模型的数据处理方法。由以上技术方案可见，本申请实施例中，在得到原始输入问题之后，借助大语言模型获取原始输入问题对应的目标运维数据，将目标运维数据返回给用户，只需要消耗少量计算资源就能够获取目标运维数据，获取目标运维数据的时间更短，从而节省服务器的计算资源，并节省时间开销。能够快速确定出原始输入问题对应的目标运维数据，提供逻辑分析推理能力，利用大语言模型的分析能力给出准确可靠的目标运维数据。通过一个Copilot（助手）代理作为中间层，用户可以与Copilot代理进行自然语言交互，完成运维需求的交互，Copilot代理将自然语言转化为指令传递给运维系统，实现对话式智能运维系统，提升运维体验，实现用户与运维系统的无障碍人机交互体验，提升用户体验。基于大语言模型的能力，解决自然语言理解的障碍，让用户的输入从页面点击方式变为人机语言交互方式。基于大语言模型的能力，针对运维系统的功能，如概览、诊断、自愈闭环、报表等，实现基于语言交互的自动实现能力。"
  },
  {
    "专利名": "一种多GPU集群网络的RDMA并行数据传输方法",
    "申请号": "CN202410765509.9",
    "公开日": "20240816",
    "IPC 分类号": "G06F9/50;G06F15/173",
    "申请人": "杭州质算科技有限公司",
    "关键词": "RDMA并行、数据传输方法、多GPU集群网络、内存缓存区、RDMA连接、报文切片、计算机技术、网络传输效率",
    "摘要": "本发明涉及计算机技术领域，尤其涉及一种多GPU集群网络的RDMA并行数据传输方法，包括：发送节点和接收节点上，参与发送与接收的GPU都注册内存缓存区并交换信息，并在对应的参与发送GPU和参与接收GPU之间一一建立RDMA连接；主发送GPU调用接口发送，并确定报文切分大小并切片；部分报文切片先由主发送GPU转发到辅助发送GPU；报文切片通过所有参与发送的GPU传输到所有参与接收的GPU，每对RDMA发送连接需要控制发送在途报文切片数量小于等于预设在途最大切片数；辅助接收GPU将报文切片转发到主接收GPU；主接收GPU确认完成。本发明的有益效果：充分利用多张网卡的带宽，提高网络传输效率，减少拥塞。",
    "说明书": "一种多GPU集群网络的RDMA并行数据传输方法技术领域本发明涉及计算机领域，尤其涉及一种多GPU集群网络的RDMA并行数据传输方法。技术背景随着人工智能技术的发展，大语言模型成为了自然语言处理(NLP)领域的一个研究热点。大语言模型训练，需要采用更复杂的模型，以及更大的数据作为训练集，这加重了对算力和带宽的需求。高性能的算力是助力其研究成功的重要武器，是影响深度学习训练快慢的因素。如今训练服务器通常配置有多块GPU以提高算力，服务器内部的GPU之间通过NVLINK互联。而服务器之间的通信方式采用网卡使用RDMA相互访问，该技术支持通过网络在两个系统中直接进行数据的内存拷贝，不需要经过CPU的处理，能实现高吞吐、低延迟的网络通信。现有技术中，通常会遇到某个节点的一块GPU需要访问并传输数据到另一个节点的一块GPU的情况，而现有技术中的多网卡通讯方法只会通过PCIe进行GPU-网卡的数据传输，这种方式会受限于PCIe的带宽。并且由于没法利用超过2张以上的网卡，该方法无法实现并行传输，不能实现多网卡的网络传输加速。发明内容本发明为克服上述的不足之处，目的在于提供一种多GPU集群网络的RDMA并行数据传输方法，通过节点内部多GPU多网卡之间数据拷贝，实现节点之间RDMA通信的多网卡并行数据传输。本发明是通过以下方案达到上述目的：一种多GPU集群网络的RDMA并行数据传输方法，包括以下步骤：S101：发送节点和接收节点上，参与本轮报文数据发送与接收的GPU都注册内存缓存区，交换所述内存缓存区的信息，并在对应的参与发送GPU和参与接收GPU之间一一建立RDMA连接；S102：主发送GPU调用接口发送，并确定报文切分大小，并对发送报文进行切片，得到若干大小相同的报文切片；S103：发送过程开始，部分报文切片先由主发送GPU转发到辅助发送GPU；S104：报文切片通过所有参与发送的GPU传输到所有参与接收的GPU，每对RDMA发送连接需要控制发送在途报文切片数量小于等于预设在途最大切片数；S105：辅助接收GPU将报文切片转发到主接收GPU；S106：主接收GPU确认接收完成；返回发送完成。作为优选，所述步骤S101中，至少包括一个发送节点和一个接收节点，所述发送节点和接收节点的配置相同，并且均配置若干个GPU，每个GPU分别对应配置RDMA网卡，每个GPU通过对应的RDMA网卡接入集群网络中。作为优选，所述步骤S101中，所述发送节点中包含一个主发送GPU和若干个辅助发送GPU，接收节点中包含一个主接收GPU和若干个辅助接收GPU，主发送GPU为报文数据最初所在的GPU，主接收GPU为最终接收报文数据的GPU，发送节点上其余参与报文数据发送的为辅助发送GPU，接收节点上其余参与报文接收的为辅助接收GPU。作为优选，所述步骤S101中，发送节点和接收节点上，参与报文数据发送与接收的GPU都注册内存缓存区DMA-buffer，并把该内存地址注册为RDMA的内存区Memory Region；所述内存缓存区信息为，内存缓存区地址及秘钥。作为优选，所述步骤S103中，主发送GPU通过Nvlink将报文切片传输到辅助发送GPU，当报文切片小于1M时，使用GPU write kernel直接把数据写到辅助发送GPU的显存中；当报文切片大于等于1M时，通过copy engie把数据复制到辅助发送GPU的显存中。作为优选，所述步骤S105中，辅助接收GPU通过Nvlink将报文切片传输到主接收GPU，当报文切片小于1M时，使用GPU write kernel直接把数据写到主接收GPU的显存中；当报文切片大于等于1M时，通过copy engie把数据复制到主接收GPU的显存中。作为优选，所述步骤S102中，报文切片大小根据网络拥塞情况进行调整；在网络拥塞较为严重的情况下，切片大小减小，更细粒度的控制发送速率；网络用在不太严重的情况，切片大小增大，提高吞吐；所述报文切片大小按照4KiBytes对齐。作为优选，所述步骤S104中，所述报文切片在发送过程中需要满足发送在途报文切片数量小于等于预设在途最大切片数M，所述在途最大切片数M需要综合考虑网络带宽和网络拥塞程度因素。作为优选，所述步骤S104中，所述RDMA发送过程分为三个阶段，在不同条件下三个阶段进行切换，并通过不同条件下对最大切片数以及当前发送在途切片数量的控制来实现在途拥塞控制。一种装置，该装置包括：RDMA网卡、处理器，和存储器；其中，所述的存储器存储有可在所述处理器上运行的计算机程序；而所述的处理器在执行所述计算机程序时，能够与所述RDMA网卡共同执行权利要求1-9所述的发送数据的方法，和/或接收数据的方法。本发明的有益效果在于：能有效的提升网络性能，减少网络拥塞，提高网络传输效率。实践证明，本发明能充分利用多张网卡的带宽，相比现有多网卡方案性能可以提升到网卡数量倍。"
  },
  {
    "专利名": "一种基于人工智能的语音互动方法",
    "申请号": "CN202410764506.3",
    "公开日": "20240712",
    "IPC 分类号": "G10L15/16;G10L25/24;G06F18/25;G10L15/26;G10L25/18;G10L15/20;G10L15/02;G10L25/45",
    "申请人": "武汉攀升鼎承科技有限公司",
    "关键词": "语音互动方法、音频融合算子、特征语音、语音转换为文本、语音增强处理、数据处理技术、实时语音、音频集的特征参数、语音识别的抗噪性",
    "摘要": "本发明公开了一种基于人工智能的语音互动方法，数据处理技术领域，包括以下步骤：S1、利用移动终端的麦克风采集用户的实时语音，生成实时语音对应的音频融合算子；S2、利用音频融合算子对实时语音进行处理，生成特征语音；S3、将特征语音转换为文本。该基于人工智能的语音互动方法对用户输入的实时语音进行拆分，分别提取两个音频集的特征参数，再进行拼接，生成音频融合算子，利用音频融合算子对增强处理的增益算子进行修正，提高语音增强处理的效果，提高语音转换为文本的识别精度，改善了语音识别的抗噪性。",
    "说明书": "一种基于人工智能的语音互动方法技术领域本发明属于数据处理技术领域，具体涉及一种基于人工智能的语音互动方法。背景技术随着人工智能的发展，基于人工智能的语音合成技术的应用越来越广泛。语音转文字是一种将语音内容转换为可编辑文本的技术。它可以帮助人们快速将语音记录转化为文字，提高工作和学习效率。人们在使用手机或者平板电脑时，很多人喜欢使用语音识别的方式进行文字输入，但用户在输入语音时所处环境的噪声可能较大，导致转换的文字内容不准确。发明内容本发明为了解决以上问题，提出了一种基于人工智能的语音互动方法。本发明的技术方案是：一种基于人工智能的语音互动方法包括以下步骤：S1、利用移动终端的麦克风采集用户的实时语音，生成实时语音对应的音频融合算子；S2、利用音频融合算子对实时语音进行处理，生成特征语音；S3、将特征语音转换为文本。将特征语音转换为文本时，可采用现有神经网络或深度学习方法实现。进一步地，所述S1包括以下子步骤：S11、利用移动终端的麦克风采集用户的实时语音，对用户的实时语音进行加窗处理；S12、将加窗处理后的实时语音拆分为第一音频集和第二音频集；S13、对第一音频集和第二音频集中每帧音频信号进行小波变换，得到每帧音频信号的细节子带系数；S14、根据第一音频集中每帧音频信号的细节子带系数，确定第一音频集的音频变换系数，根据第二音频集中每帧音频信号的细节子带系数，确定第二音频集的音频变换系数；S15、根据第一音频集的音频变换系数以及第二音频集的音频变换系数，确定第一音频融合元素；S16、确定第二音频融合元素；S17、根据确定第一音频融合元素和第二音频融合元素，生成音频融合算子。上述进一步方案的有益效果是：在本发明中，用户的实时语音包含了较多的语音信号，因此将实时语音进行拆分，对两个音频集的语音信号分别提取音频变换系数，根据两个音频变换系数确定第一音频融合元素；将两个音频集的伽马通滤波器倒谱系数，得到第二音频融合元素；将两个元素拼接，生成包含语音信号特征的音频融合算子，该音频融合算子可以体现音频特征，便于后期进行语音增强处理。其中，抗噪性能更加的伽马通滤波器倒谱系数是一种基于人耳耳蜗听觉模型的特征参数，主要用于音频数据特征提取和语音识别，具有良好的鲁棒性，可以在噪声以及不稳定环境下有效提升识别准确率。进一步地，所述S11中，将实时语音的音频长度作为加窗函数的窗口宽度，利用加窗函数对用户的实时语音进行加窗处理；所述加窗函数Z(k)的表达式为：进一步地，所述S14中，第一音频集的音频变换系数c1mm-1m+1所述S14中，第二音频集的音频变换系数c2nn-1n+1进一步地，所述S15中，第一音频融合元素x112进一步地，所述S16包括以下子步骤：S161、提取第一音频集的伽马通滤波器倒谱系数和第二音频集的伽马通滤波器倒谱系数；S162、根据第一音频集的伽马通滤波器倒谱系数和第二音频集的伽马通滤波器倒谱系数，计算第二音频融合元素。进一步地，所述S162中，第二音频融合元素x212进一步地，所述S17中，音频融合算子R的表达式为进一步地，所述S2包括以下子步骤：S21、提取实时语音的原始增益因子；S22、利用音频融合算子对原始增益因子进行修正，得到目标增益因子；S23、利用目标增益因子对实时语音进行增强处理，得到特征语音。上述进一步方案的有益效果是：在本发明中，由于用户输入的实时语音的噪声干扰较强，因此需要利用音频融合算子对增益因子进行修正，通过修正结果对实时语音进行增强处理，抑制噪声的干扰。进一步地，所述S22中，目标增益因子Y的计算公式为：本发明的有益效果是：该基于人工智能的语音互动方法对用户输入的实时语音进行拆分，分别提取两个音频集的特征参数，再进行拼接，生成音频融合算子，利用音频融合算子对增强处理的增益算子进行修正，提高语音增强处理的效果，提高语音转换为文本的识别精度，改善了语音识别的抗噪性。"
  },
  {
    "专利名": "一种基于对比学习优化的推荐系统异常检测方法和装置",
    "申请号": "CN202410765948.X",
    "公开日": "20240820",
    "IPC 分类号": "G06F18/2433;G06F16/9535;G06N3/042;G06F18/214;G06F18/22;G06N3/0895",
    "申请人": "杭州市滨江区浙工大人工智能创新研究院",
    "关键词": "对比学习优化的推荐系统、异常检测方法、交互图构建、子图采样、信息聚合、对比学习模型、聚合嵌入、用户交互数据、异常用户检测、大规模网络训练",
    "摘要": "本发明涉及一种基于对比学习优化的推荐系统异常检测方法和装置，其方法包括步骤：S1：收集用户交互数据并构建相应的交互图；S2：以目标用户为核心进行子图采样；S3：对输入采样子图中的信息进行聚合；S4：根据聚合后的采样子图信息训练对比学习模型；S5：使用对比学习机制训练后的模型得到S3中的聚合嵌入，从而获取用户之间的相似度分布，并通过异常检测模块判断用户信息中的异常用户，得到最终的检测结果。本发明利用对比学习机制充分学习正常数据和异常数据的一般特征，扩大正常数据与异常数据之间的差异，提升了异常检测的性能；同时，利用子图采样的方法实现了在大规模网络上的高效训练。",
    "说明书": "一种基于对比学习优化的推荐系统异常检测方法和装置技术领域本发明涉及机器学习技术和推荐系统安全领域，更具体的说，它涉及一种基于对比学习优化的推荐系统异常检测方法和装置。背景技术随着互联信息时代的到来，社会生活变得更加数据化，推荐系统作为解决信息过载问题的有效技术手段被广泛应用于各大平台。由于推荐系统的开放性和匿名性，导致其很容易受到各类攻击。恶意者可以通过学习推荐系统中真实用户配置的分布情况，注入虚假用户配置，进而操纵推荐系统的推荐结果，实现牟利或者对推荐的破坏。因此，为了保护推荐系统的性能，开发针对推荐系统的异常检测方法势在必行。此外，异常检测方法不仅可以帮助推荐系统识别和处理异常用户，保护其他用户和系统的数据安全；还可以用来检测用户的偏好变化和异常购买行为，从而调整推荐策略，更好地满足用户需求。目前针对推荐系统的异常检测方法主要分为以下三类：基于统计分析、基于浅层学习机制和基于深度学习。首先，在基于统计分析的异常检测方法中，统计模型利用相关领域专家的先验知识，通过统计分析数据的分布和特征，人工设计指标来检测数据集中是否存在异常情况。该方法虽然可以检测出异常信息，但推荐系统的数据往往是高维稀疏的，统计模型无法进行有效处理。同时，对于不存在于先验知识中的新异常，统计模型也无法进行有效的判断。其次，在基于浅层学习机制的方法中，浅层学习机制利用例如自网络分析、残差分析或CUR分解的方法来检测异常信息。但由于浅层机制的限制，基于浅层学习的方法无法有效捕获高纬数据信息之间的复杂交互。最后，在基于深度学习的方法中，DOMINANT通过构造图自编码器来同时重建图属性和结构信息，并通过重建误差来评估异常；SpecAE利用图自编码器提取低维嵌入，通过密度估计来评估异常。但图自编码器通过重建原始数据来学习潜在表示，不直接针对异常检测目标，因此只能实现异常检测上的次优性能。同时，在面对规模较大的网络时，检测算法对内存需求很高。对比学习是一种无监督学习方法，其核心在于通过比较数据点，减小正样本间的差异并增大正负样本之间的差异来学习有用的表示，被广泛应用于计算机视觉和自然语言处理等领域。将该机制和异常检测相结合，可以有效地利用目标样本的内在信息，区分异常数据和正常数据的一般特征。子图采样是一种应用于图神经网络上的采样技术，被广泛应用于处理大规模图数据上的学习任务。子图采样算法以目标节点为核心切割整个图网络，分批训练节点子图，可以极大地提升模型在大规模网络上的计算速度并有效的缓解内存溢出问题。因此，面对日益严峻的推荐系统安全问题，急需一种基于对比学习优化的推荐系统异常检测方法。发明内容本发明要克服现有技术的上述缺点，提供一种基于对比学习优化的推荐系统异常检测方法和装置。本发明通过收集用户交互信息，利用子图采样方法丰富用户节点信息，使用对比学习算法计算并构建用户相似度分布，最终根据相似度得分分布甄别异常用户，实现在推荐系统上精确的异常检测。本发明的第一个方面涉及一种基于对比学习优化的推荐系统异常检测方法。包括如下步骤：S1：收集用户交互数据并构建相应的交互图；S2：以目标用户为核心进行子图采样；S3：对输入采样子图中的信息进行聚合；S4：根据聚合后的采样子图信息训练对比学习模型；S5：使用对比学习后的模型得到S3中的聚合嵌入，从而获取用户之间的相似度分布，并通过异常检测模块判断用户信息中的异常用户。所述步骤S1中，具体包括以下步骤：S1.1：收集用户交互数据。S1.2：以用户交互项目数据构建图具体来说，所述步骤S2中，具体包括如下步骤：S2.1：无放回地随机采样图中节点作为目标节点。S2.2：以目标节点i为核心进行子图采样。对于每个目标节点(被采样的节点)，分别从k阶邻居采样一定数量节点。具体第k阶邻居节点j的采样概率pj其中d(j)为第j个节点的度值，具体来说，所述步骤S3中，具体步骤如下：S3.1：将采样得到的子图gi其中jS3.2：将初始节点嵌入与其采样子图嵌入hi其中ngS3.3：将嵌入向量i具体来说，所述步骤S4中，具体包括如下步骤：S4.1：初始化模型的可学习参数。定义对比学习损失函数如下：其中τ∈(0,1]为温度系数，S4.2：通过最小化损失函数，不断更新模型参数，可以同时最小化正常用户嵌入之间的距离，并最大化正常用户嵌入与异常用户嵌入之间的距离。具体来说，所述步骤S5中，具体步骤如下：S5.1：计算通过对比学习模型后的所有节点的平均嵌入havg之后计算S5.2：通过最大似然估计法计算余弦相似度得分avg本发明的第二个方面涉及一种基于对比学习优化的推荐系统异常检测装置，包括存储器和一个或多个处理器，所述存储器中存储有可执行代码，所述一个或多个处理器执行所述可执行代码时，用于实现本发明的基于对比学习优化的推荐系统异常检测方法。本发明的第三个方面涉及一种计算机可读存储介质，其上存储有程序，该程序被处理器执行时，实现本发明的基于对比学习优化的推荐系统异常检测方法。本发明通过收集用户交互数据，利用子图采样方法丰富用户节点信息，使用对比学习算法计算并构建用户相似度分布，根据相似度得分分布甄别异常用户，最终实现在推荐系统上精确的异常检测。主要创新点如下：(1)本发明针对推荐系统异常检测数据规模巨大的问题，提出了基于度值引导的目标节点交互子图采样训练机制。考虑到节点度值反映了图的关键结构和信息流，以及推荐系统用户项目交互网络的稀疏性，采用基于节点度值的采样可以更有选择地关注重要的邻居节点，采样信息更丰富的目标节点子图。同时，通过以目标节点为核心切割整个用户项目交互网络，分批训练节点子图，可以极大地提升模型在大规模网络上的计算速度并有效的缓解内存溢出问题。(2)通过精心构建的采样子图对，本发明提出了基于“子图-子图”的对比学习算法，既关注了目标本身节点的信息，又拓展了目标节点在图上的信息视野。此外，设计了相应的对比学习损失函数，来减小正对之间的差异并增大负对之间的差异以学习有用的表示，从而充分利用异常数据的内在信息，区分异常数据和正常数据的一般特征，提升在推荐系统上的异常检测精度。因此，本发明实现了一种基于对比学习优化的推荐系统异常检测方法，以此来提高推荐系统上的异常检测效果。本发明提出了以目标节点为核心的子图采样方法提高了模型的训练与计算速度，利用对比学习算法有效的提高了正常用户与异常用户之间的区分度，最后通过异常检测模块实现在推荐系统上的异常检测。本发明与现有技术相比的优点及功效在于：(1)本发明使用子图提取方法降低了模型训练的复杂度和时间，使得异常检测模型在大规模网络上可以实现快速的训练与计算。(2)本发明使用对比学习算法，通过最大化正常用户和异常用户的差异，最小化正常用户和正常用户的差异，有效地提高正常用户和异常用户之间的区分度，充分地利用了异常用户的自身信息。相比于传统的方法，基于对比学习的异常检测精度得到了提升。"
  },
  {
    "专利名": "一种基于人工智能的麻醉剂成分快速检测方法",
    "申请号": "CN202410767523.2",
    "公开日": "20240830",
    "IPC 分类号": "G06F18/27;G01N21/31",
    "申请人": "中国医学科学院肿瘤医院",
    "关键词": "麻醉剂成分检测技术、快速检测方法、关联影响度、吸收光谱、特征波段、气体浓度、麻醉剂成分、蒸发温度、气体光谱数据",
    "摘要": "本发明涉及麻醉剂成分检测技术领域，具体涉及一种基于人工智能的麻醉剂成分快速检测方法。该方法根据每个蒸发温度下每种麻醉成分的含量波动情况，以及每种麻醉成分在不同蒸发温度下的变化趋势，得到关联影响度；在当前使用麻醉剂的环境下，分析不同麻醉成分在不同波段中吸收光谱的贡献程度，确定特征波段；根据当前使用麻醉剂中麻醉成分与蒸发温度的关联影响、在特征波段的气体光谱数据和贡献程度，获得麻醉成分的气体浓度。本发明通过分析麻醉剂成分在历史使用中受到蒸发温度变化的影响，结合不同波段光谱吸收的优选情况，获取更准确的麻醉气体成分浓度，使检测过程更高效准确，提高快速检测结果的质量。",
    "说明书": "一种基于人工智能的麻醉剂成分快速检测方法技术领域本发明涉及麻醉剂成分检测技术领域，具体涉及一种基于人工智能的麻醉剂成分快速检测方法。背景技术麻醉剂多用在手术过程中，根据不同的麻醉需求麻醉剂的成分是不同的，在手术过程中麻醉师会对汽化的麻醉成分浓度情况进行监控，保证麻醉剂运用的安全稳定。若麻醉成分的浓度不适合，将会造成严重的后果，因此麻醉剂成分的快速检测对麻醉剂的实时控制调整是极为重要的。在对麻醉气体检测时，通常可依据麻醉气体通过光谱仪得到的气体光谱吸收程度，分析不同麻醉气体的浓度，但是麻醉剂在进行注射时一般通过蒸发罐进行对麻醉剂药液进行汽化，通过麻醉机将汽化后的麻醉气体进行运输到人体中。在蒸发汽化过程中，温度会影响麻醉成分的混合情况，进而导致不同麻醉成分在光谱吸收时，影响不同麻醉气体对光的吸收特性，因温度影响造成麻醉气体浓度的检测误差较大，使得麻醉剂成分快速检测的结果质量较差。发明内容为了解决现有技术中因温度影响造成麻醉气体浓度的检测误差较大，使得麻醉剂成分快速检测的结果质量较差的技术问题，本发明的目的在于提供一种基于人工智能的麻醉剂成分快速检测方法，所采用的技术方案具体如下：根据本发明实施例的一个方面，提供了一种基于人工智能的麻醉剂成分快速检测方法。一种基于人工智能的麻醉剂成分快速检测方法，包括：获取麻醉剂在不同蒸发温度下的每种麻醉成分的历史含量数据以及在不同波段下的历史气体光谱数据；在当前手术的当前麻醉剂中，获取每种麻醉成分在不同波段下的气体光谱数据；根据每个蒸发温度下每种麻醉成分的历史含量数据波动情况，以及每种麻醉成分在不同蒸发温度下历史数据波动情况的变化趋势，获得每种麻醉成分与每个蒸发温度的关联影响；根据当前麻醉剂中的每种麻醉成分在每个波段上历史气体光谱数据的占比情况，确定每种麻醉成分在每个波段上的贡献程度；基于贡献程度确定每种麻醉成分的特征波段；基于当前麻醉剂中每种麻醉成分与每个蒸发温度的关联影响，根据当前麻醉剂中每种麻醉成分在特征波段上的气体光谱数据和贡献程度，确定当前麻醉剂中每种麻醉成分的浓度数据。在上述方案中，考虑到麻醉剂在不同的手术中运用的过程和种类的不同，即使在同一蒸发温度下，麻醉成分的含量也会存在不同的变化关系，因此需要根据每个蒸发温度下每种麻醉成分的含量波动情况，反映温度下麻醉成分含量的变化范围，以及每种麻醉成分在不同蒸发温度下的变化趋势，反映温度升高对麻醉成分的混合影响，得到关联影响度，由此综合所历史使用麻醉剂的场景分析温度对麻醉气体混合的影响程度，提高后续依据温度调整检测过程的准确性。进一步可在当前使用麻醉剂的环境下，分析不同麻醉成分在光谱不同波段中的吸收贡献，以依据贡献程度对当前麻醉剂的不同麻醉成分选择更优波段进行光谱吸收分析，也即确定特征波段，提高分析效率。最终通过麻醉成分与蒸发温度的关联影响进行调节，根据特征波段的气体光谱数据和贡献程度，更高效的分析麻醉成分的气体浓度，实现快速准确的成分检测。本发明通过分析麻醉剂成分在历史使用中受到蒸发温度变化的影响，结合不同波段光谱吸收的优选情况，获取更准确的麻醉气体成分浓度，使检测过程更高效准确，提高快速检测结果的质量。进一步地，所述关联影响的获取方法包括：在每个蒸发温度下，根据每种麻醉成分中历史含量数据的变化程度大小，确定每个蒸发温度下每种麻醉成分的变化情况；根据每种麻醉成分在所有蒸发温度下的变化情况的变化趋势程度，确定每种麻醉成分受蒸发温度的变化影响；结合每个蒸发温度下每种麻醉成分的变化情况和每种麻醉成分受蒸发温度的变化影响，确定每种麻醉成分与每个蒸发温度的关联影响。在上述方案中，在同一蒸发温度下同一麻醉成分的历史含量数据变化，反映在同一麻醉场景中麻醉成分会根据需求对含量进行调整的情况，通过变化程度大小获得每个蒸发温度下每种麻醉成分的变化情况，反映麻醉成分的含量调整需求越高，汽化后的影响较大，因此对关联程度的关注需较高。进一步分析同一麻醉成分在不同蒸发温度下的变化情况的变化趋势，反映受到温度的变化影响程度。综合变化影响和变化情况，通过变化情况对变化影响进行量化调整，得到每种麻醉成分与每个温度数据间的关联影响，以便于后续基于关联影响矫正检测分析结果。进一步地，所述变化情况的获取方法包括：在每个蒸发温度下，将每种麻醉成分对应所有历史含量数据的极差作为每个蒸发温度下每种麻醉成分的变化情况。在上述方案中，通过极差反映历史含量数据可变化的范围大小，也即变化的程度大小，更全面的考虑数值可变化的情况。进一步地，变化影响的获取方法包括：将每种麻醉成分的变化情况按照蒸发温度从小到大的顺序排列，获得每种麻醉成分的变化序列；根据每种麻醉成分的变化序列中每个变化情况与相邻变化情况的数值变化，获得每个变化情况的变化度；对每种麻醉成分的变化序列中的变化情况进行直线拟合，将拟合斜率负相关映射获得每种麻醉成分的变化趋势度；通过每种麻醉成分的变化趋势度，结合每种麻醉成分的变化序列中所有变化度的分布混乱情况，确定每种麻醉成分受蒸发温度的变化影响。在上述方案中，考虑温度越高气体混合越均匀，因此当麻醉成分与蒸发温度的关联性越大时，随着温度升高麻醉成分的历史含量数据的可变化范围是越小的，因此通过拟合斜率得到变化趋势度，反映这一变化关系，并通过每个变化情况的实际变化度对趋势拟合进行评价调整，当变化度越复杂，变化趋势度的可信度越低，结合得到变化影响，以便于更准确反映麻醉成分受温度的影响程度。进一步地，所述通过每种麻醉成分的变化趋势度，结合每种麻醉成分的变化序列中所有变化度的分布混乱情况，确定每种麻醉成分受蒸发温度的变化影响，包括：将每种麻醉成分的变化趋势度与数值1的差异进行负相关映射，获得每种麻醉成分的变化关联性；将每种麻醉成分的变化序列中所有变化度的方差进行负相关映射，作为每种麻醉成分的趋势权重；将每种麻醉成分的变化关联性与趋势权重的乘积，作为每种麻醉成分的变化影响。在上述方案中，变化关联性反映变化趋势为均匀变化的可能程度，当变化趋势度表征情况越接近均匀变化时，说明麻醉成分和温度间的关联关系越强，通过方差反映分布混乱情况，当变化度的混乱情况越低，说明趋势拟合情况可信度越高，由此当变化关联性与趋势权重越大，则变化影响越大，说明麻醉成分与温度间的关联影响情况越大，使变化影响的可信度高，便于后续综合分析关联情况。进一步地，所述贡献程度的获取方法包括：依次将每个波段作为分析段，对于当前麻醉剂中的任意一种麻醉成分，根据该麻醉成分在分析段上的历史气体光谱数据，获得该麻醉成分的吸收度；结合当前麻醉剂中所有麻醉成分在分析段上的历史气体光谱数据，确定当前麻醉剂的历史总吸收度；将该麻醉成分的吸收度与当前麻醉剂的历史总吸收度的占比，作为该麻醉成分在分析段上的贡献程度。在上述方案中，考虑麻醉场景采用的麻醉剂中麻醉成分的分布多样性，通过历史分析的已知吸收情况，根据当前麻醉剂中每种麻醉成分的综合吸收情况，得到历史分析后当前麻醉剂中每种麻醉成分在吸收过程的贡献情况，减小了仅当前分析时吸收情况的重叠误差，提高对当前麻醉的检测能力。进一步地，所述根据该麻醉成分在分析段上的历史气体光谱数据，获得该麻醉成分的吸收度，包括：将该麻醉成分在分析段上所有历史气体光谱数据的累加值，作为该麻醉成分的吸收度。进一步地，所述基于贡献程度确定每种麻醉成分的特征波段，包括：对于任意当前麻醉剂中一种麻醉成分，当该麻醉成分在波段上的贡献程度大于预设贡献率时，将对应波段作为该麻醉成分的特征波段。在上述方案中，通过筛选出具有显著贡献情况的麻醉成分的特征波段进行后续吸收情况的分析，减少特征性低的数据计算，在提高准确性同时提高后续分析的速率。进一步地，所述基于当前麻醉剂中每种麻醉成分与每个蒸发温度的关联影响，根据当前麻醉剂中每种麻醉成分在特征波段上的气体光谱数据和贡献程度，确定当前麻醉剂中每种麻醉成分的气体浓度数据，包括：获取当前麻醉剂的当前蒸发温度；对于当前麻醉剂中任意一种麻醉成分，将该麻醉成分与当前蒸发温度的关联影响进行负相关映射，作为该麻醉成分的温度贡献度；将该种麻醉成分的气体浓度数据作为多元线性回归的因变量，将该麻醉成分的温度贡献度、该种麻醉成分在每个特征波段上的气体光谱数据和贡献程度作为多元线性回归的自变量，构建该种麻醉成分在每个特征波段上的多元线性回归模型；在该麻醉成分的所有多元线性回归模型中确定最优解回归模型，通过最优解回归模型获取该麻醉成分的气体浓度数据。在上述方案中，通过回归模型反映多自变量与因变量的线性关系，通过多自变量确定因变量结果，也即气体浓度数据，在不同特征波段上可得到多种回归模型的关系，通过评估得到最优的回归模型，以更准确的获取每种麻醉成分的气体浓度数据。进一步地，所述最优解回归模型的确定方法包括：将均方误差作为每个多元线性回归模型的评估指标；通过交叉验证获取每个多元线性回归模型的交叉验证结果；根据评估指标和交叉验证结果，从所有多元线性回归模型中确定最优解回归模型。根据本发明实施例的另一方面，提供了一种基于人工智能的麻醉剂成分快速检测系统。一种基于人工智能的麻醉剂成分快速检测系统，包括：数据获取模块，用于获取麻醉剂在不同蒸发温度下的每种麻醉成分的历史含量数据以及在不同波段下的历史气体光谱数据；在当前手术的当前麻醉剂中，获取每种麻醉成分在不同波段下的气体光谱数据；关联分析模块，用于根据每个蒸发温度下每种麻醉成分的历史含量数据波动情况，以及每种麻醉成分在不同蒸发温度下历史数据波动情况的变化趋势，获得每种麻醉成分与每个蒸发温度的关联影响；特征波段分析模块，用于根据当前麻醉剂中的每种麻醉成分在每个波段上历史气体光谱数据的占比情况，确定每种麻醉成分在每个波段上的贡献程度；基于贡献程度确定每种麻醉成分的特征波段；检测模块，用于基于当前麻醉剂中每种麻醉成分与每个蒸发温度的关联影响，根据当前麻醉剂中每种麻醉成分在特征波段上的气体光谱数据和贡献程度，确定当前麻醉剂中每种麻醉成分的气体浓度数据。根据本发明实施例的又一方面，提供了一种计算机设备。一种计算机设备，所述计算机设备包括存储器、处理器及存储在所述存储器上并可在所述处理器上运行的计算机程序，所述计算机程序被处理器执行时实现如上述的一种基于人工智能的麻醉剂成分快速检测方法的步骤。根据本发明实施例的又一方面，提供了一种计算机可读存储介质。一种计算机可读存储介质，所述计算机可读存储介质内存储有计算机程序，所述计算机程序可被至少一个处理器所执行，以使所述至少一个处理器执行如上述的一种基于人工智能的麻醉剂成分快速检测方法的步骤。"
  },
  {
    "专利名": "一种基于人工智能的实验室空调运行管控系统",
    "申请号": "CN202410764414.5",
    "公开日": "20240712",
    "IPC 分类号": "F24F110/20;F24F11/89;F24F110/10;F24F11/64;F24F11/52",
    "申请人": "广东汇绿实验室设备科技有限公司",
    "关键词": "空调运行管控系统、人工智能、监测模块、管控模块、管控及时性检测模块、人机交互终端、空调运行管控技术、实验室温湿状态、实验室环境调节",
    "摘要": "本发明属于空调运行管控技术领域，具体是一种基于人工智能的实验室空调运行管控系统，包括服务器、实验室监测模块、空调管控模块、管控及时性检测模块和人机交互终端；本发明通过实验室监测模块对实验室的温湿状况进行监测，在生成实验室检异信号时通过空调管控模块对实验室空调进行运行调控，有助于使实验室内保持在适宜温湿状态，且在实验室空调对实验室内的环境进行调节时通过管控及时性检测模块将调节过程进行监测，通过分析判断相应调节过程是否合格，并在生成管控非及时信号时作出相应改善处理措施，保证后续针对实验室环境的调节效果和调节效率，有利于实验室的正常运行并减小管理人员的管理难度，智能化和自动化水平高。",
    "说明书": "一种基于人工智能的实验室空调运行管控系统技术领域本发明涉及空调运行管控技术领域，具体是一种基于人工智能的实验室空调运行管控系统。背景技术实验室的主要目的是进行科学研究、技术开发、产品测试、教学实验等活动，实验室内通常配备有各种实验仪器、设备和工具，以及相应的实验试剂和材料，在实验室中，研究人员通过设计实验方案、进行实验操作、记录实验数据和分析实验结果，来验证或探索科学理论、解决科学问题或开发新技术；随着科技的快速发展，实验室环境对温度和湿度的要求越来越严格，然而传统的实验室空调控制系统难以基于实验室内的温湿状况自动对空调进行智能调节，且无法合理分析并准确判断针对实验室空调的调节管控效率状况，不利于保证实验室的温湿适宜性，加大了实验室监管难度；针对上述的技术缺陷，现提出一种解决方案。发明内容本发明的目的在于提供一种基于人工智能的实验室空调运行管控系统，解决了现有技术难以基于实验室内的温湿状况自动对空调进行智能调节，且无法合理分析并准确判断针对实验室空调的调节管控效率状况，不利于保证实验室温湿适宜性的问题。为实现上述目的，本发明提供如下技术方案：一种基于人工智能的实验室空调运行管控系统，包括服务器、实验室监测模块、空调管控模块、管控及时性检测模块和人机交互终端；实验室监测模块对实验室的温湿状况进行监测，通过分析生成实验室检异信号或实验室检优信号，且将实验室检异信号经服务器发送至空调管控模块；空调管控模块接收到实验室检异信号对实验室空调进行运行调控，以对实验室的温湿度进行调节；在实验室空调对实验室内的环境进行调节时，管控及时性检测模块将调节过程进行监测，通过分析判断相应调节过程是否合格，并生成管控及时信号或管控非及时信号，且将管控及时信号或管控非及时信号经服务器发送至人机交互终端，人机交互终端接收到管控非及时信号时发出相应预警。进一步的，实验室监测模块的具体运行过程包括：在实验室中设定若干个监测点，通过分析获取到实验室监况值，将实验室监况值与预设实验室监况阈值进行数值比较，若实验室监况值超过预设实验室监况阈值，则生成实验室检异信号；若实验室监况值未超过预设实验室监况阈值，则生成实验室检优信号。进一步的，实验室监况值的具体分析获取方法如下：采集到对应监测点的实时温度和实时湿度，将实时温度相较于预设适宜温度标准值的偏差值标记为点温值，将实时湿度相较于预设适宜湿度标准值的偏差值标记为点湿值；将点温值和点湿值与预设点温阈值和预设点湿阈值分别进行数值比较，若点温值或点湿值超过对应预设阈值，则将对应监测点标记为异况点；并将所有监测点的点温值进行均值计算得到实验室温测值，以及将所有监测点的点湿值进行均值计算得到实验室湿测值；获取到实验室中异况点的数量并将其与监测点的总数量进行比值计算得到异况检测值，通过将异况检测值、实验室温测值和实验室湿测值进行数值计算得到实验室监况值。进一步的，管控及时性检测模块的具体运行过程包括：采集到空调管控模块对实验室空调进行运行调控的时刻并将其标记为运调时刻，以及采集到实验室内的温度状况恢复至适宜状态的时刻并将其标记为运恢时刻，将运恢时刻与运调时刻之间的间隔时长标记为校正时长；获取到相应调节过程所对应的实验室监况值，将实验室监况值相较于预设实验室监况阈值的超出值标记为实验室监超值，事先设定若干组预设实验室监超值范围，且每组预设实验室监超值范围分别对应一组校正时长阈值；将实验室监超值与所有预设实验室监超值范围进行逐一比较，将包含该实验室监超值的预设实验室监超值范围所对应的校正时长阈值标记为目标时长阈值；将校正时长与目标时长阈值进行数值比较，若校正时长超过目标时长阈值，则判断相应调节过程不合格；若校正时长未超过目标时长阈值，则判断相应调节过程合格。进一步的，管控及时性检测模块的具体运行过程还包括：设定检测周期，采集到检测周期内调节过程不合格的发生次数并将其标记为调节劣频值，将调节劣频值与检测周期内空调管控模块对实验室空调进行运行调控的总次数进行比值计算得到调节劣占值；以及获取到检测周期内的所有校正时长，将校正时长与对应目标时长阈值的比值标记为校正时占值，将所有校正时占值进行均值计算得到校正时析值，通过将调节劣占值和校正时析值进行数值计算得到管控检评值，将管控检评值与预设管控检评阈值进行数值比较，若管控检评值超过预设管控检评阈值，则生成管控非及时信号；若管控检评值未超过预设管控检评阈值，则生成管控及时信号。进一步的，服务器与空调状态评估模块通信连接，服务器将管控及时信号发送至空调状态评估模块，空调状态评估模块将实验室空调在检测周期内的运行状态进行评估，通过分析生成空调状态异常信号或空调状态合格信号，且将空调状态异常信号或空调状态合格信号经服务器发送至人机交互终端，人机交互终端接收到空调状态异常信号时发出相应预警。进一步的，空调状态评估模块的具体运行过程包括：采集到实验室空调在检测周期内的运行总时长并将其标记为空调运时值，以及采集到实验室空调在运行过程中的平均功率并将其标记为空调功率值，且采集到实验室空调在检测周期内所消耗的电能并将其标记为空调能耗值；通过将空调能耗值、空调运时值和空调功率值进行数值计算得到空调运行耗评值，将空调运行耗评值与预设空调运行耗评阈值进行数值比较，若空调运行耗评值超过预设空调运行耗评阈值，则生成空调状态异常信号。进一步的，若空调运行耗评值未超过预设空调运行耗评阈值，则通过实验室空调实时检测分析以在实验室空调的运行过程中判断其是否处于异表状态，获取到检测周期内实验室空调处于异表状态的总时长并将其与空调运时值进行比值计算得到空调时异值；以及采集到实验室空调每次处于异表状态的单次持续时长并将其标记为空调异表持续值，将空调异表持续值与预设空调异表持续阈值进行数值比较，统计检测周期内超过预设异表持续阈值的异表持续值的数量并将其与空调运时值进行比值计算得到空调异表高持值，且将数值最大的空调异表持续值标记为空调异表持幅值；通过将空调时异值、空调异表高持值和空调异表持幅值进行数值计算得到空调状态表评值，将空调状态表评值与预设空调状态表评阈值进行数值比较，若空调状态表评值超过预设空调状态表评阈值，则生成空调状态异常信号；若空调状态表评值未超过预设空调状态表评阈值，则生成空调状态合格信号。进一步的，实验室空调实时检测分析的具体分析过程如下：在实验室空调的运行过程中，采集到实验室空调的运行电压、运行电流和运行风速，并将运行电压相较于所设定标准电压的偏差值标记为空调压测值，同理获取到空调流测值和空调风测值；以及将实验室空调的出风温度相较于所设定标准出风温度的偏差值标记为空调出温值；通过将空调压测值、空调流测值、空调风测值和空调出温值进行数值计算得到空调运行实检值，将空调运行实检值与预设空调运行实检阈值进行数值比较，若空调运行实检值超过预设空调运行实检阈值，则判断实验室空调处于异表状态；若空调运行实检值未超过预设空调运行实检阈值，则采集到实验室空调的振动数据和所产生的噪音数据，将振动数据和所产生的噪音数据与相应的预设振动数据阈值和预设噪音数据阈值分别进行数值比较，若振动数据或所产生的噪音数据超过对应预设阈值，则判断实验室空调处于异表状态。与现有技术相比，本发明的有益效果是：1、本发明中，通过实验室监测模块对实验室的温湿状况进行监测，在生成实验室检异信号时通过空调管控模块对实验室空调进行运行调控，有助于使实验室内保持在适宜温湿状态，且在实验室空调对实验室内的环境进行调节时通过管控及时性检测模块将调节过程进行监测，判断相应调节过程是否合格并在生成管控非及时信号时作出相应改善处理措施，保证后续针对实验室环境的调节效果和调节效率，有利于实验室的正常运行并减小管理人员的管理难度，智能化和自动化水平高；2、本发明中，在生成管控及时信号时通过空调状态评估模块将实验室空调在检测周期内的运行状态进行评估，在生成空调状态异常信号时使人机交互终端发出相应预警，能够准确评估检测周期内实验室空调的运行状况，有利于管理人员详细掌握实验室空调的运行风险性，并在接收到相应预警时对实验室空调进行检查维修，以保证其后续的运行安全和运行效果，显著降低针对实验室空调的管理难度。"
  },
  {
    "专利名": "应用于导览系统的问答方法",
    "申请号": "CN202410764014.4",
    "公开日": "20240719",
    "IPC 分类号": "G06F16/332;G06F16/33;G06N20/00;G06F16/338;G06F16/36;G06F16/335",
    "申请人": "天津恒达文博科技股份有限公司",
    "关键词": "问答方法、预检索模型、相似度比对、意图理解模型、信息数据源检索、问答提示文本、微调语言模型、导览系统、游客咨询问题、业务服务",
    "摘要": "本发明提供了一种应用于导览系统的问答方法，可以应用于人工智能技术领域。该方法包括：获取与游客咨询问题有关的问题文本；将问题文本输入预检索模型，以便将问题文本与模板库中的多条回答模板文本进行相似度比对，输出预检索结果；将问题文本输入意图理解模型，判断问题文本与导览系统可提供的业务服务是否有关；在问题文本与导览系统可提供的业务服务有关的情况下，从多个预定类型的信息数据源中检索得到与问题文本语义相似的检索结果文本；基于第二回答模板文本、检索结果文本，生成问答提示文本；将问题文本、问答提示文本、问答要求指令输入微调语言模型，输出针对游客咨询问题的回答文本。",
    "说明书": "应用于导览系统的问答方法技术领域本发明涉及人工智能技术领域，具体地涉及一种应用于导览系统的问答方法。背景技术博物馆用于收藏、保护、展示和研究各种文物和历史遗存。随着公众对文化需求的日益增强，博物馆已经成为一个集辅助教育、娱乐互动以及学者研究于一体的文化服务综合机构。面向观众的导览服务是博物馆综合文化服务的重要组成部分。观众通过博物馆提供的导览服务和内容能够了解、学习历史文化和文物知识。因此，致力于优化导览服务的技术得到了应用。随着智能科技终端的普及和博物馆信息化建设的推进，观众导览形式不断丰富，目前已经出现多种导览方式，如语音导览、微信导览、多媒体导览、AR导览等。观众可以通过智能终端、专用导览设备、导视屏等媒介，较为便捷地获取高质量的文博知识，提升了观众参观体验。随着人工智能技术的发展和运用，利用人工智能迅速提升导览服务的精准化、个性化水平是亟待解决的问题。在实现本发明的过程中发现：文博领域语境特殊、专业性强，对知识权威性和准确性要求较高，需要保证知识来源可溯，另外出于保密原则，博物馆的很多文物数据不允许对外公开。因此，常规方法无法满足文博行业导览服务的实际需求。发明内容鉴于上述问题，本发明提供了一种应用于导览系统的问答方法，上述方法包括：获取与游客咨询问题有关的问题文本；将问题文本输入预检索模型，以便将问题文本与模板库中的多条回答模板文本进行相似度比对，输出预检索结果，其中，预检索结果为第一结果、第二结果、第三结果其中之一，第一结果为：模板库中存在与问题文本的相似度大于第一阈值的第一回答模板文本，第二结果为：模板库中存在与问题文本的相似度大于第二阈值且小于等于第一阈值的第二回答模板文本，第三结果为模板库中多条回答模板文本与问题文本之间的相似度均小于等于第二阈值，第一阈值大于第二阈值；在预检索结果为第二结果的情况下，将问题文本输入意图理解模型，通过意图理解模型判断问题文本与导览系统可提供的业务服务是否有关；在问题文本与导览系统可提供的业务服务有关的情况下，从多个预定类型的信息数据源中检索得到与问题文本语义相似的检索结果文本，其中，多个预定类型的信息数据源基于文博领域的知识数据构建得到；基于第二回答模板文本、检索结果文本，生成问答提示文本；将问题文本、问答提示文本、问答要求指令输入微调语言模型，输出针对游客咨询问题的回答文本。根据本发明的实施例，其中：微调语言模型还输出至少一个应用调用信息，至少一个应用调用信息至少包括第一调用信息、第二调用信息，第一调用信息用于表征是否需要调用推荐模型；第二调用信息用于表征是否需要调用位置引擎。根据本发明的实施例，上述方法还包括：在第一调用信息为：需要调用推荐模型的情况下，获取游客在目标时间段内的参观记录信息，其中，参观记录信息以有序列表的形式存储；调用推荐模型，通过推荐模型基于参观记录信息输出针对游客的推荐信息；将推荐信息返回至微调语言模型，利用微调语言模型判断推荐模型输出的推荐信息的合理性，并基于推荐模型输出的推荐信息进行重新推荐。根据本发明的实施例，上述方法还包括：在第二调用信息为需要调用位置引擎的情况下，获取游客当前位置信息；调用位置引擎，通过位置引擎基于游客当前位置信息、以及针对游客的推荐信息对应的下一个展览区的位置信息，输出针对游客的导航信息；或者通过位置引擎基于游客当前位置信息、以及根据游客咨询问题中有关公用设施服务或有关文物展览区位置的咨询信息，输出针对游客的导航信息。根据本发明的实施例，其中：参观记录信息至少包括：游客参观的多个展览区、多个展览区的参观顺序、游客在每个展览区参观的文物信息、游客在每个展览区的停留时长、游客交互信息、游客对知识讲解的收听完整度、游客对开展活动的参与信息、游客当前位置信息。根据本发明的实施例，推荐模型通过以下方法训练得到：获取多个历史游客对博物馆的历史参观记录信息，历史参观记录信息以有序列表的形式存储，历史参观记录信息至少包括历史游客对多个历史展览区的历史参观顺序；基于历史参观记录信息，采用随机遮盖路径的方式随机遮盖多个历史展览区中的部分历史展览区，生成有序列表训练样本；利用有序列表训练样本，训练初始推荐模型对有序列表训练样本中被遮盖的历史展览区进行预测的能力，得到训练好的推荐模型。根据本发明的实施例，其中：多个预定类型的信息数据源包括文博领域知识图谱、词条知识库、补充知识文档；从多个预定类型的信息数据源中检索得到与问题文本语义相似的检索结果文本包括：基于问题文本，对文博领域知识图谱进行检索，得到图谱检索结果；基于图谱检索结果，对词条知识库和补充知识文档进行检索，得到补充检索结果；将图谱检索结果和补充检索结果组合，得到与问题文本语义相似的检索结果文本。根据本发明的实施例，微调语言模型通过以下方法训练得到：调用预测性能满足用户预定要求的问答模型，基于预先收集的多条原始样本，采用自问自答的方式构造训练文本集合；采用多任务训练的方式，利用训练文本集合训练初始语言模型，得到训练好的微调语言模型。根据本发明的实施例，采用多任务训练的方式，利用训练文本集合训练初始语言模型包括：基于第一任务方式，采用随机遮盖的方式，对训练文本集合中的训练文本进行第一处理，得到第一处理文本，利用初始语言模型对第一处理文本中被遮盖的内容进行预测，以训练初始语言模型的第一文本预测能力；基于第二任务方式，采用遮盖文本后半部分的遮盖方式，对训练文本集合中的训练文本进行第二处理，得到第二处理文本，利用初始语言模型对第二处理文本中被遮盖的内容进行预测，以训练初始语言模型的第二文本预测能力；基于第三任务方式，利用初始语言模型对训练文本集合中的训练文本进行图谱还原处理，得到与训练文本对应的图谱三元组预测数据，以训练初始语言模型对文本的图谱还原能力；基于第四任务方式，获取与训练文本集合中的训练文本对应的图谱三元组真实数据，利用初始语言模型对图谱三元组真实数据进行文本还原处理，得到与图谱三元组真实数据对应的预测文本数据，以训练初始语言模型对图谱的文本还原能力；基于第五任务方式，获取与训练文本集合中的训练文本对应的训练问题文本，利用初始语言模型对训练问题文本进行回答，以训练初始语言模型的问答能力；基于第六任务方式，从训练文本集合中获取目标正样本和目标负样本，利用目标正样本和目标负样本，训练初始语言模型基于包含问题和回答的目标正样本和目标负样本输出推荐结果的推荐能力，其中，目标正样本中，推荐结果在检索结果文本中，且与问题和回答相关但不包含在问题和回答中，目标负样本中，推荐结果包含在问题和/或回答中，或者推荐结果与问题和回答不相关；基于第七任务方式，获取训练文本集合中参考样本对应的推荐结果，利用初始语言模型判断推荐结果是否与参考样本相关，以训练初始语言模型的推荐能力；基于第八任务方式，对训练文本集合中的训练文本标注是否需要调用第三方应用的标签，得到标签文本，利用标签文本训练初始语言模型的应用调用预测能力。根据本发明的实施例，其中：在获取与游客咨询问题有关的问题文本之前，上述方法还包括：接收终端设备发送的有关游客咨询问题的问题语音数据，对问题语音数据进行语音识别，得到问题文本；在输出针对游客咨询问题的回答文本之后，上述方法还包括：将针对游客咨询问题的回答文本进行语音合成处理，得到回答语音数据，将回答语音数据发送至终端设备，以便通过终端设备向游客展示回答语音数据。本发明实施例的上述方法打破传统形式的局限性，引入大模型技术，开发了智慧导览机器人（导览系统）。具体采用两阶段推荐策略，在第一阶段：在游客提问后先基于预置问答对模板进行匹配，该方式能够快速、有效地回答常规问题。在第二阶段：如果游客提问超出模板范围无法给出对应回答，则采用意图识别模块，初步对问题归类、过滤，提取关键词等有效信息，然后通过识别提问文本内容，从文档、知识图谱、知识库中检索相关内容，将所有内容组成提示词传入微调的大模型，在微调大模型中判断结果输出的合理性，给予综合、准确、相关的内容回答，并重新进行推荐生成，实现个性化导览推荐服务。由于经过模版检索、多源信息检索，扩充了输入语言模型中信息的类型和范围，同时，将从模版库中检索得到的与问题中等相似的检索结果也一并带入后续微调语言模型中作为补充信息，进一步为大模型提供了补充信息参考，便于大模型给出更加人性化、准确、合理的回答。上述方法基于模版库、多源信息、大模型融合微调的人工智能技术，在无全部标注的基础上，增强大模型对文博领域知识的理解，增强对观众状态信息的感知，很好地解决了大模型在文博领域的幻觉现象，实现更加准确顺畅的知识问答、千人千面的内容推荐以及精准连贯的位置导航服务，为观众带来新鲜有趣、互动性强的个性化导览服务，有效提升观众参观博物馆的参与感、体验感和获得感。"
  },
  {
    "专利名": "一种人物识别方法及装置",
    "申请号": "CN202410770642.3",
    "公开日": "20240827",
    "IPC 分类号": "G06V20/58;G06N3/08;G06N3/0464;G06V10/25;G06V10/82;G06V40/10",
    "申请人": "杭州电子科技大学",
    "关键词": "人物识别方法、模型数据集、预处理、YOLOV8模型、模型训练、识别模型、人工智能技术、移动机器人、人物模型、环境数据",
    "摘要": "本申请提供一种人物识别方法及装置，涉及人工智能技术领域，方法用于移动机器人，移动机器人包括移动组件、雷达、摄像头，该方法包括：获取人物模型数据集，数据集中包括不同性别的人物模型，人物模型中包括带有眼镜的人物模型；将预处理后的人物模型数据集输入YOLOV8模型进行模型训练，生成人物识别模型；使用人物识别模型对环境数据进行人物识别，将识别结果作为检测目标；确定检测目标与移动机器人的相对距离，基于相对距离确定检测目标的坐标；基于设定时间内识别的检测目标的坐标以及检测目标的人物特征，对设定时间内识别的检测目标进行去重。从而可以减少由于人物移动性较大，造成重复识别，影响识别准确度的问题。",
    "说明书": "一种人物识别方法及装置技术领域本发明涉及人工智能技术领域，特别是指一种人物识别方法及装置。背景技术目标检测是计算机视觉领域的一个重要任务，旨在识别和定位图像或视频中的特定物体或目标。近年来，深度学习技术在目标检测领域取得了巨大进展，特别是基于卷积神经网络（CNN）的方法。常见的深度学习目标检测模型包括Faster R-CNN、YOLO（You Only LookOnce）、SSD（Single Shot Multibox Detector）等，它们在准确性和速度上都取得了显著的提升。然而，对于人物识别场景，由于人物的移动性较大，在人物识别过程中，容易造成重复识别，识别准确度较低的问题，发明内容为了解决现有技术存在的目前人物识别技术的识别准确度低的技术问题，本发明实施例提供了一种人物识别方法及装置。所述技术方案如下：一方面，提供了一种人物识别方法，所述方法用于移动机器人，所述移动机器人包括移动组件、雷达、摄像头，所述方法包括：获取人物模型数据集，所述数据集中包括不同性别的人物模型，所述人物模型中包括带有眼镜的人物模型；对所述人物模型数据集进行预处理；将预处理后的所述人物模型数据集输入YOLOV8模型进行模型训练，生成人物识别模型，所述人物识别模型的识别结果体现人物特征，所述人物特征包括人物性别及人物是否佩带眼镜；使用所述人物识别模型对环境数据进行人物识别，将识别结果作为检测目标；通过所述雷达的检测结果确定所述检测目标与所述移动机器人的相对距离，基于所述相对距离确定所述检测目标的坐标；基于设定时间内识别的检测目标的坐标以及所述检测目标的人物特征，对设定时间内识别的检测目标进行去重，以生成检测结果并输出所述检测结果。可选地，所述基于设定时间内识别的检测目标的坐标以及所述检测目标的人物特征，对设定时间内识别的检测目标进行去重，包括：将人物特征相同的检测目标，确定为疑似相同检测目标；根据相邻帧的所述疑似相同检测目标的坐标值确定第一差值；在所述第一差值小于第一设定值时，确定所述相邻帧的所述疑似相同检测目标为相同检测目标，所述相同检测目标中获取时间在后的检测目标不记录到检测结果中。可选地，所述通过所述雷达的检测结果确定所述检测目标与所述移动机器人的相对距离，包括：确定检测到检测目标后，获取雷达扫描后获得的距离数组；对所述距离数组进行升序排列；根据升序排列后的所述距离数组中相邻的数据确定第二差值，其中相邻的数据中排序在前的数据为被减数，排序在后的数据为减数；当所述第二差值大于第二设定值时，舍弃所述距离数组中排在所述第二差值对应的被减数之后的数据；确定所述距离数组中排在所述第二差值对应的被减数之前的数据以及所述被减数的均值，将所述均值作为所述检测目标与所述移动机器人的相对距离。可选地，所述基于所述相对距离确定所述检测目标的坐标，包括：获取所述移动机器人的坐标；基于所述相对距离，确定所述距离数组中与所述相对距离差值最小的距离值，确定所述距离值对应的扫描角度；根据所述移动机器人的坐标，所述扫描角度，以及所述相对距离，通过如下公式确定所述检测目标的坐标：X2 = X1 + L×sinθ，Y2 = Y1 + L×cosθ，其中，X1 为所述移动机器人的横坐标，Y2为所述移动机器人的纵坐标，θ为所述扫描角度，L为所述相对距离。可选地，所述检测结果以Key-Value的形式存储在HashMap 中。可选地，所述人物特征还包括：是否戴帽子，服装风格，头发长度。可选地，对人物模型数据集进行预处理，包括：对人物模型数据集进行图像处理，图像处理包括对图像亮度、清晰度、旋转方向的调整。另一方面，提供了一种人物识别装置，所述人物识别装置用于实现本发明实施例提供的人物识别方法，所述装置包括：获取模块，用于获取人物模型数据集，所述数据集中包括不同性别的人物模型，所述人物模型中包括带有眼镜的人物模型；预处理模块，用于对所述人物模型数据集进行预处理；模型生成模块，用于将预处理后的所述人物模型数据集输入YOLOV8模型进行模型训练，生成人物识别模型，所述人物识别模型的识别结果体现人物特征，所述人物特征包括人物性别及人物是否佩带眼镜；检测目标生成模块，用于使用所述人物识别模型对环境数据进行人物识别，将识别结果作为检测目标；坐标确定模块，用于通过所述雷达的检测结果确定所述检测目标与所述移动机器人的相对距离，基于所述相对距离确定所述检测目标的坐标；输出模块，用于基于设定时间内识别的检测目标的坐标以及所述检测目标的人物特征，对设定时间内识别的检测目标进行去重，以生成检测结果并输出所述检测结果。另一方面，提供了一种人物识别设备，所述人物识别设备包括：处理器；存储器，所述存储器上存储有计算机可读指令，所述计算机可读指令被所述处理器执行时，实现本发明实施例提供的方法。另一方面，提供了一种计算机可读取存储介质，所述计算机可读取存储介质中存储有程序代码，所述程序代码可被处理器调用执行本发明实施例提供的方法。本发明实施例提供的技术方案带来的有益效果至少包括：通过YOLOV8模型进行模型训练，生成人物识别模型，对人物识别模型的识别结果，结合坐标及人物特征，对识别结果进行去重，以生成检测结果，从而可以减少由于人物移动性较大，造成重复识别，影响识别准确度的问题。"
  },
  {
    "专利名": "一种问答系统的构建方法",
    "申请号": "CN202410768559.2",
    "公开日": "20240903",
    "IPC 分类号": "G06F16/35;G06F16/332",
    "申请人": "西南大学",
    "关键词": "问答系统构建方法、知识图谱制定、图数据库存储引擎、大语言模型、微调、本地化部署、API封装、界面构建、计算机科学、人工智能技术",
    "摘要": "本发明涉及计算机科学和人工智能技术领域，具体涉及一种问答系统的构建方法，制定系统所需的相关领域知识图谱；启动图数据库存储引擎，并暴露数据库接口；根据实际业务场景来对比大语言模型的各项参数，选定一个开源大语言模型作为系统基座模型；利用整理的数据集对大语言模型进行微调；将大语言模型进行本地化部署，并封装为API供系统调用；构建一个界面，作为用户使用该系统的入口；将知识图谱、大语言模型和基础系统进行联通。免去了一般RAG技术对于知识源的向量化步骤，从而简化了检索的过程，结合知识图谱的准确性和可解释性，弥补了大模型可能存在的幻觉现象和本身的黑盒特性，并降低了知识库的更新维护成本。",
    "说明书": "一种问答系统的构建方法技术领域本发明涉及计算机科学和人工智能技术领域，尤其涉及一种问答系统的构建方法。背景技术当前在问答领域，技术路线主要分为两种：传统知识库问答(KBQA)和新型大语言模型(LLM)。KBQA系统通过对自然语言问题进行语义理解和解析，利用知识库进行查询和推理，从而给出答案。这些答案可能是知识库中的实体或实体关系，或者是“no-answer”(即在知识库中找不到答案)。这种问答方式依赖于结构化数据库，因此能够提供准确的回答，同时生成的答案具有较强的可解释性。然而，由于高度依赖知识库的质量和覆盖范围，如果知识库不完整或过时，会影响系统的问答表现。此外，对于知识库中不存在的问题，KBQA系统往往无法提供答案。LLM则通过增加语言模型的参数，并在大量通用文本上进行预训练，具备了深度理解语义和强大的文本生成能力，不再依赖于结构化的知识库，而是将知识以参数化的形式进行存储，可以应对灵活、开放的问答。然而，LLM的缺点是生成的回答不可控，具体的决策逻辑难以追踪和解释，其过程如同一个不透明的黑箱。此外，训练LLM的成本非常高昂，且无法准确地对模型的知识参数进行局部更新，可能导致模型生成错误、过时的回答。结合KBQA和LLM的优缺点，检索增强生成(RAG)技术通过检索获取相关的知识，并将其融入LLM的提示词(Prompt)中，使大模型能够参考这些知识以给出合理的回答，可以将其核心理解为“检索+生成”。前者主要利用向量数据库的高效存储和检索能力，召回目标知识；而后者则利用大模型和Prompt工程，将召回的知识合理利用，生成目标答案。然而，目前的LLM都或多或少存在“幻觉”问题，即模型不可控地生成违背事实的错误回答。此外，一般的RAG技术需要将知识进行文本分割和向量化等过程，并且需要制定对应的检索方法，导致实施复杂度和系统性能要求较高。发明内容本发明的目的在于提供一种问答系统的构建方法，解决了一般的RAG技术需要将知识进行文本分割和向量化等过程，并且需要制定对应的检索方法，导致实施复杂度和系统性能要求较高的问题。为实现上述目的，本发明提供了一种问答系统的构建方法，包括以下步骤：制定系统所需的相关领域知识图谱，作为系统的外部数据源；启动图数据库存储引擎，并暴露数据库接口便于系统访问；根据实际业务场景来对比大语言模型的各项参数，选定一个开源大语言模型作为系统基座模型；利用整理的数据集对大语言模型进行微调；将大语言模型进行本地化部署，并封装为API供系统调用；构建一个界面，作为用户使用该系统的入口；将知识图谱、大语言模型和基础系统进行联通。其中，制定系统所需的相关领域知识图谱，作为系统的外部数据源，所述步骤还包括：制定系统所需的相关领域知识图谱包括图谱范式的制定、图谱数据的收集和整理，以及知识图谱的存储。其中，根据实际业务场景来对比大语言模型的各项参数，选定一个开源大语言模型作为系统基座模型，所述步骤还包括：各项参数包括预训练语料的语言占比、模型参数量、性能表现以及微调和部署成本。其中，构建一个界面，作为用户使用该系统的入口，所述步骤还包括：采用B/S架构来构建一个Web应用，使得用户在浏览器即可使用问答功能。其中，将知识图谱、大语言模型和基础系统进行联通，所述步骤之后还包括：用户在系统界面输入查询问题，通过将查询问题拼接为一个特定的命名实体识别提示词模板，借助大语言模型实现命名实体识别；识别出查询问题的关键实体后，进入知识图谱中通过关键词匹配的方式进行实体检索，并返回相关节点信息；将检索到的相关信息和用户查询问题再次拼接为一个特定的提示词模板提供给大语言模型，指示大语言模型参考和依据给定的外部信息来回答该问题。本发明的一种问答系统的构建方法，首先制定系统所需的相关领域知识图谱，作为该系统的外部数据源，将知识图谱构建完成后，启动图数据库存储引擎，并暴露数据库接口便于系统访问。根据实际业务场景来对比模型的各项参数，之后选定合适的开源大语言模型作为系统基座模型，选定了基座模型之后，选用合适的微调方法，利用整理的数据集对模型进行微调，同时，将模型进行本地化部署，并封装为API供系统调用。在完成了知识图谱和大语言模型构建和部署之后，构建一个高可用且用户友好的界面，作为用户使用该系统的入口，最后，将知识图谱、大语言模型和基础系统进行联通，以检索增强生成的思想，借助知识图谱的外挂知识，实现增强通用大语言模型生成回答的能力。本发明整理出高质量的领域相关知识图谱，并将其作为RAG技术的检索数据源，免去了一般RAG技术对于知识源的向量化步骤，从而简化了检索的过程。在利用大模型强大的学习能力和自然语言理解能力的同时，将知识从大模型中解耦出来，实现了LLM+KG的新范式。结合知识图谱的准确性和可解释性，弥补了大模型可能存在的幻觉现象和本身的黑盒特性，并降低了知识库的更新维护成本。"
  },
  {
    "专利名": "算法管理方法、装置、电子设备及计算机程序产品",
    "申请号": "CN202410763921.7",
    "公开日": "20240716",
    "IPC 分类号": "G06F8/70;G06N20/00;G06F16/903",
    "申请人": "杭州海康威视系统技术有限公司",
    "关键词": "算法管理、算法关键信息、算法仓库、算法标识、目标算法、人工智能算法\n",
    "摘要": "本申请提供了算法管理方法、装置、电子设备及计算机程序产品。本申请中，通过将一个算法需求细分出满足该算法需求的至少一个人工智能算法的算法关键信息，之后针对每一算法关键信息，通过分析已有的算法仓库（存放了已有的多个人工智能算法的算法标识）存在算法关键信息对应的算法标识，则直接复用该算法标识对应的算法作为该算法关键信息对应的目标算法，无需再基于该算法需求开始适配的目标人工智能算法。这实现了能够有效复用现有的人工智能算法，避免不必要且重复的算法开发，降低了算法开发的成本。",
    "说明书": "算法管理方法、装置、电子设备及计算机程序产品技术领域本申请涉及计算机技术领域，特别涉及算法管理方法、装置、电子设备及计算机程序产品。背景技术随着人工智能的广泛应用，目前常根据实际业务需求为相应场景训练至少一种人工智能算法（也称人工智能模型，以下简称算法）来解决上述业务需求。比如：应用于某区域如公园等的场景，假若该场景下的业务需求为监控该区域中的限定范围是否有行人违规进入，则可以通过用于人体检测的算法（即人工智能算法，也称人工智能模型）来监控上述限定范围是否有行人违规进入，以解决该场景下的业务需求；再比如，应用于某工作区域比如工厂等的场景，假若该场景下的业务需求为监控该工作区域内相关人员是否佩戴安全帽，则可以通过用于头部检测的算法（即人工智能算法，也称人工智能模型）和用于安全帽检测的算法（即人工智能算法，也称人工智能模型）来监控该工作区域内相关人员是否佩戴安全帽，以解决该场景下的业务需求；等等。目前，各场景下的人工智能算法分散且相互独立，以至于在某一场景下有新的算法需求时，并非基于已有的各人工智能算法来智能决策出适配该算法需求的人工智能算法，而是直接开发适配该算法需求的人工智能算法，这会导致开发很多重复的人工智能算法，增加了人工智能算法开发成本。发明内容本申请提供了算法管理方法、装置、电子设备及计算机程序产品，以通过人工智能算法的智能化管理为算法需求决策所需的人工智能算法，避免现有盲目开发适配该算法需求的人工智能算法。本申请实施例提供一种算法管理方法，该方法包括：接收来自用户的算法需求；对所述算法需求进行解析，以识别出满足所述算法需求的至少一个算法关键信息；针对每一所述算法关键信息，若已有的算法仓库中存在所述算法关键信息对应的算法标识，则将所述算法标识对应的算法确定为目标算法。本申请实施例提供一种算法管理装置，该装置包括：接收单元，用于接收来自用户的算法需求；识别单元，用于对所述算法需求进行解析，以识别出满足所述算法需求的至少一个算法关键信息；处理单元，用于针对每一所述算法关键信息，若已有的算法仓库中存在所述算法关键信息对应的算法标识，则将所述算法标识对应的算法确定为目标算法。本申请实施例提供一种电子设备，该电子设备包括：处理器和机器可读存储介质；所述机器可读存储介质存储有能够被所述处理器执行的机器可执行指令；所述处理器用于执行机器可执行指令，以实现上述公开的方法的步骤。本申请实施例提供一种计算机程序产品，计算机程序产品内存储有计算机程序，所述计算机程序被处理器执行时实现上述公开的方法的步骤。由以上技术方案可以看出，本申请中，通过将一个算法需求细分出满足该算法需求的至少一个人工智能算法的算法关键信息，之后针对每一算法关键信息，通过分析已有的算法仓库（存放了已有的多个人工智能算法的算法标识）存在算法关键信息对应的算法标识，则直接复用该算法标识对应的算法作为该算法关键信息对应的目标算法，无需再基于该算法需求开始适配的目标人工智能算法。这实现了能够有效复用现有的人工智能算法，避免不必要且重复的算法开发，降低了算法开发的成本。"
  },
  {
    "专利名": "一种太空站模拟环境人工智能实验实训教学系统",
    "申请号": "CN202410756116.1",
    "公开日": "20240830",
    "IPC 分类号": "G09B25/00;G09B9/00;G09B5/06",
    "申请人": "北京杰创永恒科技有限公司",
    "关键词": "人工智能、实验实训教学系统、人机交互子系统、数字资源管理与播放子系统、3D可视化、数据通信交互、太空站模拟环境、教学用具、空间站操控与功能调试、机器人控制、智能硬件、图像处理、语音处理",
    "摘要": "本发明公开的太空站模拟环境人工智能实验实训教学系统，涉及教学用具领域。本发明使用人机交互子系统和辅助数字资源管理与播放子系统，进行3D、可视化的交互方式，替代以前以PC为主的教育教学模式，可更直观的让用户掌握空间站的操控和功能调试，显著提高教学质量和教学效率。通过机械臂子系统、激光云台子系统与主控子系统进行数据通信交互的方式，执行任务，使用户能够把对应知识点和技能点通过多个任务的方式串联起来，熟练掌握技能点，实现教‑学‑练一体化目的。并且，本发明以人工智能任务为基础，可以引入实际工程中的具体问题，结合具体系统结构设置，可以集成机器人控制、智能硬件、图像处理、语音处理等功能，具有较强的教学综合性。",
    "说明书": "一种太空站模拟环境人工智能实验实训教学系统技术领域本发明涉及教学用具领域，特别是涉及一种太空站模拟环境人工智能实验实训教学系统。背景技术实训实操教学是提升教学质量的必要手段，传统太空站实验教学的图像、音频处理学习停留在静态状态，所有的实验结果是通过屏幕打印输出的，无法将多个太空任务进行串联，并且，存在教学效率低的确定。因此，提供一种能够进行太空栈实训实操教学的平台或系统是本领域系带解决的技术问题。发明内容为解决现有技术存在的上述问题，本发明提供了一种太空站模拟环境人工智能实验实训教学系统。为实现上述目的，本发明提供了如下方案：一种太空站模拟环境人工智能实验实训教学系统，包括：主控子系统、人机交互子系统、机械臂子系统、辅助数字资源管理与播放子系统和激光云台子系统；所述人机交互子系统、所述机械臂子系统、所述辅助数字资源管理与播放子系统和所述激光云台子系统均与所述主控子系统连接；所述人机交互子系统用于接收用户指令；所述主控子系统用于基于所述用户指令生成控制指令；所述辅助数字资源管理与播放子系统用于基于所述控制指令播放相应任务；所述机械臂子系统和所述激光云台子系统均与所述主控子系统进行数据通信交互，以执行所述任务。可选地，所述主控子系统中植入有功能程序；所述功能程序实现的功能包括：太空图像识别功能、太空图像增强功能、太空文字识别功能、太空语音识别功能、太空站大脑功能、太空危险识别与摧毁功能、太空站表面缺陷检测功能、太空三维目标定位功能以及太空站人像分割与背景替换功能。可选地，所述辅助数字资源管理与播放子系统中植入有数字资源和仿真任务；所述数字资源包括教学资源和太空环境模拟资源；所述仿真任务包括太空图像识别任务、太空图像增强任务、太空文字识别任务、太空语音识别任务、太空危险识别与摧毁任务、太空站表面缺陷检测任务、太空三维目标定位任务和太空站人像分割与背景替换任务。可选地，所述激光云台子系统用于实现危险摧毁以及视觉危险追踪与定位；所述激光云台子系统通过发射激光束实现危险摧毁。可选地，所述系统还包括空间站模拟件；所述主控子系统、所述机械臂子系统、所述激光云台子系统设置在所述空间站模拟件上。可选地，所述空间站模拟件包括本体和太空站舱体；所述主控子系统嵌入设置在所述本体和所述太空站舱体之间；所述机械臂子系统设置在所述主控子系统上；所述激光云台子系统设置在所述本体上。可选地，所述本体上还设置有太空站物质模拟件。可选地，所述空间站模拟件采用太阳能板提供模拟电能。可选地，所述激光云台子系统包括激光平台和视觉目标跟踪器；所述激光平台和所述视觉目标跟踪器均与所述主控子系统连接。可选地，所述系统采用立方体物块模拟太空站物资，采用地球全景俯瞰图模拟太空站的当前位置。根据本发明提供的具体实施例，本发明公开了以下技术效果：本发明使用人机交互子系统和辅助数字资源管理与播放子系统，能够进行3D、可视化的交互方式，以替代以前以PC为主的教育教学模式，可以更直观的让用户掌握空间站的操控和功能调试，能够显著提高教学质量和教学效率。通过机械臂子系统、激光云台子系统与主控子系统进行数据通信交互的方式，执行任务，使用户能够把对应知识点和技能点通过多个任务的方式串联起来，熟练掌握技能点，实现教-学-练一体化目的。并且，本发明以人工智能任务为基础，可以引入实际工程中的具体问题，结合具体系统结构设置，可以集成机器人控制、智能硬件、图像处理、语音处理等功能，具有较强的教学综合性。"
  },
  {
    "专利名": "一种用于测评人工智能模型的方法及系统",
    "申请号": "CN202410758560.7",
    "公开日": "20240712",
    "IPC 分类号": "G06N20/00;G06F18/21",
    "申请人": "天云融创数据科技（北京）有限公司",
    "关键词": "测评方法、安全性验证、模型检测、执行测评虚拟机、测评结果、人工智能模型、测评安全性、测评准确性",
    "摘要": "本申请公开了一种用于测评人工智能模型的方法及系统，涉及人工智能技术领域，其中，用于测评人工智能模型的方法，包括如下步骤：S1：接收测评请求，根据测评请求对请求端进行安全性验证，并生成请求端安全结果；若请求端安全结果为安全，则执行S2；若请求端安全结果为不安全，则发送请求风险警报；S2：接收待测评模型，对待测评模型进行安全性检测，并生成模型检测结果；若模型检测结果为安全，则执行S3；若模型检测结果为不安全，则发送模型风险警报；S3：根据待测评模型获取执行测评虚拟机，并通过执行测评虚拟机对待测评模型进行测评，获得测评结果，将测评结果发送至请求端。本申请能够提高人工智能模型的测评安全性和测评准确性。",
    "说明书": "一种用于测评人工智能模型的方法及系统技术领域本申请涉及人工智能技术领域，尤其涉及一种用于测评人工智能模型的方法及系统。背景技术人工智能(Artificial Intelligence，AI)是一种借助大数据、网络计算和深度学习，实现类人脑方式的任务处理的技术。人工智能模型是一种通过人工智能对图像、语音和文字等内容进行识别和处理的模型。模型测试是人工智能模型生产的重要环节，通过模型测试的技术，可以分析模型的优劣，从而确认模型的性能。但采用现有的模型测试平台对人工智能模型进行测试，得到人工智能模型对应的测试指标的测试结果，依然存在以下缺点：（1）现有的模型测试平台接收待测评的人工智能模型前，通常不会对请求端进行安全性验证，因此，无法保证请求端的安全性，从而无法保证请求端发送的数据的安全性。（2）现有的模型测试平台接收到待测评的人工智能模型后，对待测评的人工智能模型进行测评前，通常不会对待测评的人工智能模型本身进行安全性验证，因此，无法保证待测评的人工智能模型本身的安全性和准确性。（3）现有的模型测试平台通常只使用一组测试数据对待测评的人工智能模型进行测试，从而得出测试结果，由于测试数据的组数有限，因此，无法保证测试结果的准确性。发明内容本申请的目的在于提供一种用于测评人工智能模型的方法及系统，能够提高人工智能模型的测评安全性和测评准确性。为达到上述目的，本申请提供一种用于测评人工智能模型的方法，包括如下步骤：S1：接收测评请求，根据测评请求对请求端进行安全性验证，并生成请求端安全结果，其中，请求端安全结果为安全或不安全；若请求端安全结果为安全，则执行S2；若请求端安全结果为不安全，则发送请求风险警报；S2：接收待测评模型，对待测评模型进行安全性检测，并生成模型检测结果，其中，模型检测结果为安全或不安全；若模型检测结果为安全，则执行S3；若模型检测结果为不安全，则发送模型风险警报；S3：根据待测评模型获取执行测评虚拟机，并通过执行测评虚拟机对待测评模型进行测评，获得测评结果，将测评结果发送至请求端；其中，测评结果至少包括：输出精度值和精度判断结果。如上的，其中，接收测评请求，根据测评请求对请求端进行安全性验证，并生成请求端安全结果的子步骤如下：S11：接收登录请求或注册请求，完成登录或注册后，接收测评请求，其中，测评请求至少包括：请求时间、请求地址和请求端信息；其中，请求端信息至少包括：请求端的地址、设备型号、当前使用时长、多个实时安全数据，以及每个实时安全数据的值；S12：根据请求端信息中的设备型号和当前使用时长确定每个实时安全数据的当前影响权重；S13：根据请求端信息中的每个实时安全数据的值和当前影响权重计算请求端安全值；S14：根据预设的请求端安全阈值对请求端安全值进行判断，生成请求端安全结果；若请求端安全值大于或等于请求端安全阈值，则生成的请求端安全结果为安全；若请求端安全值小于请求端安全阈值，则生成的请求端安全结果为不安全。如上的，其中，根据请求端信息中的设备型号和当前使用时长确定每个实时安全数据的当前影响权重的子步骤如下：S121：根据请求端信息中的设备型号对影响权重数据库进行遍历，将影响设备型号与请求端信息中的设备型号相同的影响权重表作为需求权重表；S122：根据请求端信息中的多个实时安全数据对需求权重表中的多个安全数据进行遍历，并将与实时安全数据相同的安全数据对应的影响权重作为需求影响权重；S123：根据请求端信息中的当前使用时长对每个需求影响权重所对应的权重差值表进行分析，获得当前权重差值；S124：根据当前权重差值和需求影响权重计算当前影响权重，其中，当前影响权重=需求影响权重+当前权重差值。如上的，其中，根据请求端信息中的当前使用时长对每个需求影响权重所对应的权重差值表进行分析，获得当前权重差值的子步骤如下：S1231：按照时长从短至长的顺序对多个标准使用时长和当前使用时长进行排序，将时长小于当前使用时长的标准使用时长作为短时长，并为每个短时长生成一个短序号；将时长大于当前使用时长的标准使用时长作为长时长，并为每个长时长生成一个长序号；其中，时长短的短时长对应的短序号小于时长长的短时长对应的短序号，时长短的长时长对应的长序号小于时长长的长时长对应的长序号；S1232：对所有的短时长进行分析，获得短差值；S1233：对所有的长时长进行分析，获得长差值；S1234：根据短差值和长差值计算当前权重差值。如上的，其中，当前权重差值的表达式如下：其中，如上的，其中，对待测评模型进行安全性检测，并生成模型检测结果的子步骤如下：S21：调用模拟器，通过模拟器接收待测评模型；其中，模拟器用于模拟一个隔离的运行环境；S22：通过模拟器对待测评模型进行病毒检测，并生成模型检测结果；若待测评模型中无病毒特征码，则生成的模型检测结果为安全；若待测评模型中具有至少一个病毒特征码，则删除待测评模型，且生成的模型检测结果为不安全。如上的，其中，模拟器中设置有预先训练好的用于进行病毒检测的人工智能模型，通过该人工智能模型对待测评模型进行病毒检测，并生成模型检测结果。如上的，其中，根据待测评模型获取执行测评虚拟机，并通过执行测评虚拟机对待测评模型进行测评，获得测评结果的子步骤如下：S31：对待测评模型进行类型分析，确定待测评模型所属的模型类型；S32：将虚拟机类型与模型类型相同的测评虚拟机均作为初选设备；S33：读取每个初选设备的待执行任务个数，选择待执行任务个数最少的初选设备作为执行测评虚拟机；S34：通过执行测评虚拟机调用多个测评数据对待测评模型进行测评，获得测评结果，其中，每个测评数据至少包括：测评输入数据和测评输出数据。如上的，其中，通过执行测评虚拟机调用多个测评数据对待测评模型进行测评，获得测评结果的子步骤如下：S341：随机为每个测评数据生成测评序号，其中，一个测评数据对应一个测评序号，且测评序号按照随机生成测评序号的先后顺序从小至大依次递增；S342：将测评序号最小的测评数据作为当前测评数据，将当前测评数据的测评输入数据输入至待测评模型中，待测评模型执行测评输入数据，并输出当前执行结果，利用当前测评数据的测评输出数据对当前执行结果进行分析，获得数据相似值，执行S343；S343：根据测评序号的总数对当前测评数据的测评序号进行判断，若测评序号的总数大于当前测评数据的测评序号，则存储数据相似值，并剔除当前测评数据的测评序号，执行S342；若测评序号的总数等于当前测评数据的测评序号，则存储数据相似值，执行S344；S344：对所有的数据相似值进行计算，获得输出精度值；S345：通过预设的精度阈值对输出精度值进行判断，并生成精度判断结果；若输出精度值大于或等于精度阈值，则生成的精度判断结果为优；若输出精度值小于精度阈值，则生成的精度判断结果为次；S346：根据精度判断结果和输出精度值生成测评结果。本申请还提供一种用于测评人工智能模型的系统，至少包括：多个请求端和人工智能模型测评中心；其中，请求端：用于发送测评请求；接收测评结果；接收请求风险警报；接收模型风险警报；人工智能模型测评中心：用于执行上述的用于测评人工智能模型的方法。本申请实现的有益效果如下：（1）本申请的用于测评人工智能模型的方法及系统，在接收待测评的人工智能模型（即：待测评模型）前，需要先对请求端进行安全性验证，因此，能够进一步保证请求端的安全性，从而保证请求端发送的数据的安全性。（2）本申请的用于测评人工智能模型的方法及系统，在接收到待测评的人工智能模型后，且在对待测评的人工智能模型进行测评前，需要对待测评的人工智能模型本身进行安全性验证，因此，能够进一步保证待测评的人工智能模型本身的安全性和准确性。（3）本申请的用于测评人工智能模型的方法及系统，使用多个测评数据对待测评的人工智能模型进行测评，从而得出测评结果，由于测评数据的数量充足，因此，能进一步保证测评结果的准确性。"
  },
  {
    "专利名": "基于人工智能的评标专家工作经历匹配度评估方法及系统",
    "申请号": "CN202410756811.8",
    "公开日": "20240712",
    "IPC 分类号": "G06Q10/0639;G06F18/2413;G06N3/0464;G06F18/2415;G06Q10/0631;G06N3/006;G06F18/2133;G06F16/906;G06F21/62",
    "申请人": "辽宁省网联数字科技产业有限公司",
    "关键词": "评标专家工作经历匹配度评估、负因式分解方法、最小二乘法、胶囊网络、数据分类算法、Levy分布函数、隐私信息处理、时间特征增强、评标专家",
    "摘要": "本发明公开了基于人工智能的评标专家工作经历匹配度评估方法及系统，方法包括：收集专家工作经历数据、建立专家评估系统、经验对比分析、评估数据存储和隐私保护。本发明属于数据处理技术领域，具体是指基于人工智能的评标专家工作经历匹配度评估方法及系统，本方案采用负因式分解方法计算分解方式，计算因式的最小二乘法问题优化模型参数，解决了匹配度评估效率低、耗时长的问题；基于胶囊网络的数据分类算法，计算剩余数据对象到初始聚类中心的欧几里得距离，计算Levy分布函数的概率密度函数，解决了信息分类存储不方便的问题；提取专家隐私信息进行处理，进行时间特征增强处理，计算得分并进行强化网络的分析反馈，解决了隐私保护问题。",
    "说明书": "基于人工智能的评标专家工作经历匹配度评估方法及系统技术领域本发明属于数据处理技术领域，具体是基于人工智能的评标专家工作经历匹配度评估方法及系统。背景技术评标专家工作经历匹配度评估方法是一种利用专业知识和技能，结合评标专家的实际工作经历和背景信息，对其在评标过程中的匹配度进行评估的方法，旨在确保评标专家具有适当的专业经验和能力从事评标工作，提高评标活动的专业性和公正性。但是现有的评标专家工作经历匹配度评估方法，存在专家工作经历匹配度评估方法中自动化程度不高，依赖大量人工参与，导致效率低，耗时长的技术问题；存在专家涉足领域复杂，存储起来信息分类不方便，导致评估数据存储出现困难的技术问题；存在评估涉及专家个人信息和隐私数据，隐私保护和数据安全面临安全挑战，可能引发数据泄露和隐私问题的技术问题。发明内容针对上述情况，为克服现有技术的缺陷，本发明提供了基于人工智能的评标专家工作经历匹配度评估方法及系统，针对存在专家工作经历匹配度评估方法中自动化程度不高，依赖大量人工参与，导致效率低，耗时长的技术问题，采用确定评估目标、对象和指标，分析评估专家工作经历数据，采用RESCAL负因式分解方法计算分解方式，使用三阶张量表示专家工作经历数据并进行分解，计算因式的最小二乘法问题优化模型参数；针对存在专家涉足领域复杂，存储起来信息分类不方便，导致评估数据存储出现困难的技术问题，采用基于胶囊网络的数据分类算法，计算剩余数据对象到初始聚类中心的欧几里得距离，计算Levy分布函数的概率密度函数，将分类好的专家信息存储到数据库中；针对存在评估涉及专家个人信息和隐私数据，隐私保护和数据安全面临安全挑战，可能引发数据泄露和隐私问题的技术问题，采用提取专家隐私信息，对隐私信息进行处理，输入并计算标记，进行时间特征增强处理，计算得分并进行强化网络的分析反馈。本发明采取的技术方案如下：本发明提供的基于人工智能的评标专家工作经历匹配度评估方法，该方法包括以下步骤：步骤S1：收集专家工作经历数据，具体为从多渠道获取专家的工作经历数据，包括在线招聘平台、学术数据库和行业协会组织，确保数据的合法性、准确性和完整性；步骤S2：建立专家评估系统，具体为确定评估目标、对象和指标，分析评估专家工作经历数据，采用RESCAL负因式分解方法计算分解方式，使用三阶张量表示专家工作经历数据并进行分解，计算因式的最小二乘法问题优化模型参数；步骤S3：经验对比分析，具体为收集专家经验数据，对比专家之间的差异，考虑项目情境；步骤S4：评估数据存储，具体为采用基于胶囊网络的数据分类算法，计算剩余数据对象到初始聚类中心的欧几里得距离，计算Levy分布函数的概率密度函数，将分类好的专家信息存储到数据库中；步骤S5：隐私保护，具体为提取专家隐私信息，对隐私信息进行处理，输入并计算标记，进行时间特征增强处理，计算得分并进行强化网络的分析反馈。进一步地，在步骤S1中，所述收集专家工作经历数据，具体为从多渠道获取专家的工作经历数据，包括在线招聘平台、学术数据库和行业协会组织，确保数据的合法性、准确性和完整性。进一步地，在步骤S2中，所述建立专家评估系统，包括以下步骤：步骤S21：确定评估目标和对象，根据评估目标，制定具体的评估指标，并为每个指标分配相应的权重，对专家工作经历数据进行分析评估；步骤S22：采用RESCAL负因式分解方法，所述RESCAL负因式分解方法是一种新的张量因式分解模型，能够很好地扩展到大量专家工作经历数据，并在许多机器学习问题中取得先进结果，计算分解方式，所用公式如下：式中，X是待分解的张量，A表示数组，T表示将数组A进行转置，Rk步骤S23：数据表示，使用三阶张量来表示专家工作经历数据，且每片专家工作经历数据按特定方式分解，更有效地处理和表示多维专家工作经历数据；步骤S24：分解参数，通过求解最小化问题来分解参数，包括最小二乘法问题和归一化项，使系统具有更好地预测能力和泛化能力；步骤S25：计算因式的最小二乘法问题，进一步优化模型参数，所用公式如下：式中，进一步地，在步骤S3中，所述经验对比分析，包括以下步骤：步骤S31：收集数据，收集专家的相关经验数据，包括工作经历、项目参与情况和取得的成就；步骤S32：识别差异，对比专家们之间在特定领域的专业知识、处理复杂问题的能力和与团队合作的经验；步骤S33：考虑项目情境，除了比较经验本身，考虑评标项目的具体情景和要求，包括项目的性质、规模和技术难度，这些因素都会影响专家经验的需求。进一步地，在步骤S4中，所述评估数据存储，包括以下步骤：步骤S41：采用数据分类算法，从数据库中随机读取R个数据对象，在n个数据对象的数据包中随机选择t个对象，作为选择的初始聚类中心，所用公式如下：式中，步骤S42：计算剩余的数据对象，获取它们到初始聚类中心的欧几里得距离，所用公式如下：式中，i步骤S43：计算Levy分布函数的概率密度函数，所用公式如下：式中，步骤S44：计算余弦相似度，经过语言模型的操作，文本数据被转换为向量形式，计算余弦相似度，所用公式如下：式中，G（J）表示余弦相似度，J是与文本数据相关的指标，Xii步骤S45：分类存储，将分类好的专家的个人信息、相关经验数据和专家评估结果存储在数据库中，建立索引，定期监控存储空间的使用情况，提高数据查询效率和管理能力。进一步地，在步骤S5中，所述隐私保护，包括以下步骤：步骤S51：提取专家隐私信息；步骤S52：对隐私信息进行处理，引入深度卷积神经网络，采用水库算法进行算法处理分析，所用公式如下：式中，K表示水库的大小，N表示数据流中的元素数量，u表示元素索引，P（u）表示元素u被选中进入水库的概率；步骤S53：输入专家隐私文本并计算标记，将处理后的专家隐私文本输入到深度卷积神经网络中，并标记当前专家隐私文本状态，计算相应的标记，所用公式如下：式中，步骤S54：时间特征增强处理，处理文本与正样本文档和反例跳过文档的匹配，将匹配结果输入到深度卷积神经网络进行处理分析，并将附加的时间特征作为门输入，输入到系统中，从而进一步加强文本特征的增强效果；步骤S55：计算得分并反馈，将对应的融合结果输入到深度神经网络强化学习中，得到对应神经网络的强化得分值，并将对应的单份专家隐私文本添加到文档序列中，计算出整个系统的得分值，输入到强化学习神经网络中，将当前文本网络的总分输入到强化学习网络中进行分析反馈。本发明提供的基于人工智能的评标专家工作经历匹配度评估系统，包括收集专家工作经历数据模块、建立专家评估系统模块、经验对比分析模块、评估数据存储模块和隐私保护模块；所述收集专家工作经历数据模块，具体为从多渠道获取专家的工作经历数据，包括在线招聘平台、学术数据库和行业协会组织，确保数据的合法性、准确性和完整性；所述建立专家评估系统模块，具体为确定评估目标、对象和指标，分析评估专家工作经历数据，采用RESCAL负因式分解方法计算分解方式，使用三阶张量表示专家工作经历数据并进行分解，计算因式的最小二乘法问题优化模型参数；所述经验对比分析模块，具体为收集专家经验数据，对比专家之间的差异，考虑项目情境；所述评估数据存储模块，具体为采用基于胶囊网络的数据分类算法，计算剩余数据对象到初始聚类中心的欧几里得距离，计算Levy分布函数的概率密度函数，将分类好的专家信息存储到数据库中；所述隐私保护模块，具体为提取专家隐私信息，对隐私信息进行处理，输入并计算标记，进行时间特征增强处理，计算得分并进行强化网络的分析反馈。采用上述方案本发明取得的有益成果如下：（1）针对存在专家工作经历匹配度评估方法中自动化程度不高，依赖大量人工参与，导致效率低，耗时长的技术问题，采用确定评估目标、对象和指标，分析评估专家工作经历数据，采用RESCAL负因式分解方法计算分解方式，使用三阶张量表示专家工作经历数据并进行分解，计算因式的最小二乘法问题优化模型参数；（2）针对存在专家涉足领域复杂，存储起来信息分类不方便，导致评估数据存储出现困难的技术问题，采用基于胶囊网络的数据分类算法，计算剩余数据对象到初始聚类中心的欧几里得距离，计算Levy分布函数的概率密度函数，将分类好的专家信息存储到数据库中；（3）针对存在评估涉及专家个人信息和隐私数据，隐私保护和数据安全面临安全挑战，可能引发数据泄露和隐私问题的技术问题，采用提取专家隐私信息，对隐私信息进行处理，输入并计算标记，进行时间特征增强处理，计算得分并进行强化网络的分析反馈。"
  },
  {
    "专利名": "文本数据质量评估方法及装置、电子设备及存储介质",
    "申请号": "CN202410767299.7",
    "公开日": "20240823",
    "IPC 分类号": "G06F16/35;G06F18/214;G06N5/022;G06F18/21;G06F18/10;G06F40/30",
    "申请人": "鹏城实验室",
    "关键词": "文本数据质量评估、样本相似处理、合并处理、去重处理、质量评估模型、数据样本、样本评估等级、数据集评估等级",
    "摘要": "本申请实施例提供了一种文本数据质量评估方法及装置、电子设备及存储介质，属于人工智能技术领域。该方法包括：获取待评估的文本数据集，文本数据集包括多个数据样本；对文本数据集中的多个数据样本进行样本相似处理，得到若干个相似样本子集；对相似样本子集内的数据样本进行合并处理，得到目标数据样本；根据目标数据样本的数据重复率对进行去重处理；将更新后的目标数据样本输入至预训练的质量评估模型中，得到与每个目标数据样本一一对应的样本评估等级；根据样本评估等级，确定文本数据集的数据集评估等级。本申请实施例能够自动化对文本数据集进行评估，提高了数据评估效率，以及为后续的大模型训练提供了高质量的训练库。",
    "说明书": "文本数据质量评估方法及装置、电子设备及存储介质技术领域本申请涉及人工智能技术领域，尤其涉及一种文本数据质量评估方法及装置、电子设备及存储介质。背景技术AI大规模语言模型的预训练是一个复杂且精细的过程，它离不开高质量、大规模、且具备多样性的数据集支持。这样的数据集在提高模型精度和可解释性方面发挥着至关重要的作用。首先，高质量的数据集意味着数据中的噪声和错误被有效剔除，这使得模型在训练过程中能够学习到更为准确的语言规则和模式，从而提高模型的预测精度。同时，高质量的数据集也有助于提升模型的可解释性，使得模型的决策过程更加透明，更易于理解和分析。此外，高质量的数据集还能够显著减少模型收敛到最优解的时间，即缩短训练时长。一个具备多样性的数据集能够覆盖更广泛的语言现象和场景，帮助模型学习到更多的语言知识和能力。相反，如果数据集过于单一，模型可能会过于拟合训练数据，导致在面对新的、未见过的数据时表现不佳。然而，在实际应用中，大模型训练所需的数据量巨大，但数据的质量却参差不齐。许多数据集都存在噪声、偏差等问题，这些问题可能会对模型的性能产生负面影响。发明内容本申请实施例的主要目的在于提出一种文本数据质量评估方法及装置、电子设备及存储介质，旨在自动化对文本数据集进行评估，提高了数据评估效率，以及为后续的大模型训练提供了高质量的训练库。为实现上述目的，本申请实施例的第一方面提出了一种文本数据质量评估方法，所述方法包括：获取待评估的文本数据集，所述文本数据集包括多个数据样本；对所述文本数据集中的多个数据样本进行样本相似处理，得到若干个相似样本子集；对所述相似样本子集内的数据样本进行合并处理，得到所述相似样本子集对应的目标数据样本；根据所述目标数据样本的数据重复率对所述目标数据样本进行去重处理，得到更新后的目标数据样本；将更新后的目标数据样本输入至预训练的质量评估模型中，得到与每个所述目标数据样本一一对应的样本评估等级；根据所述样本评估等级，确定所述文本数据集的数据集评估等级。在一些实施例，在所述对所述文本数据集进行样本相似处理，得到若干个相似样本子集的步骤之前，还包括：根据所述文本数据集，确定每个所述数据样本的格式信息；根据所述格式信息和预设的转换规则，得到标准格式的所述数据样本。在一些实施例，所述对所述文本数据集中的多个数据样本进行样本相似处理，得到若干个相似样本子集，包括：截取所述文本数据集中的每个所述数据样本预设位置中的片段信息，并根据所述片段信息，计算不同所述数据样本间的第一相似度；根据所述第一相似度将所述数据样本进行分区，得到初筛样本子集；计算所述初筛样本子集中的每个所述数据样本的哈希值；提取所述哈希值大于预设哈希阈值的所述数据样本，形成相似样本子集。在一些实施例，所述提取所述哈希值大于预设第一阈值的所述数据样本，形成相似样本子集，包括：提取所述哈希值大于预设第一阈值的所述数据样本，形成二筛样本子集；计算所述二筛样本子集内不同所述数据样本的整体相似度；根据所述整体相似度对所述二筛样本子集进行调整，形成相似样本子集。在一些实施例，所述对所述相似样本子集内的数据样本进行合并处理，得到所述相似样本子集对应的目标数据样本，包括：对所述相似样本子集中每个所述数据样本进行完整度评估，得到每个所述数据样本对应的评分结果；保留所述相似样本子集内所述评分结果最高的所述数据样本，以及删除所述相似样本子集内的其他所述数据样本，并更新所述文本数据集。在一些实施例，所述根据所述目标数据样本的数据重复率对所述目标数据样本进行去重处理，得到更新后的目标数据样本，包括：将所述目标数据样本输入至统计语言模型中，得到所述数据样本的段落间的第一重复率；根据所述第一重复率，对所述数据样本的段落进行去重处理，并更新所述目标数据样本；将完成段落去重后的所述目标数据样本再次输入至所述统计语言模型中，得到所述数据样本中每个段落的句子间的第二重复率；根据所述第二重复率，对所述目标数据样本的句子进行去重处理，并更新所述目标数据样本。在一些实施例，所述根据所述样本评估等级，确定所述文本数据集的数据集评估等级，包括：计算在所述目标数据样本集中，所述样本预估等级为低质量样本的数量占所述数据样本的总数量的比值，得到样本低质量率；当所述低质量率小于预设的第一阈值，则确定所述文本数据集的数据集评估等级为高质量数据集；当所述低质量率大于或等于所述第一阈值，且小于预设的第二阈值，则确定所述文本数据集的数据集评估等级为中质量数据集；当所述低质量率大于或等于所述第二阈值，则确定所述文本数据集的数据集评估等级为低质量数据集。在一些实施例，所述质量评估模型根据以下方法训练得到：获取多个训练样本；将所述训练样本输入至语料模型中，得到每个所述训练样本对应的困惑度，并将所述困惑度大于预设的第三阈值或小于预设的第四阈值的所述训练样本标记为低质量样本；将剩下未标记的所述训练样本进行关键词识别，将包含预设关键词的所述训练样本标记为中质量样本；将剩下未标记的所述训练样本标记为高质量样本；将所述训练样本输入至所述质量评估模型，得到预测质量结果；根据所述预测质量结果和所述训练样本标记的结果，调整所述质量评估模型的参数。在一些实施例，在所述根据所述样本评估等级，确定所述文本数据集的数据集评估等级的步骤之后，还包括：获取关于所述数据集评估等级的评估反馈；根据所述评估反馈，调整所述质量评估模型的参数。在一些实施例，在所述根据所述样本评估等级，确定所述文本数据集的数据集评估等级的步骤之后，还包括：将数据集评估等级为高质量数据集的所述文本数据集，输入至预设的领域分类模型中，得到与所述文本数据集一一对应的领域分类结果；将所述领域分类结果和所述文本数据集输入至预设的聚类分析模型，确定所述文本数据集在所述领域分类结果对应领域的模型中的抽样策略；根据所述抽样策略和所述文本数据集，对在所述领域分类结果对应领域的预设模型进行训练，得到训练影响值；根据所述训练影响值，对所述领域分类模型和所述聚类分析模型的参数进行调整。为实现上述目的，本申请实施例的第二方面提出了一种文本数据质量评估装置，所述装置包括：获取单元，用于获取待评估的文本数据集，所述文本数据集包括多个数据样本；筛选单元，用于对所述文本数据集中的多个数据样本进行样本相似处理，得到若干个相似样本子集；第一去重单元，用于对所述相似样本子集内的数据样本进行合并处理，得到所述相似样本子集对应的目标数据样本；第二去重单元，用于根据所述目标数据样本的数据重复率对所述目标数据样本进行去重处理，得到更新后的目标数据样本；第一评估单元，用于将更新后的目标数据样本输入至预训练的质量评估模型中，得到与每个所述目标数据样本一一对应的样本评估等级；第二评估单元，用于根据所述样本评估等级，确定所述文本数据集的数据集评估等级。为实现上述目的，本申请实施例的第三方面提出了一种电子设备，所述电子设备包括存储器和处理器，所述存储器存储有计算机程序，所述处理器执行所述计算机程序时实现上述第一方面所述的方法。为实现上述目的，本申请实施例的第四方面提出了一种计算机可读存储介质，所述计算机可读存储介质存储有计算机程序，所述计算机程序被处理器执行时实现上述第一方面所述的方法。本申请提出的文本数据质量评估方法及装置、电子设备及存储介质,其通过获取待评估的文本数据集，这个文本数据集包含了大量的数据样本，是评估的基础。接着，对文本数据集进行样本相似处理，目的是识别出文本数据集中相似的数据样本，并将它们归类到不同的相似样本子集中，随后对相似样本子集内的数据样本进行合并处理，从而减少数据集的规模，同时保留重要信息，提高后续处理的效率。在完成多个数据样本间的优化后，对更新后的文本数据集内每个数据样本进行样本优化处理，旨在提高数据样本的准确性和完整性，以及减少数据样本内的重复性。经过样本优化处理后，将更新后的数据样本输入至预训练的质量评估模型中，能够准确评估每个数据样本的质量，并给出相应的样本评估等级。最后，根据样本评估等级，确定整个文本数据集的数据集评估等级，以全面反映数据集的质量水平，为数据分析和决策提供依据。该文本数据质量评估方法通过自动化、智能化的处理手段，减少人工干预，大幅提高评估效率，并且通过准确评估每个文本数据集的质量，为后续的大模型训练提供了高质量的训练库。"
  },
  {
    "专利名": "一种基于大模型融合知识图谱的法律咨询系统",
    "申请号": "CN202410756449.4",
    "公开日": "20240823",
    "IPC 分类号": "G06F16/332;G06F40/211;G06N5/04;G06Q50/18;G06N5/022",
    "申请人": "湖南师范大学",
    "关键词": "大模型融合、知识图谱、依存句法分析、信息提取模块、用户交互模块、法律咨询系统、人工智能技术",
    "摘要": "本申请公开了一种基于大模型融合知识图谱的法律咨询系统，涉及人工智能技术领域，包括：数据获取模块、信息提取模块、知识图谱模块、大模型模块和用户交互模块，通过将用户提问的问句进行依存句法分析，链接到知识图谱模块，匹配最优值后输出知识图谱问句解答再输入至大语言模型模块，与大语言模型中原始问句得到的答案进行融合，得到最终答句；能够解决大语言模型容易出现的模型输出与现实不符的“幻觉”问题和知识更新不及时的情况，同时又解决了知识图谱对用户问题不能很好的理解和知识图谱回答过于模板化的问题。",
    "说明书": "一种基于大模型融合知识图谱的法律咨询系统技术领域本发明涉及人工智能领域，尤其涉及一种基于大模型融合知识图谱的法律咨询系统。背景技术由于目前生活中法律纠纷时，个人寻求律师帮助的时间和经济成本过高，同时对于简单的法律咨询，接待的工作人员有限，无法满足当前大众的法律咨询需求。目前的大模型有滞后性，会导致大模型的法律咨询准确度下降，产生输出与现实不符的“幻觉”问题。发明内容本申请实施例通过提供一种基于大模型融合知识图谱的法律咨询系统，解决了现有技术中，大模型的法律咨询准确度下降，产生输出与现实不符的“幻觉”问题，实现了知识图谱和大语言模型的结合，提供了更准确、更个性化的法律服务。本申请实施例提供了一种基于大模型融合知识图谱的法律咨询系统，数据获取模块、信息提取模块、知识图谱模块、大模型模块和用户交互模块；S1：数据获取模块：基于问句集、答句集、法律条文和各大开元法律案例建立法律数据库；S2：信息提取模块：对法律数据库进行语句分析得到语句结构，将法律数据库通过依存句法分析得到核心词，再根据依存词和依存关系确定句法结构；进一步的，核心词为核心支配动词（HED），依存词通过依存关系与核心词进行前后联系，依存关系具体可分为主谓关系（SBV）、动宾关系（VOB）、介宾关系(POB)、前置关系(FOB)、兼语(DBL)、定中关系(ATT)、状中关系(ADV)、动补结构(CMP)等；S3：知识图谱模块：利用深度学习技术对依存句法分析后的语句进行语义理解、意图识别和问答匹配；进一步的，根据实体标注体系“BIO”对依存句法分析后的语句进行标注，得到数据三元组信息；对输入的问题进行法律特征的识别、问题相关联属性的查找和答案的查询匹配；所述对输入的问题进行法律特征的识别、问题相关联属性的查找和答案的查询匹配，使用的方法包括但不限于BERT、双向LSTM网络和CRF结合的方法；S4：大模型模块：构建大语言模型，在法律数据库的基础上进行模型训练，学习识别与法律相关的问答映射关系；S5：用户交互模块：将用户提问的问句进行依存句法分析，链接到知识图谱模块，匹配最优值后输出知识图谱问句解答；将知识图谱问句解答输入至大语言模型模块，与大语言模型中原始问句得到的答案进行融合，得到最终答句。在S2信息提取模块进行依存句法分析后，对一个语句中的多个谓词进行识别、判断和删减，具体包含以下步骤：S21：建立句法分析树，具体为通过句法分析器对句子进行句法分析得到句法分析树；S22：定义候选论元集合，循环遍历句法分析树，寻找所有可能成为谓词的动词节点；进一步的，通过外部自然语言处理库判断动词节点是否为动词，将是动词的候选论元加入候选论元集合；S23：预定义语言规则，循环遍历候选论元集合，删除不符合规定的候选论元，得到第一候选论元集合；S24：识别第一候选论元集合中候选论元的真假，通过基于机器学习二分类器进行训练，判断第一候选论元集合中候选论元是真论元还是假论元，删除假论元；循环遍历S24，得到包含所有真论元的第二候选论元集合；S25：将第二候选论元中所有的真论元根据依存词和依存关系重新生成新的语句，新语句输入知识图谱模块进行后续操作。对长篇幅的法律文件进行语句相似度计算，具体包含以下步骤：S51：将长篇幅的法律文件作为第一法律文件，从第一法律文件中选择多条语句为初始语句；S52：通过自然语言处理技术中的词嵌入技术，将自然语言表述的文本转换成计算机使用的实数向量，包括但不限于Word2vec等词向量化方法，计算语句相似度，具体为：S521：设定第一语句为w12S522：通过余弦公式计算第一语句和第二语句的相似度，具体为：具体的，相似度计算方法包括但不限于余弦相似度计算方法；S523：设定余弦相似度结果的阈值，对相似度超出阈值的结果进行归纳删除，重新排版上下文的内容；S53：循环操作上述步骤，直至第一法律文件中没有余弦相似度超出阈值的结果，输出重新排版后的第二法律文件。本申请实施例中提供的一个或多个技术方案，至少具有如下技术效果或优点：通过将大语言模型与知识图谱相结合，既避免了大语言模型容易出现的模型输出与现实不符的“幻觉”问题和知识更新不及时的情况，又解决了知识图谱对用户问题不能很好的理解和知识图谱回答过于模板化的问题；并且通过结合知识图谱和大语言模型的答案，系统能够提供更准确、更个性化的法律服务，从而提升用户的使用体验，用户不再需要花费大量时间查找和筛选信息，可以直接获得系统提供的专业解答和建议。"
  },
  {
    "专利名": "一种基于人工智能的智慧监理方法及装置",
    "申请号": "CN202410756020.5",
    "公开日": "20240712",
    "IPC 分类号": "G06F16/9035;G06F18/22",
    "申请人": "北京华城工程管理咨询有限公司",
    "关键词": "智慧监理方法、归一化处理、像素灰度值转换、分布匹配、工程监理数据、人工智能、智慧监理技术",
    "摘要": "本发明实施例提供了一种基于人工智能的智慧监理方法及装置，涉及智慧监理技术的技术领域。其方法包括：获取工程监理数据；对所述工程监理数据进行归一化处理，以得到第一监理数据；对所述第一监理数据进行像素灰度值转换处理，以得到监理灰度分布信息；基于人工智能的智慧监理将所述监理灰度分布信息与预设的灰度分布信息进行分布匹配，并在分布匹配结果不符合预设的分布条件的情况下，确定所述工程监理数据存在异常。通过本发明，解决了工程监理效率低的问题，进而达到了提高工程监理效率的效果。",
    "说明书": "一种基于人工智能的智慧监理方法及装置技术领域本发明实施例涉及智慧监理的技术领域，具体而言，涉及一种基于人工智能的智慧监理方法及装置。背景技术随着我国城市建设的进一步发展，例如，大量的建设项目投资越来越大、工期越来越紧、运维管理要求更高，从而对工程项目监理带来了新的挑战。而传统的工程监理主要依赖人工进行，对于大量的监理数据存在难以实现实时监控和预警，从而对于突发事件的响应和处理不够迅速的问题。针对上述问题，当前并无较好的解决方案。发明内容本发明实施例提供了一种基于人工智能的智慧监理方法及装置，以至少解决相关技术中工程监理数据监控效率低的问题。根据本发明的一个实施例，提供了一种基于人工智能的智慧监理方法，包括：获取工程监理数据，其中，所述工程监理数据是通过部署在工程现场的传感器对工程现场进行数据采集得到的；对所述工程监理数据进行归一化处理，以得到第一监理数据；对所述第一监理数据进行像素灰度值转换处理，以得到监理灰度分布信息；通过第一匹配模型将所述监理灰度分布信息与预设的灰度分布信息进行分布匹配，并在分布匹配结果不符合预设的分布条件的情况下，确定所述工程监理数据存在异常。在一个示例性实施例中，在所述对所述第一监理数据进行像素灰度值转换处理，以得到监理灰度分布信息之后，所述方法还包括：根据预设的分布矩阵构建规则以及所述监理灰度分布信息，构建监理灰度分布矩阵；计算所述监理灰度分布矩阵与预设的灰度分布矩阵之间的相关性，并在所述相关性结果不符合预设的相关性条件的情况下，确定所述工程监理数据存在异常。在一个示例性实施例中，在所述对所述工程监理数据进行归一化处理，以得到第一监理数据之前，所述方法还包括：获取历史监理数据，其中，所述历史监理数据包括历史工程环境数据以及历史工程管理数据；根据所述历史工程环境数据以及历史工程管理数据确定数据过滤规则；根据所述数据过滤规则对所述工程监理数据进行数据过滤处理，所述归一化处理是对数据过滤处理结果执行的。在一个示例性实施例中，在所述获取历史监理数据之后，所述方法还包括：根据预设的时空预测模型，对所述历史监理数据进行预测计算，以得到监理预测数据；将所述监理预测数据与所述工程监理数据进行匹配处理，在匹配处理结果不符合预设的数据演化条件的情况下，确定所述工程监理数据存在异常。根据本发明的另一个实施例，提供了一种基于人工智能的智慧监理装置，包括：数据采集模块，用于获取工程监理数据，其中，所述工程监理数据是通过部署在工程现场的传感器对工程现场进行数据采集得到的；归一化转化模块，用于对所述工程监理数据进行归一化处理，以得到第一监理数据；灰度值转化模块，用于对所述第一监理数据进行像素灰度值转换处理，以得到监理灰度分布信息；第一匹配模块，用于通过第一匹配模型将所述监理灰度分布信息与预设的灰度分布信息进行分布匹配，并在分布匹配结果不符合预设的分布条件的情况下，确定所述工程监理数据存在异常。在一个示例性实施例中，所述装置还包括：矩阵构建模块，用于在所述对所述第一监理数据进行像素灰度值转换处理，以得到监理灰度分布信息之后，根据预设的分布矩阵构建规则以及所述监理灰度分布信息，构建监理灰度分布矩阵；相关性计算模块，用于计算所述监理灰度分布矩阵与预设的灰度分布矩阵之间的相关性，并在所述相关性结果不符合预设的相关性条件的情况下，确定所述工程监理数据存在异常。在一个示例性实施例中，所述装置还包括：历史数据采集模块，用于在所述对所述工程监理数据进行归一化处理，以得到第一监理数据之前，获取历史监理数据，其中，所述历史监理数据包括历史工程环境数据以及历史工程管理数据；规则确定模块，用于根据所述历史工程环境数据以及历史工程管理数据确定数据过滤规则；过滤模块，用于根据所述数据过滤规则对所述工程监理数据进行数据过滤处理，所述归一化处理是对数据过滤处理结果执行的。在一个示例性实施例中，所述装置还包括：预测计算模块，用于在所述获取历史监理数据之后，根据预设的时空预测模型，对所述历史监理数据进行预测计算，以得到监理预测数据；第二匹配模块，用于将所述监理预测数据与所述工程监理数据进行匹配处理，在匹配处理结果不符合预设的数据演化条件的情况下，确定所述工程监理数据存在异常。根据本发明的又一个实施例，还提供了一种计算机可读存储介质，所述计算机可读存储介质中存储有计算机程序，其中，所述计算机程序被设置为运行时执行上述任一项方法实施例中的步骤。根据本发明的又一个实施例，还提供了一种电子装置，包括存储器和处理器，所述存储器中存储有计算机程序，所述处理器被设置为运行所述计算机程序以执行上述任一项方法实施例中的步骤。通过本发明，由于通过对工程监理数据进行像素化处理，从而可以通过像素点的灰度分布情况判断数据是否合理，从而无需逐一对数据进行分析，提高了数据分析效率，因此，可以解决工程监理效率低的问题，达到提高工程监理效率的效果。"
  },
  {
    "专利名": "一种基于人工智能的应答方法",
    "申请号": "CN202410760157.8",
    "公开日": "20240712",
    "IPC 分类号": "G10L15/16;G06F16/332;G06N3/08;G06F16/33;G06N3/04;G07C9/00;G06V40/16;G06V10/82;G10L15/22",
    "申请人": "杭州字节方舟科技有限公司",
    "关键词": "应答方法、数据处理、个性化学习模型、特征提取、问题关键字、知识图谱检索、学生学习行为数据、学习课程、个性化学习模型、练习题",
    "摘要": "一种基于人工智能的应答方法，涉及数据处理领域。在该方法中，获取学生的学习行为数据，学习行为数据包括学习课程和学习课程对应的学习时长；基于学习行为数据，构建学生对应的个性化学习模型，个性化学习模型中包括学习教程和练习题；获取学生输入的，针对个性化学习模型的问题；对问题进行特征提取，得到对应的问题关键字；根据问题关键字，在预设知识图谱中检索对应的知识点并根据知识点生成问题对应的答案。实施本申请提供的技术方案，为学生针对个性化学习模型提供即时、个性化的解答。",
    "说明书": "一种基于人工智能的应答方法技术领域本申请涉及数据处理领域，具体涉及一种基于人工智能的应答方法。背景技术随着教育信息化和人工智能技术的快速发展，个性化自适应学习已成为在线教育的重要发展方向。通过分析学生的学习行为数据，精准诊断学生的学习特点和知识掌握情况，个性化学习系统能够为学生量身定制适合其学习风格和认知水平的学习内容和学习路径，极大提升了学习效率。目前，个性化学习通过挖掘学生历史学习记录中隐含的行为模式和认知规律，自动生成符合学生个性化需求的学习模型，进而推荐动态生成的个性化学习教程和练习题。然而，现有的个性化学习模型主要关注学习资源的个性化推荐和呈现，尚不能很好地满足学生在学习过程中遇到疑惑时寻求帮助的实时需求。因此，亟需一种基于人工智能的应答方法。发明内容本申请提供了一种基于人工智能的应答方法，为学生针对个性化学习模型提供即时、个性化的解答。在本申请的第一方面提供了一种基于人工智能的应答方法，该方法包括：获取学生的学习行为数据，所述学习行为数据包括学习课程和所述学习课程对应的学习时长；基于所述学习行为数据，构建所述学生对应的个性化学习模型，所述个性化学习模型中包括学习教程和练习题；获取所述学生输入的，针对所述个性化学习模型的问题；对所述问题进行特征提取，得到对应的问题关键字；根据所述问题关键字，在预设知识图谱中检索对应的知识点并根据所述知识点生成所述问题对应的答案。通过采用上述技术方案，通过获取学生的学习行为数据，包括学习课程和学习时长，可以构建针对每个学生的个性化学习模型。个性化学习模型可以根据学生的学习偏好和行为习惯提供定制化的学习建议，帮助他们更有效地学习。当学生提出问题时，个性化学习模型会对问题进行特征提取，识别问题中的关键字。这可以帮助更好地理解学生的需求和问题所涉及的主题，为后续的知识检索提供有效的依据。根据问题关键字，在预设的知识图谱中检索对应的知识点，并根据这些知识点生成问题的答案。当学生在学习过程中遇到问题时，他们可以向提出问题，在本技术方案中，会对学生提出的问题进行特征提取和关键字识别，然后根据预设知识图谱检索相关知识点，并生成答案。这个过程可以为学生针对个性化学习模型提供即时、个性化的解答。可选的，获取学生的学习行为数据之前，所述方法还包括：从多种数据源获取多学科的文本资料，所述文本资料包括教科书和专业杂志；对所述文本资料进行提取，提取出对应的结构化文本；从所述结构化文本中提取出对应的多个实体，并识别出各个所述实体之间的关系；根据所述实体和各个所述实体之间的关系构建预设知识图谱。通过采用上述技术方案，通过从多种数据源获取多学科的文本资料，包括教科书和专业杂志，能够涵盖广泛的知识领域。这样的广泛覆盖可以确保知识图谱的内容丰富多样，为学生提供更全面的学习支持。对文本资料进行提取并结构化处理，有助于更好地理解和利用文本内容。通过提取出对应的结构化文本，可以准确识别文本中的实体（例如概念、名词等），并理解它们在文本中的上下文关系。根据提取的实体和它们之间的关系，可以构建预设的知识图谱。这个知识图谱可以呈现出不同实体之间的相关性和层次结构，为后续的问答提供了可靠的知识基础。同时，知识图谱的构建也有助于组织和管理大量的学科知识，使其更易于被和学生理解和应用。可选的，根据所述实体和各个所述实体之间的关系构建预设知识图谱，具体包括：根据所述实体和各个所述实体之间的关系，确定对应的主谓宾结构，所述主谓语结构包括主语、谓语以及宾语，所述实体对应于所述主语和所述宾语，所述谓语对应于各个所述实体之间的关系。通过采用上述技术方案，通过确定实体之间的主谓宾结构，知识图谱的结构变得清晰明了。每个实体都可以在知识图谱中扮演主语或宾语的角色，而实体之间的关系则以谓语的形式呈现。这种结构可以使知识图谱更易于理解和应用，有助于更准确地理解实体之间的关联。主谓宾结构有助于表达实体之间的语义关系，如因果关系、属性关系等。谓语可以明确表示实体之间的交互方式或关联性质，从而使知识图谱中的信息更加准确和具有实际意义。结构化的知识图谱可以提高知识的检索效率和问答的准确性。可以根据学生提出的问题，利用主谓宾结构在知识图谱中快速定位相关实体和关系，并提供精准的答案。这样，学生可以更快地获取需要的信息，提高学习效率。可选的，根据所述问题关键字，在预设知识图谱中检索对应的知识点并根据所述知识点生成所述问题对应的答案，具体包括：将所述问题关键字作为检索关键字在所述预设知识图谱中检索出对应的目标实体；根据所述目标实体确定对应的目标主谓宾结构；基于所述目标主谓宾结构匹配预设自然语言答案模板，得到对应的答案。通过采用上述技术方案，通过将问题关键字作为检索关键字，在预设知识图谱中检索对应的知识点，可以快速准确地定位相关的目标实体。根据目标实体确定对应的目标主谓宾结构后，可以基于预设自然语言答案模板进行匹配，生成相应的答案。根据目标主谓宾结构匹配自然语言答案模板的过程中，可以根据不同的实体和关系，定制化生成不同的答案。这种个性化答案生成可以使提供更贴近学生需求和学习情境的答案，增强学生的满意度和学习体验。可选的，根据所述问题关键字，在预设知识库中检索对应的知识点并根据所述知识点生成所述问题对应的答案之后，所述方法还包括：对所述知识点进行统计，确定各个所述知识点对应的询问次数；若所述询问次数大于或等于预设次数，则确定所述知识点为所述学生的薄弱知识点。通过采用上述技术方案，通过对知识点进行统计并确定学生对各个知识点的询问次数，可以了解学生在哪些知识点上存在困难或者需求较大。通过对知识点询问次数的统计，可以及时发现学生的薄弱环节。一旦发现某个知识点的询问次数达到或超过预设次数，就能够立即确定该知识点为学生的薄弱知识点，以便及时采取相应的教学措施。可选的，根据所述问题关键字，在预设知识图谱中检索对应的知识点并根据所述知识点生成所述问题对应的答案之后，所述方法还包括：根据所述薄弱知识点生成目标学习资源，所述目标学习资源包括在线学习课程；将所述目标学习资源融合至所述个性化学习模型中，得到最终学习模型。通过采用上述技术方案，通过根据学生的薄弱知识点生成目标学习资源，可以为学生提供针对性的学习内容。这些学习资源可以包括在线学习课程、教学视频、练习题等，帮助学生有针对性地弥补知识上的不足，提高学习效果。可选的，将所述目标学习资源融合至所述个性化学习模型中，得到最终学习模型之后，所述方法还包括：将所述薄弱知识点和所述最终学习模型展示给所述学生，以便于所述学生对所述薄弱知识点进行针对性学习。通过采用上述技术方案，通过向学生展示他们的薄弱知识点和最终学习模型，可以提供个性化的学习引导。学生能够清晰地了解自己在哪些知识点上存在困难，以及为他们提供了哪些个性化的学习资源和支持，从而有针对性地进行学习。学生通过了解自己的薄弱知识点和为他们提供的最终学习模型，可以更清楚地认识到自己的学习需求和目标。可选的，基于所述学习行为数据，构建所述学生对应的个性化学习模型，具体包括：对所述学习行为数据进行清洗和预处理，得到目标学习行为数据；基于所述目标学习行为数据，从预设知识库中提取出对应的学习教程和练习题；根据所述学习教程和所述练习题构建所述个性化学习模型。通过采用上述技术方案，通过对学生的学习行为数据进行清洗和预处理，可以得到更加准确和可信的目标学习行为数据。基于目标学习行为数据，可以从预设知识库中提取出与学生需求和兴趣相关的学习教程和练习题。这些学习资源能够满足学生的学习需求，帮助他们更好地理解和掌握知识。为每个学生提供定制化的学习支持。可选的，根据所述学习教程和所述练习题构建所述个性化学习模型，具体包括：根据所述目标学习行为数据，确定对应的目标学习课程和所述目标学习课程对应的目标学习时长；若所述目标学习时长小于预设学习时长，则在所述个性化学习模型中，减少针对所述目标学习课程的练习题至预设第一数量。通过采用上述技术方案，通过根据目标学习行为数据确定目标学习课程和对应的目标学习时长，可以根据学生的学习行为和需求构建个性化学习模型。学习时长较短的知识点，推测学生已经基本掌握，可以降低重复学习，减少对应课程的练习题。可选的，若所述目标学习时长小于预设学习时长，则在所述个性化学习模型中，减少针对所述目标学习课程的练习题之后，所述方法还包括：若所述目标学习时长大于或等于预设学习时长，则在所述个性化学习模型中，增加针对所述目标学习课程的练习题至预设第二数量。通过采用上述技术方案，根据目标学习时长与预设学习时长的比较结果，可以灵活调整个性化学习模型中针对目标学习课程的练习题数量。学习时长较长的知识点，推测学生可能掌握程度不够，需要重点强化，增加对应课程的练习题。综上所述，本申请实施例中提供的一个或多个技术方案，至少具有如下技术效果或优点：1、通过获取学生的学习行为数据，包括学习课程和学习时长，可以构建针对每个学生的个性化学习模型。个性化学习模型可以根据学生的学习偏好和行为习惯提供定制化的学习建议，帮助他们更有效地学习。当学生提出问题时，个性化学习模型会对问题进行特征提取，识别问题中的关键字。这可以帮助更好地理解学生的需求和问题所涉及的主题，为后续的知识检索提供有效的依据。根据问题关键字，在预设知识图谱中检索对应的知识点，并根据这些知识点生成问题的答案。当学生在学习过程中遇到问题时，他们可以向提出问题，在本技术方案中，会对学生提出的问题进行特征提取和关键字识别，然后根据预设知识图谱检索相关知识点，并生成答案。这个过程可以为学生针对个性化学习模型提供即时、个性化的解答。2、通过从多种数据源获取多学科的文本资料，包括教科书和专业杂志，能够涵盖广泛的知识领域。这样的广泛覆盖可以确保知识图谱的内容丰富多样，为学生提供更全面的学习支持。对文本资料进行提取并结构化处理，有助于更好地理解和利用文本内容。通过提取出对应的结构化文本，可以准确识别文本中的实体，并理解它们在文本中的上下文关系。根据提取的实体和它们之间的关系，可以构建预设知识图谱。这个知识图谱可以呈现出不同实体之间的相关性和层次结构，为后续的问答提供了可靠的知识基础。同时，知识图谱的构建也有助于组织和管理大量的学科知识，使其更易于被和学生理解和应用。3、通过确定实体之间的主谓宾结构，知识图谱的结构变得清晰明了。每个实体都可以在知识图谱中扮演主语或宾语的角色，而实体之间的关系则以谓语的形式呈现。这种结构可以使知识图谱更易于理解和应用，有助于更准确地理解实体之间的关联。主谓宾结构有助于表达实体之间的语义关系，如因果关系、属性关系等。谓语可以明确表示实体之间的交互方式或关联性质，从而使知识图谱中的信息更加准确和具有实际意义。结构化的知识图谱可以提高知识的检索效率和问答的准确性。可以根据学生提出的问题，利用主谓宾结构在知识图谱中快速定位相关实体和关系，并提供精准的答案。"
  },
  {
    "专利名": "基于用户偏好和个性化特征的智能用户推荐方法",
    "申请号": "CN202410758784.8",
    "公开日": "20240830",
    "IPC 分类号": "G06F16/9535;G06N20/00;G06F16/9536;G06F16/9538",
    "申请人": "北京百特迈科技有限公司",
    "关键词": "用户推荐方法、特征嵌入表示、相似性计算、推荐结果生成、推荐结果呈现、评估和优化、UI2vec算法、自注意力机制、特征融合、协同过滤算法、用户偏好、个性化特征",
    "摘要": "本发明涉及人工智能技术领域，具体是指基于用户偏好和个性化特征的智能用户推荐方法，所述方法包括用户数据收集、项目数据收集、特征嵌入表示、相似性计算、推荐结果生成、推荐结果呈现和评估和优化，本方案通过利用UI2vec算法将用户的特征向量和项目的特征向量映射到同一个潜在空间上，使得用户的兴趣和项目的特性在相同的维度上进行比较和计算，提高了相似度计算的准确性，使用基于自注意力机制和特征融合的协同过滤算法计算出用户对候选推荐项目的兴趣程度，通过自注意力机制在特征交互中自动分配不同权重，体现信息的重要性差异，同时通过多头注意力机制，捕捉到特征间的多样性相互作用，提高模型的鲁棒性和泛化能力。",
    "说明书": "基于用户偏好和个性化特征的智能用户推荐方法技术领域本发明涉及人工智能技术领域，具体是指基于用户偏好和个性化特征的智能用户推荐方法。背景技术现有的用户推荐方法存在推荐准确性低、个性化程度低的问题，特征匹配困难，用户和项目的原始特征维度不同且高维，直接进行特征匹配时难以找到合适的度量标准，导致推荐准确性降低，且高维特征中包含大量噪音数据，难以区分重要特征和噪音，从而影响推荐结果，同时由于缺乏统一的潜在空间进行特征映射，使得系统难以捕捉用户的个性化偏好，推荐结果更加泛化，个性化程度降低，直接使用原始特征难以动态调整和更新用户偏好，无法及时反映用户兴趣的变化；同时传统协同过滤算法存在信息重要性难以区分、泛化能力差的问题，通常无法根据特定用户和项目之间的关系动态调整权重，导致推荐的精度较低，传统协同过滤算法通常采用固定的权重分配方式，无法根据具体场景调整特征权重，重要信息难以突出，并且无法捕捉特征间的多样性相互作用，泛化能力和鲁棒性较差。发明内容针对上述情况，为克服现有技术的缺陷，本发明提供了基于用户偏好和个性化特征的智能用户推荐方法，为了解决用户推荐方法存在推荐准确性低、个性化程度低的问题，利用UI2vec算法将用户的特征向量和项目的特征向量映射到同一个潜在空间上，使得用户的兴趣和项目的特性在相同的维度上进行比较和计算，提高了相似度计算的准确性，通过嵌入表示，将高维度的用户和项目特征压缩到低维空间，保留了最重要的特征，减少了噪音，提升了推荐结果的准确性，用户和项目的嵌入表示通过UI2vec模型学习，捕捉到用户的个性化偏好和项目的独特特性，从而实现更精准的个性化推荐；为了解决传统协同过滤算法存在信息重要性难以区分、泛化能力差的问题，使用基于自注意力机制和特征融合的协同过滤算法计算出用户对候选推荐项目的兴趣程度，通过自注意力机制在特征交互中自动分配不同权重，体现信息的重要性差异，优化推荐结果，通过多头注意力机制，捕捉到特征间的多样性相互作用，提高模型的鲁棒性和泛化能力。本发明采取的技术方案如下：本发明提供的基于用户偏好和个性化特征的智能用户推荐方法，该方法包括以下步骤：步骤S1：用户数据收集，收集用户数据，包括个人信息、历史行为数据、偏好和喜好，同时使用用户数据构建用户的特征向量；步骤S2：项目数据收集，收集项目的相关信息，包括内容特征、标签、类别，并使用项目的相关信息构建项目的特征向量；步骤S3：特征嵌入表示，利用UI2vec算法将用户的特征向量和项目的特征向量映射到同一个潜在空间上，得到用户的特征向量和项目的特征向量的嵌入表示；步骤S4：相似性计算，基于用户的特征向量和项目的特征向量的嵌入表示，计算用户和项目之间的相似性，得到用户对所有项目的相似度得分，相似度得分高的若干个项目作为候选推荐项目；步骤S5：推荐结果生成，根据候选推荐项目的相似度得分，使用基于自注意力机制和特征融合的协同过滤算法计算出用户对候选推荐项目的兴趣程度，并生成推荐列表，同时进行过滤和排序，生成最终的推荐列表；步骤S6：推荐结果呈现，将最终的推荐列表在网页、App或电子邮件中呈现给用户；步骤S7：评估和优化，引入评估指标对于最终的推荐列表进行评估，包括推荐准确度和用户满意度的指标，得到评估结果，并根据评估结果对协同过滤算法和模型进行优化和调整。进一步的，步骤S3，具体包括以下步骤：步骤S31：数据准备，接收步骤S1和步骤S2收集的用户的特征向量和项目的特征向量；步骤S32：构建文档标签，为用户的特征向量和项目的特征向量分别定义文档标签，使用用户ID作为用户的特征向量的标签，项目ID作为项目的特征向量的标签；步骤S33：构建UI2vec模型，以Doc2Vec为基础框架，构建一个嵌入表示的UI2vec模型；步骤S34：训练UI2vec模型，使用用户的特征向量和项目的特征向量，对UI2vec模型进行训练，UI2vec模型学习用户和项目间的关系并映射到相同的潜在空间；步骤S35：嵌入表示，从UI2vec模型中使用用户ID和项目ID提取用户和项目的嵌入表示；进一步的，步骤S33，具体包括以下内容：以Doc2Vec为基础框架，使用Gensim库构建UI2vec模型，自定义一个类，继承Gensim库中的Doc2Vec类，并重写UI2vec模型的文档标签生成函数；按照拼接规则将用户和项目的特征向量合并成新的标签向量，将步骤S32中的用户ID和项目ID与对应的标签向量相关联；设置参数，包括嵌入维度、上下文窗口大小和负采样数；进一步的，步骤S5，具体包括以下步骤：步骤S51：数据准备，接收用户特征向和项目特征向量；步骤S52：构建模型，设计基于自注意力机制和特征融合的协同过滤模型，包括输入层、特征嵌入层、自注意力层、特征融合层和输出层；步骤S53：自注意力机制计算，动态地计算用户与候选项目之间的相互作用权重；步骤S54：特征融合，将用户特征向量和候选项目的特征向量以及自注意力机制计算得到的相互作用权重进行特征融合；步骤S55：模型训练，对基于自注意力机制和特征融合的协同过滤模型进行训练，同时优化其中参数，得到训练好的基于自注意力机制和特征融合的协同过滤模型；步骤S56：推荐生成，根据候选推荐项目的相似度得分，使用训练好的基于自注意力机制和特征融合的协同过滤模型生成推荐列表；进一步的，步骤S52，具体包括以下内容：输入层：接收用户特征向量和项目特征向量；;其中，特征嵌入层：将输入的用户特征向量和项目特征向量通过嵌入层转换为低维度的特征表示，所用公式如下：其中，自注意力层：采用多头注意力机制计算用户特征向量和项目特征向量之间的相互作用权重，所用公式如下：其中，特征融合层：将计算得到的相互作用权重与原始特征向量进行加权融合，得到用户对候选推荐项目的兴趣程度得分，所用公式如下：其中，输出层：输出用户对每个候选推荐项目的兴趣程度得分；其中，采用上述方案本发明取得的有益效果如下：（1）针对用户推荐方法存在推荐准确性低、个性化程度低的问题，利用UI2vec算法将用户的特征向量和项目的特征向量映射到同一个潜在空间上，使得用户的兴趣和项目的特性在相同的维度上进行比较和计算，提高了相似度计算的准确性，通过嵌入表示，将高维度的用户和项目特征压缩到低维空间，保留了最重要的特征，减少了噪音，提升了推荐结果的准确性，用户和项目的嵌入表示通过UI2vec模型学习，捕捉到用户的个性化偏好和项目的独特特性，从而实现更精准的个性化推荐。（2）针对传统协同过滤算法存在信息重要性难以区分、泛化能力差的问题，使用基于自注意力机制和特征融合的协同过滤算法计算出用户对候选推荐项目的兴趣程度，通过自注意力机制在特征交互中自动分配不同权重，体现信息的重要性差异，优化推荐结果，通过多头注意力机制，捕捉到特征间的多样性相互作用，提高模型的鲁棒性和泛化能力。"
  },
  {
    "专利名": "一种基于分组变形的医学图像配准方法",
    "申请号": "CN202410759214.0",
    "公开日": "20240830",
    "IPC 分类号": "G06T7/33;G06V10/80;G06N3/0464;G06N3/048;G06N3/045;G06V10/74;G06V10/44;G06V10/82;G06N3/0895;G06N3/084",
    "申请人": "大连理工大学",
    "关键词": "分组变形、医学图像配准方法、权值共享的编码器、特征提取、分组模块、卷积层、特征相似性、上下文融合模块、正则化损失、弱监督损失",
    "摘要": "本发明涉及人工智能、深度学习和计算机视觉内容技术领域，尤其涉及一种基于分组变形的医学图像配准方法。使用两个权值共享的编码器提取移动图像和固定图像的特征；构建分组模块，通过卷积层提取不同感受野的特征，计算特征相似性生成相关图；构建上下文融合模块，增强不同组之间的协作性，提高预测准确性；构建损失函数，包括正则化损失和弱监督损失，确保变形场的连续性、平滑性，并引导网络关注感兴趣区域的对齐。旨在解决现有金字塔式配准算法在处理医学图像时存在的问题，如图像错位和计算量过大。通过分组模块对金字塔级别的变形进行进一步分解，简化模型的学习过程，并保留更多信息。",
    "说明书": "一种基于分组变形的医学图像配准方法技术领域本发明涉及人工智能、深度学习和计算机视觉内容技术领域，尤其涉及一种基于分组变形的医学图像配准方法。背景技术近年来，深度学习技术推动了可变形图像配准领域的发展，在大多数数据类型中，学者提出的基于深度学习的可变形图像配准方法在精度和速度方面已经超越了传统的配准方法。在基于深度学习的图像配准方法中，一些研究会出现图像错位，仍然存在计算量成倍增长的问题。因此有些学者提出的一个关键贡献是金字塔形式的配准方法，例如“KangM,Hu X,Huang W,et al.Dual-stream pyramid registration network[J].MedicalImage Analysis,2022,78:102379.”“Zhou S,Hu B,Xiong Z,et al.Self-Distilledhierarchical network for unsupervised deformable image registration[J].IEEETransactions on Medical Imaging,2023,42(8):2162–2175.”“Hu B,Zhou S,Xiong Z,etal.Recursive decomposition network for deformable image registration[J].IEEEJournal of Biomedical and Health Informatics,2022,26(10):5130–5141.”，它在不同尺度上预测变形场，以适应不同尺度的变化。该方法利用低分辨率变形场处理全局变形，而使用高分辨率变形场处理局部细节，被广泛认为是目前性能最优的配准算法之一。但是，这个方法依旧存在一些问题。在该算法中每个金字塔级别只能生成一个变形场，这意味着变形分解的次数受到金字塔层数的限制。此外，对应尺度上的所有变形都要由对应级别的变形场来处理，即需要捕捉大尺度和小尺度的变形。发明内容本发明通过分组模块对金字塔的每个级别的变形进行进一步的分解，以简化模型的学习过程。分组模块提取的特征被送入具有不同大小卷积核的卷积层，以获取不同感受野提取的特征。然后，利用分组相关性计算方法来计算移动图像和固定图像每组特征之间的特征相似性，并且生成相关图。这种方法可以保留更多的信息。除此之外，为了加强组之间的协作性增加了一个上下文融合模块，自适应地融合不同组之间的上下文信息。最终，通过这些预测出的具有不同感受野的变形场，能够专注处理不同大小的变形。将它们融合成一个具有更灵活的感受野范围的变形场，从而能够同时处理大尺度和小尺度的变形。本发明要解决的技术问题是：弥补当前每个金字塔配准方法的不足，提出了一种基于分组变形的医学图像配准方法，达到一个精准有效的医学图像匹配效果。本发明的技术方案如下：一种基于分组变形的医学图像配准方法，使用两个权值共享的编码器分别提取固定图像IFM1234lCl所述分组更新模块包括分组模块和上下文融合模块；分组模块输出变形的变形场和计算的分组相关性；上下文融合模块融合不同分组的上下文特征；所述分组模块共设有4级，其中第1级分组模块的输入为第1级移动图像特征FM1F1MlFlllMlFll3l分组模块中采用分组相关性表示图表对应性，第i组相关性的计算公式如下：其中a,b,c代表x，y，z三个方向上的位移大小，三个位移大小的范围满足a,b,c∈[-r,r]，其中，r表示最大位移半径;表示先进行内积再沿着通道的方向进行平均的操作；把每个分组对应的ll所述上下文融合模块，首先对相邻两组的上下文特征所述损失函数包括正则化损失函数和弱监督损失函数；所述正则化损失函数Lreg其中l表示输出变形场的各个层级；移动图像和固定图像的分割标注其中C表示解剖结构类别的数量；因此，所述编码器包括7个卷积层、实例归一化和激活函数；所述卷积层的卷积核的大小均为3×3×3、步长为1的卷积负责提取特征，步长为2的卷积负责采样；所述激活函数为采用“泄露值”为0.2的LeakyRLU激活函数。训练方法本方法基于Pytorch框架实现，使用Adam优化器进行梯度和学习率的更新。总的训练迭代次数为100000次，前88000次的迭代过程学习率设置为1e-4，后12000此迭代过程学习率设置为1e-5。在本发明中，我们使用了公开的OASIS图像数据集。在这些数据集中，我们随机选取了x张已经标注的图像，并将它们作为参照图像。数据集中剩余的图像则被定义为待配准的移动图像。这些移动图像随后被进一步随机分配到三个不同的集合中：一部分用于模型的训练，一部分用于模型的验证，最后一部分用于模型的测试。这样的划分确保了网络能够在不同阶段进行有效的学习和性能评估。表1.1所有缩写符号的解释本发明的有益效果：本发明旨在解决现有金字塔式配准算法在处理医学图像时存在的问题，如图像错位和计算量过大。通过分组模块对金字塔级别的变形进行进一步分解，简化模型的学习过程，并保留更多信息。这种医学图像配准方法采用了分组变形的方式，通过分组模块对金字塔的每个级别的变形进行进一步的分解，以简化模型的学习过程。分组模块提取的特征被送入具有不同大小卷积核的卷积层，以获取不同感受野提取的特征。然后，利用分组相关性计算方法来计算移动图像和固定图像每组特征之间的特征相似性，并且生成相关图。这种方法可以保留更多的信息。除此之外，为了加强组之间的协作性增加了一个上下文融合模块，自适应地融合不同组之间的上下文信息。最终，通过这些预测出的具有不同感受野的变形场，能够专注处理不同大小的变形。将它们融合成一个具有更灵活的感受野范围的变形场，从而能够同时处理大尺度和小尺度的变形。"
  },
  {
    "专利名": "背景音乐的确定方法、装置、设备、存储介质和程序产品",
    "申请号": "CN202410757565.8",
    "公开日": "20240830",
    "IPC 分类号": "G10L25/63;H04M3/42",
    "申请人": "中国工商银行股份有限公司",
    "关键词": "背景音乐确定、情绪评估类别、智能化程度、人工智能、等待语音数据、第一情绪评估类别",
    "摘要": "本申请涉及一种背景音乐的确定方法、装置、计算机设备、计算机可读存储介质和计算机程序产品，涉及人工智能领域。方法包括：获取用户在当前通话等待过程中的第一等待语音数据；根据第一等待语音数据，确定第一等待语音数据对应的第一情绪评估类别；根据第一情绪评估类别，确定目标背景音乐，目标背景音乐用于在当前通话等待过程中进行播放。采用本方法能够提高在通话等待过程中，向用户提供的背景音乐的智能化程度。",
    "说明书": "背景音乐的确定方法、装置、设备、存储介质和程序产品技术领域本申请涉及人工智能技术领域，特别是涉及一种背景音乐的确定方法、装置、计算机设备、计算机可读存储介质和计算机程序产品。背景技术通常，在用户拨打客服电话的场景中，当用户等待通话接听或者电话转接的过程中时，电话系统可以向用户播放背景音乐。然而，现有的电话系统只能向用户提供统一、单调的背景音乐，无法根据不同用户的不同情绪提供相应的背景音乐。因此，传统技术中存在通话等待过程中，向用户提供的背景音乐的智能化程度较低的问题。发明内容基于此，有必要针对上述技术问题，提供一种能够提高在通话等待过程中，向用户提供背景音乐的智能化程度的背景音乐的确定方法、装置、计算机设备、计算机可读存储介质和计算机程序产品。第一方面，本申请提供了一种背景音乐的确定方法。所述方法包括：获取用户在当前通话等待过程中的第一等待语音数据；根据所述第一等待语音数据，确定所述第一等待语音数据对应的第一情绪评估类别；根据所述第一情绪评估类别，确定目标背景音乐，所述目标背景音乐用于在所述当前通话等待过程中进行播放。在其中一个实施例中，所述根据所述第一情绪评估类别，确定目标背景音乐，包括：根据所述第一情绪评估类别，从预设的音乐推荐数据库中获取多个候选音乐推荐方案，所述候选音乐推荐方案包括参考情绪类别、背景音乐和第一音乐匹配度之间的映射关系，所述参考情绪类别与所述第一情绪评估类别之间的相似度大于预设的相似度阈值；从各所述候选音乐推荐方案中确定目标音乐推荐方案，并将所述目标音乐推荐方案所包括的背景音乐作为所述目标背景音乐，所述目标音乐推荐方案包括的第一音乐匹配度大于第一匹配度阈值。在其中一个实施例中，所述方法还包括：获取多个用户在历史通话等待过程中播放的背景音乐以及各所述用户在历史通话过程中的历史通话语音数据；针对每个用户，识别所述历史通话语音数据对应的参考情绪类别，并计算所述背景音乐与所述参考情绪类别之间的第一音乐匹配度；根据各所述用户的所述参考情绪类别、所述背景音乐和所述第一音乐匹配度之间的映射关系，建立所述音乐推荐数据库。在其中一个实施例中，所述根据所述第一等待语音数据，确定所述第一等待语音数据对应的第一情绪评估类别，包括：对所述第一等待语音数据进行特征提取处理，得到包含时序特征信息的语音特征；将所述语音特征输入预设的情绪模型中，得到所述第一情绪评估类别。在其中一个实施例中，所述对所述第一等待语音数据进行特征提取处理，得到包含时序特征信息的语音特征，包括：对所述第一等待语音数据进行预处理，得到所述第一等待语音数据对应的频谱，所述预处理包括预加重处理、分帧处理、加窗处理、短时傅里叶变换处理中的至少一种；利用梅尔尺度的滤波器组，计算所述频谱对应的梅尔滤波器组能量；对所述梅尔滤波器组能量进行转换处理，得到梅尔频率倒谱；从所述梅尔频率倒谱中提取多个系数作为所述语音特征。在其中一个实施例中，所述情绪模型包括编码器和分类器，所述将所述语音特征输入预设的情绪模型中，得到所述第一情绪评估类别，包括：将所述语音特征输入所述编码器中，得到高维语音特征，所述高维语音特征中包含的语音信息多于所述语音特征中包含的语音信息；将所述高维语音特征输入所述分类器中，得到所述第一情绪评估类别。在其中一个实施例中，所述确定目标背景音乐之后，所述方法还包括：播放所述目标背景音乐，并在预设时长之后，采集所述用户在当前通话等待过程中的第二等待语音数据；计算所述第二等待语音数据对应第二情绪评估类别与所述目标背景音乐之间的第二音乐匹配度；若所述第二音乐匹配度小于第二匹配度阈值，则根据所述第二情绪评估类别，重新确定所述目标背景音乐。第二方面，本申请还提供了一种背景音乐的确定装置。所述装置包括：第一获取模块，用于获取用户在当前通话等待过程中的第一等待语音数据；第一确定模块，用于根据所述第一等待语音数据，确定所述第一等待语音数据对应的第一情绪评估类别；第二确定模块，用于根据所述第一情绪评估类别，确定目标背景音乐，所述目标背景音乐用于在所述当前通话等待过程中进行播放。第三方面，本申请还提供了一种计算机设备。所述计算机设备包括存储器和处理器，所述存储器存储有计算机程序，所述处理器执行所述计算机程序时实现上述第一方面所述的方法的步骤。第四方面，本申请还提供了一种计算机可读存储介质。所述计算机可读存储介质，其上存储有计算机程序，所述计算机程序被处理器执行时实现上述第一方面所述的方法的步骤。第五方面，本申请还提供了一种计算机程序产品。所述计算机程序产品，包括计算机程序，该计算机程序被处理器执行时实现上述第一方面所述的方法的步骤。上述背景音乐的确定方法、装置、计算机设备、计算机可读存储介质和计算机程序产品，终端首先获取用户在当前通话等待过程中的第一等待语音数据，接着，根据第一等待语音数据，确定第一等待语音数据对应的第一情绪评估类别，而后，根据第一情绪评估类别，确定目标背景音乐，从而能够在当前通话等待过程中进行播放目标背景音乐，由于该背景音乐的确定方法中，根据用户当前的第一等待语音数据确定了情绪评估分类，使得确定的情绪评估分类能够更加贴符合用户当前的情绪状态，从而使得根据情绪评估分类确定的目标背景音乐与用户当前的情绪状态之间的匹配度更高，进而能够实现根据用户的第一情绪评估类别确定对应的背景音乐，提高了在通话等待过程中，向用户提供的背景音乐的智能化程度。"
  },
  {
    "专利名": "一种基于人工智能网页自动生成的方法及系统",
    "申请号": "CN202410761981.5",
    "公开日": "20240809",
    "IPC 分类号": "G06F9/451;G06F40/16;G06N3/045;G06F8/38;G06F40/30",
    "申请人": "山东广电信通网络运营有限公司",
    "关键词": "人工智能、网页自动生成、自然语言处理、特征提取、特征匹配、机器学习算法、自动化网页搭建、网页开发技术、私有化AI模型、网页设计元素、无代码平台",
    "摘要": "本发明涉及网页开发技术领域，尤其是涉及一种基于人工智能网页自动生成的方法及系统。方法包括：获取用户指令；构建私有化AI模型，通过自然语言处理方法对私有化AI模型进行训练；利用训练好的私有化AI模型对用户指令进行特征提取和特征匹配，得到初步网页框架；通过机器学习算法，对初步网页框架进行自动化网页搭建，得到网页架构。本发明采用人工智能技术，结合无代码平台，实现网页的自动化生成。通过AI对网页设计元素的智能解析和用户指令的深度语义分析，本技术旨在极大简化网页开发流程，降低技术门槛，为用户提供一种快速、高效的网页创建途径。",
    "说明书": "一种基于人工智能网页自动生成的方法及系统技术领域本发明涉及网页开发技术领域，尤其是涉及一种基于人工智能网页自动生成的方法及系统。背景技术在现代网页开发实践中，传统编码方法面临效率和专业性的双重挑战。效率方面：自动化程度低：传统编码方法通常需要开发者手动编写大量的代码来实现网页功能。这种方式的效率受限于开发者的技术水平、工作经验以及编写代码的速度。相比之下，人工智能自动生成网页技术可以通过机器学习和深度学习算法，快速分析和理解网页需求和结构，自动生成高质量的代码，从而显著提高开发效率。重复劳动多：在传统编码过程中，开发者经常需要重复编写类似的代码片段，这既浪费时间又容易出错。而人工智能自动生成网页技术可以学习并记忆过去的代码模式，智能推荐或自动补全代码，减少了不必要的重复劳动。适应变化慢：随着技术的不断发展和用户需求的不断变化，网页开发也需要不断适应新的需求和挑战。传统编码方法需要开发者手动修改代码来适应这些变化，而人工智能自动生成网页技术可以通过自我学习和优化，快速适应新的需求和挑战，减少了修改代码的时间和成本。专业性方面：设计局限性：传统编码方法往往受到开发者个人经验和设计思路的局限，难以实现复杂的布局和交互效果。而人工智能自动生成网页技术可以通过学习大量的优秀设计案例和用户行为数据，自动生成符合用户需求和审美习惯的设计方案，提高了设计的专业性和创新性。安全性考虑不足：在编写代码的过程中，传统编码方法往往难以充分考虑到安全性的问题，容易留下安全隐患。而人工智能自动生成网页技术可以通过内置的安全检测机制，自动检测并修复潜在的安全漏洞，提高了网页的安全性。优化能力不足：传统编码方法在实现网页功能后，往往需要手动进行性能优化和用户体验优化。而人工智能自动生成网页技术可以通过智能分析和预测用户行为，自动优化页面加载速度、响应时间以及用户交互体验等方面，提高了网页的性能和用户满意度。可扩展性差：随着业务的发展和用户需求的增长，网页的功能和复杂性也会不断增加。传统编码方法在面对这些变化时，往往需要重新编写或修改大量的代码，可扩展性差。而人工智能自动生成网页技术可以通过智能扩展和升级机制，快速适应新的功能和需求，提高了网页的可扩展性和可维护性。因此亟需采用人工智能技术，结合无代码平台，实现网页的自动化生成。发明内容为了解决上述提到的问题，本发明提供一种基于人工智能网页自动生成的方法及系统。通过AI对网页设计元素的智能解析和用户指令的深度语义分析，本技术旨在极大简化网页开发流程，降低技术门槛，为用户提供一种快速、高效的网页创建途径。第一方面，本发明提供的一种基于人工智能网页自动生成的方法，采用如下的技术方案：一种基于人工智能网页自动生成的方法，包括：获取用户指令；构建私有化AI模型，通过自然语言处理方法对私有化AI模型进行训练；利用训练好的私有化AI模型对用户指令进行特征提取和特征匹配，得到初步网页框架；通过机器学习算法，对初步网页框架进行自动化网页搭建，得到网页架构。进一步地，所述获取用户指令，包括基于页面交互获取用户提交的具体指令，包括网页生成指令。进一步地，所述构建私有化AI模型，包括构建结构化和可编辑的网页模板，并搭建私有化AI模型，通过网页模板的素材对私有化AI模型进行训练。进一步地，所述通过自然语言处理方法对私有化AI模型进行训练，包括利用自然语言处理方法，对网页模板内的元素进行语义描述，并审核语义描述的精准度进行模型优化。进一步地，所述利用训练好的私有化AI模型对用户指令进行特征提取和特征匹配，得到初步网页框架，包括通过自然语言处理方法提取用户指令的特征，利用私有化AI模型对提取的特征进行特征匹配，构建得到初步的网页框架。进一步地，所述过机器学习算法，对初步网页框架进行自动化网页搭建，得到网页架构，包括利用机器学习算法，自动组合匹配后的特征和元素，生成网页的基础框架，并对网页的基础框架进行前端渲染，得到网页架构。进一步地，所述过机器学习算法，对初步网页框架进行自动化网页搭建，得到网页架构，还包括利用随机森林模型学习特征和元素的关系，并根据学习到的关系对提取的特征进行组合匹配，生成网页的基础框架。第二方面，一种基于人工智能网页自动生成的系统，包括：数据获取模块，被配置为，获取用户指令；模型模块，被配置为，构建私有化AI模型，通过自然语言处理方法对私有化AI模型进行训练；特征模块，被配置为，利用训练好的私有化AI模型对用户指令进行特征提取和特征匹配，得到初步网页框架；计算模块，被配置为，通过机器学习算法，对初步网页框架进行自动化网页搭建，得到网页架构。第三方面，本发明提供一种计算机可读存储介质，其中存储有多条指令，所述指令适于由终端设备的处理器加载并执行所述的一种基于人工智能网页自动生成的方法。第四方面，本发明提供一种终端设备，包括处理器和计算机可读存储介质，处理器用于实现各指令；计算机可读存储介质用于存储多条指令，所述指令适于由处理器加载并执行所述的一种基于人工智能网页自动生成的方法。综上所述，本发明具有如下的有益技术效果：本发明采用人工智能技术，结合无代码平台，实现网页的自动化生成。通过AI对网页设计元素的智能解析和用户指令的深度语义分析，本技术旨在极大简化网页开发流程，降低技术门槛，为用户提供一种快速、高效的网页创建途径。"
  },
  {
    "专利名": "一站式人工智能图像处理模型构建方法及装置",
    "申请号": "CN202410760236.9",
    "公开日": "20240712",
    "IPC 分类号": "G06V10/26;G06V10/75;G06V20/70;G06V10/764;G06V10/40;G06V10/774;G06V10/94;G06F16/51",
    "申请人": "杭州宇泛智能科技股份有限公司",
    "关键词": "一站式人工智能、图像处理模型、图像标注任务、模型训练、前处理接口、推理接口、后处理接口、模型精度、模型部署",
    "摘要": "本申请实施例提供一种一站式人工智能图像处理模型构建方法及装置，方法包括：创建图像标注任务，确定对应的图像处理模型的结构，并根据所述标准化标签存储的图像数据进行图像处理模型的训练，得到所述图像处理模型；根据与图像处理模型对应的模型定义规范确定目标部署硬件相应的前处理接口、推理接口以及后处理接口，通过推理接口将经过前处理接口处理后的标准化标签存储的图像数据输入至图像处理模型，并通过后处理接口处理图像处理模型的模型输出，根据模型输出确定对应的模型精度，在模型精度符合预设精度条件时将图像处理模型部署至目标部署硬件；本申请能够实现数据标注、模型训练、模型转换和模型部署等全流程的一体化集成,提高开发效率,降低开发成本,确保训练精度与部署精度的高度一致性。",
    "说明书": "一站式人工智能图像处理模型构建方法及装置技术领域本申请涉及人工智能领域，具体涉及一种一站式人工智能图像处理模型构建方法及装置。背景技术人工智能技术近年来得到了快速发展,在计算机视觉、自然语言处理、语音识别等领域都取得了重大进展。一个完整的人工智能模型开发通常包括数据收集与标注、模型训练与测试、模型转换与部署等多个步骤。然而,现有的人工智能模型构建流程存在诸多问题和挑战。首先,数据标注是人工智能模型开发的基础,但传统的数据标注工作效率较低,且存在标签数据格式不统一的问题。通常情况下,数据标注需要人工进行,流程繁琐,效率较低。同时,不同项目或团队使用的标注格式各不相同,给后续的模型训练和部署带来诸多不便。其次,模型训练与测试也是人工智能模型开发的关键环节。目前,研发人员通常需要在多个不同的平台和工具之间切换,比如使用Pytorch或TensorFlow进行模型训练,再借助ONNX或TensorRT进行模型转换和量化。这种碎片化的开发模式不仅效率低下,而且容易出现人为失误。此外,现有的模型训练方式往往无法充分考虑实际部署环境的硬件性能和部署要求,导致训练出的模型在实际部署时无法充分发挥性能。再者,模型转换与量化也是人工智能模型开发的关键环节。不同的硬件平台对模型的算子支持、精度要求等存在差异,需要针对性地进行模型转换和量化。这通常需要研发人员具备丰富的硬件知识和编程经验,才能完成这一转换过程。然而现实中,大多数算法工程师并非硬件专家,很难高效地完成模型转换和量化工作。最后,模型部署阶段也存在一些问题。即使经过前述的模型转换和量化,训练出的模型在实际部署时仍可能出现精度下降的情况。这是因为,模型在训练环境和部署环境之间存在差异,比如输入数据的预处理、后处理逻辑等细节信息无法完全对齐。导致训练精度无法完全对应实际部署精度,这给应用落地带来了不确定性。综上所述,现有的人工智能模型开发流程存在数据标注效率低、模型训练效率低、模型转换复杂、部署精度无法对齐等问题。这些问题不仅增加了人工智能模型开发的复杂度和成本,也极大地限制了人工智能技术在实际应用中的普及和推广。发明内容针对现有技术中的问题，本申请提供一种一站式人工智能图像处理模型构建方法及装置，能够实现数据标注、模型训练、模型转换和模型部署等全流程的一体化集成,提高开发效率,降低开发成本,确保训练精度与部署精度的高度一致性。为了解决上述问题中的至少一个，本申请提供以下技术方案：第一方面，本申请提供一种一站式人工智能图像处理模型构建方法，包括：创建图像标注任务，根据所述图像标注任务确定对应的预标注模型，并根据所述预标注模型对预设图像数据进行预标注处理，将经过所述预标注处理后的图像数据按照数据类型进行相应的标准化标签存储；接收用户选定的目标部署硬件和目标模型运行速度，根据各预设图像处理模型在所述目标部署硬件上的预先测评速度与所述目标模型运行速度的数值比较关系，确定对应的图像处理模型的结构，并根据所述标准化标签存储的图像数据进行图像处理模型的训练，得到所述图像处理模型；根据所述目标部署硬件的具体类型将所述图像处理模型转换为对应的可执行格式并将所述图像处理模型的浮点参数量化成整数或定点数，得到经过格式转换和参数量化后的图像处理模型；根据与所述图像处理模型对应的模型定义规范确定所述目标部署硬件相应的前处理接口、推理接口以及后处理接口，通过所述推理接口将经过所述前处理接口处理后的所述标准化标签存储的图像数据输入至所述图像处理模型，并通过所述后处理接口处理所述图像处理模型的模型输出，根据所述模型输出确定对应的模型精度，在所述模型精度符合预设精度条件时将所述图像处理模型部署至所述目标部署硬件。进一步地，所述根据所述图像标注任务确定对应的预标注模型，并根据所述预标注模型对预设图像数据进行预标注处理，包括：根据所述图像标注任务的任务类型和预设图像数据的数据特征，确定对应的预标注模型；将所述预设图像数据输入所述预标注模型进行预标注处理，得到经过预标注后的图像数据。进一步地，所述根据所述图像标注任务的任务类型和预设图像数据的数据特征，确定对应的预标注模型，包括：确定所述图像标注任务的任务类型，根据所述任务类型确定图像识别侧重特征，其中，所述任务类型包括图像分类任务、图像检测任务以及图像分割任务，所述图像识别侧重特征包括侧重全局特征和侧重局部特征；对预设图像数据进行关键特征提取，得到对应的图像特征，并根据所述图像特征和所述任务类型从预设模型库中匹配对应的预标注模型。进一步地，所述根据所述图像特征和所述任务类型从预设模型库中匹配对应的预标注模型，包括：对所述图像特征和所述任务类型进行编码转换，得到对应的特征编码和任务类型编码，计算所述特征编码和所述任务类型编码与预设模型库中各预标注模型的模型性能编码之间的欧几里得距离；根据所述欧几里得距离确定与所述各预标注模型的匹配度，并将所述匹配度最大的模型确定为对应的预标注模型。进一步地，所述将经过所述预标注处理后的图像数据按照数据类型进行相应的标准化标签存储，包括：将预标注为目标检测、关键点检测以及实例分割标签的图像数据采用Coco标准格式存储；将预标注为图像分类标签的图像数据采用OpenMMLab标准格式存储。进一步地，所述根据所述目标部署硬件的具体类型将所述图像处理模型转换为对应的可执行格式并将所述图像处理模型的浮点参数量化成整数或定点数，得到经过格式转换和参数量化后的图像处理模型，包括：根据所述目标部署硬件的具体类型调整所述图像处理模型中数据的排列方式；根据所述图像处理模型的量化因子和偏移量将点数值转换为整数值，得到经过格式转换和参数量化后的图像处理模型。进一步地，所述通过所述推理接口将经过所述前处理接口处理后的所述标准化标签存储的图像数据输入至所述图像处理模型，并通过所述后处理接口处理所述图像处理模型的模型输出，根据所述模型输出确定对应的模型精度，包括：通过所述前处理接口处理所述标准化标签存储的图像数据，通过所述推理接口将经过所述前处理接口处理后的图像数据输入到所述图像处理模型中，并运行所述图像处理模型；通过所述后处理接口处理所述目标部署硬件在运行所述图像处理模型后的模型输出，并根据所述模型输出确定对应的模型精度。第二方面，本申请提供一种一站式人工智能图像处理模型构建装置，包括：预标注模块，用于创建图像标注任务，根据所述图像标注任务确定对应的预标注模型，并根据所述预标注模型对预设图像数据进行预标注处理，将经过所述预标注处理后的图像数据按照数据类型进行相应的标准化标签存储；训练评估模块，用于接收用户选定的目标部署硬件和目标模型运行速度，根据各预设图像处理模型在所述目标部署硬件上的预先测评速度与所述目标模型运行速度的数值比较关系，确定对应的图像处理模型的结构，并根据所述标准化标签存储的图像数据进行图像处理模型的训练，得到所述图像处理模型；量化转换模块，用于根据所述目标部署硬件的具体类型将所述图像处理模型转换为对应的可执行格式并将所述图像处理模型的浮点参数量化成整数或定点数，得到经过格式转换和参数量化后的图像处理模型；测试部署模块，用于根据与所述图像处理模型对应的模型定义规范确定所述目标部署硬件相应的前处理接口、推理接口以及后处理接口，通过所述推理接口将经过所述前处理接口处理后的所述标准化标签存储的图像数据输入至所述图像处理模型，并通过所述后处理接口处理所述图像处理模型的模型输出，根据所述模型输出确定对应的模型精度，在所述模型精度符合预设精度条件时将所述图像处理模型部署至所述目标部署硬件。第三方面，本申请提供一种电子设备，包括存储器、处理器及存储在存储器上并可在处理器上运行的计算机程序，所述处理器执行所述程序时实现所述的一站式人工智能图像处理模型构建方法的步骤。第四方面，本申请提供一种计算机可读存储介质，其上存储有计算机程序，该计算机程序被处理器执行时实现所述的一站式人工智能图像处理模型构建方法的步骤。第五方面，本申请提供一种计算机程序产品，包括计算机程序/指令，该计算机程序/指令被处理器执行时实现所述的一站式人工智能图像处理模型构建方法的步骤。由上述技术方案可知，本申请提供一种一站式人工智能图像处理模型构建方法及装置，通过创建图像标注任务，确定对应的图像处理模型的结构，并根据所述标准化标签存储的图像数据进行图像处理模型的训练，得到所述图像处理模型；根据与图像处理模型对应的模型定义规范确定目标部署硬件相应的前处理接口、推理接口以及后处理接口，通过推理接口将经过前处理接口处理后的标准化标签存储的图像数据输入至图像处理模型，并通过后处理接口处理图像处理模型的模型输出，根据模型输出确定对应的模型精度，在模型精度符合预设精度条件时将图像处理模型部署至目标部署硬件，由此能够实现数据标注、模型训练、模型转换和模型部署等全流程的一体化集成,提高开发效率,降低开发成本,确保训练精度与部署精度的高度一致性。"
  },
  {
    "专利名": "一种模型能力集成管理方法、系统及电子设备",
    "申请号": "CN202410760266.X",
    "公开日": "20240823",
    "IPC 分类号": "G06N20/00;G06F11/36",
    "申请人": "重庆中科云从科技有限公司",
    "关键词": "模型能力集成管理方法、系统及电子设备、模块化设计、推理方式、配置模块化、人工智能",
    "摘要": "本发明涉及人工智能领域，具体提供一种模型能力集成管理方法、系统及电子设备，旨在解决或至少部分地解决由于模型训练、迭代缺乏模块化设计所导致的测试繁琐，以及降低了系统可扩展性、兼容性、低代码性、快速迭代能力。本发明方案为：基于配置文件解析结果，对多种模型中的每种模型对应的运行支撑条件、推理方式进行初始化；基于应用请求中的参数信息，确定执行的目标模型及对应的推理方式，对应用请求进行推理，获取推理结果。通过配置模块化和具体模块可扩展实现多种模型在一套系统的对比测试，降低了测试复杂度；同时，快速接入新的推理模型框架和新模型实现方式，提高了系统可扩展性、兼容性、低代码性、快速迭代能力。",
    "说明书": "一种模型能力集成管理方法、系统及电子设备技术领域本发明涉及人工智能领域，具体提供一种模型能力集成管理方法、系统及电子设备。背景技术大模型技术发展迅猛，开源社区开源的大模型种类繁多，各家人工智能厂商自有大模型也是百花齐放。模型训练周期长，集成测试时针对同样的测试用例，往往需要进行多模型AB对照测试；同时，模型技术更新迭代快，其中包括模型结构的变动，词表优化，token解析方式的更新等，这些高频变化对提供大模型解析能力的系统的可扩展性、兼容性、低代码性、快速迭代能力提出严苛的要求。如何在大模型技术高频迭代的背景下实现模型能力解析系统的敏捷开发和快速、高效的集成验证测试是当前大模型能被快速推广到终端，形成切实应用，赋能百业的重要一环和亟待优化的问题。相应地，本领域需要一种模型能力集成管理方案来解决上述技术问题。发明内容为了克服上述缺陷，提出了本发明，以提供解决或至少部分地解决由于模型训练、迭代缺乏模块化设计所导致的测试繁琐，以及降低了提供大模型解析能力的系统的可扩展性、兼容性、低代码性、快速迭代能力。在第一方面，本发明提供一种模型能力集成管理方法，包括：基于配置文件解析结果，对多种模型中的每种模型对应的运行支撑条件、推理方式进行初始化；基于应用请求中的参数信息，确定执行的目标模型及与所述目标模型对应的推理方式，并基于所述推理方式对所述应用请求进行推理，获取推理结果。在一个实施例中，配置文件解析结果包括以下至少之一：模型类型、模型文件路径、承载模型运行的设备信息、提示词模板、tokenizer文件路径、推理方式、模型支持的任务类型。在一个实施例中，所述模型类型包括以下至少之一：llama、bloom、qwen、baichuan；所述模型文件路径，用于根据该模型文件路径找到对应的模型；所述推理方式包括以下至少之一：text generation inference、vllm、transformers、tensorrt-llm；所述任务类型包括以下至少之一：文本生成、文本翻译、文本分类、文本关键词提取、文生图、文生视频、文生代码。在一个实施例中，基于配置文件解析结果，对多种模型中的每种模型对应的运行支撑条件进行初始化的过程为：基于所述tokenizer文件路径，读取文件，完成模型token生成方式初始化、模型输入预处理方法的初始化、模型输出后处理方式的初始化。在一个实施例中，若缺乏所述运行支撑条件，则通过模型能力集成系统中模型实现抽象层定义的接口，完成对应运行支撑条件的封装集成。在一个实施例中，基于配置文件解析结果，对多种模型中的每种模型对应的推理方式进行初始化的过程为：基于所述模型文件路径，读取对应的模型权重文件，实现模型的载入，完成模型推理方式的初始化。在一个实施例中，若缺乏所述推理方式，则通过模型能力集成系统中模型推理抽象层定义的推理接口，完成对应推理方式的封装集成。在第二方面，本发明提供一种模型能力集成管理系统，包括：初始化模块、推理模块；其中，所述初始化模块，用于基于配置文件解析结果，对多种模型中的每种模型对应的运行支撑条件、推理方式进行初始化；所述推理模块，用于基于应用请求中的参数信息，确定执行的目标模型及与所述目标模型对应的推理方式，并基于所述推理方式对所述应用请求进行推理，获取推理结果。在第三方面，提供一种电子设备，包括处理器和存储器，其中所述存储器中存储有程序，所述处理器执行所述程序时实现上述方法的技术方案中任一项技术方案所述的模型能力集成管理方法。在第四方面，提供一种可读存储介质，存储有程序，所述程序被执行时实现上述方法的技术方案中任一项技术方案所述的模型能力集成管理方法。本发明上述一个或多个技术方案，至少具有如下一种或多种有益效果：本发明的技术方案：基于配置文件解析结果，对多种模型中的每种模型对应的运行支撑条件、推理方式进行初始化；基于应用请求中的参数信息，确定执行的目标模型及与所述目标模型对应的推理方式，并基于所述推理方式对所述应用请求进行推理，获取推理结果。上述方案，将推理与模型实现高度抽象，模块化，可以快速接入新的推理模型框架和新模型实现方式，实现能力扩展与其他功能完全解耦，提高了提供大模型解析能力的系统的可扩展性、兼容性、低代码性、快速迭代能力。开发完成后，系统仅需通过配置模块就可以实现多个模型推理架构的自由切换和多个模型对比测试。通过配置模块化和具体模块可扩展实现多种模型在一套系统的对比测试，降低了测试复杂度。"
  },
  {
    "专利名": "一种基于人工智能的智慧供应链管理方法",
    "申请号": "CN202410760146.X",
    "公开日": "20240712",
    "IPC 分类号": "G06Q10/087;G06Q30/0202",
    "申请人": "杭州字节方舟科技有限公司",
    "关键词": "智慧供应链管理方法、目标商品预测请求、目标预测模型、采购数据计算、自动化预测方法、智慧供应链",
    "摘要": "一种基于人工智能的智慧供应链管理方法，涉及智慧供应链管理技术领域。在该方法中，响应于用户输入的目标商品预测请求；根据目标商品预测请求得到供应链待测数据；将供应链待测数据输入目标预测模型中，得到目标预测结果；获取目标仓库中目标商品对应的目标库存数据；获取目标预测结果对应的第一采购数据，对第一采购数据与目标库存数据进行计算，得到第二采购数据；将第二采购数据向用户进行展示，以便用户根据第二采购数据对目标商品进行采购。实施本申请提供的技术方案，通过引入自动化和智能化的预测方法，并结合实时库存数据，有效解决传统预测方法存在的问题，减少采购计划与实际需求的偏差，从而降低库存积压的风险。",
    "说明书": "一种基于人工智能的智慧供应链管理方法技术领域本申请涉及智慧供应链管理技术领域，具体涉及一种基于人工智能的智慧供应链管理方法。背景技术由于供应链涉及多个环节，如原材料采购、生产加工、库存控制以及物流配送等，每个环节都伴随庞大的数据量。对这些数据量进行深入分析，以获取精准的预测结果，成为企业降低仓库积压货物风险的重要途径。但传统的预测方法，往往依赖于人工进行预测，人工预测都是基于历史经验对商品的销售情况进行预测，但人工预测结果存在较大偏差，无法基于客户的需求进行预测，导致采购计划与实际需求脱节，进而造成库存积压。因此，亟需可解决上述技术问题的一种基于人工智能的智慧供应链管理方法。发明内容本申请提供了一种基于人工智能的智慧供应链管理方法，该方法通过引入自动化和智能化的预测方法，并结合实时库存数据，能有效解决传统预测方法存在的问题，减少采购计划与实际需求的偏差，从而降低库存积压的风险。第一方面，本申请提供了一种基于人工智能的智慧供应链管理方法，应用于智能监测平台中，方法包括：响应于用户输入的目标商品预测请求，目标商品为目标企业中待售卖的商品；根据目标商品预测请求得到供应链待测数据；将供应链待测数据输入目标预测模型中，得到目标预测结果；获取目标仓库中目标商品对应的目标库存数据，目标仓库为存放目标商品对应的仓库；获取目标预测结果对应的第一采购数据，对第一采购数据与目标库存数据进行计算，得到第二采购数据；将第二采购数据向用户进行展示，以便用户根据第二采购数据对目标商品进行采购。通过采用上述技术方案，响应于用户输入的目标商品预测请求获取供应链待测数据，再将供应链待测数据输入目标预测模型中，得到目标预测结果，这种方法比传统的人工预测更加客观和准确，再通过获取目标仓库中实时的库存数据，确保目标预测结果与实际库存状态保持同步，避免因信息滞后导致采购计划不准确的问题；根据目标预测结果来确定第二采购数据，使得采购计划更加贴近实际需求，减少因采购过多或过少导致的库存问题。可选的，在将供应链待测数据输入目标预测模型中，得到目标预测结果之前，需构建目标预测模型，具体包括：获取历史数据样本集，历史数据样本集包括位置数据、月份数据、对标企业数据、销量数据以及用户群体数据；对历史数据样本集进行预处理，得到预处理后的历史数据样本集；对预处理后的历史数据样本集进行特征提取，得到数据待测集；使用数据待测集训练模型，得到目标预测模型，目标预测模型包括数据待测集与目标预测结果之间的对应关系。通过采用上述技术方案，收集包含位置数据、月份数据、对标企业数据、销售数据以及用户群体数据等在内的历史数据样本集，对历史数据样本集进行处理，进而构建目标预测模型，目标预测模型可以准确地预测目标商品的需求情况，多维度的数据输入使得目标预测模型能够更全面地考虑各自可能的因素，提高预测的准确性，目标预测模型可以为企业制定采购计划、库存管理等决策提供有力支持，避免库存积压等问题。可选的，在将第二采购数据向用户进行展示，以便用户根据第二采购数据对目标商品进行采购之后，方法还包括：根据第一预测规则，获取目标商品处于第一时间点对应的第一销售数据；判断第一销售数据是否等于第二销售数据，第二销售数据为目标预测模型预测处于第一时间点对应的销售数据；当第一销售数据小于第二销售数据时，确认目标商品处于销售第一异常状态；获取第一销售数据对应的目标子企业，目标子企业为目标企业中任意一个子企业；根据第一销售异常状态对目标子企业进行备选标记，以便目标子企业对目标商品进行出售。通过采用上述技术方案，获取处于第一时间点的第一销售数据，再通过目标预测模型预测处于第一时间点对应的第二销售数据，比较第一销售数据与第二销售数据，能够实时监控目标商品的销售状态，并快速识别出销售异常，当第一销售数据小于第二销售数据时，确认目标商品处于销售第一异常状态，对目标子企业进行备选标记，以便于目标子企业根据销售第一异常状态灵活调整销售策略，从而优化库存配置，避免资源浪费和库存积压。可选的，在判断第一销售数据是否等于第二销售数据之后，方法还包括：当第一销售数据大于第二销售数据时，确认目标商品处于销售第二异常状态；根据销售第二异常状态确定补货方案，以便根据补货方案对目标商品进行补充。通过采用上述技术方案，当第一销售数据大于第二销售数据时，表明目标商品的市场需求超出预期，确认目标商品处于销售第二异常状态，再根据销售第二异常状态制定补货方案，确保目标商品的库存量能够满足市场需求，有助于避免缺货情况的发生，以维持市场的正常供应。可选的，根据销售第二异常状态确定补货方案，具体包括：获取补货需求，根据补货需求调取备选企业，备选企业为进行备选标记的企业；获取目标企业与备选企业之间的第一运行成本；获取第二运行成本，第二运行成本为目标企业与备选供应商之间的采购成本；判断第一运行成本是否大于第二运行成本；当第一运行成本大于第二运行成本时，则确认向备选供应商采购目标商品，补货方案为选择备选供应商进行补货。通过采用上述技术方案，根据补货需求，在处于销售第二异常状态时快速找到能够补充目标商品的备选企业，再获取目标企业与备选企业之间的第一运行成本，以及目标企业与备选供应商之间的第二运行成本，比较第一运行成本和第二运行成本，当第一运行成本大于第二运行成本时，目标企业确认选择成本更低的采购方案，有助于降低采购成本，通过自动化的成本计算和供应商选择的过程，目标企业可快速确定补货方案，减少人力成本。可选的，在判断第一运行成本是否大于第二运行成本之后，方法还包括：若第一运行成本小于或等于第二运行成本，则确认向备选企业发送调货请求，以便根据调货请求运输目标商品至目标企业，补货方案为选择备选企业进行补货。通过采用上述技术方案，当第一运行成本小于或等于第二运行成本时，选择从备选企业调货，可以有效降低整体的运营成本，由于备选企业已经是企业供应链的一部分，有助于加强与其他企业之间的合作关系，减少供应链中断的风险，当备选企业的运行成本更低时，选择从备选企业调货可以使得资源得到更有效的利用，避免资源浪费。可选的，在将第一采购数据向用户进行展示，以便用户根据第一采购数据对目标商品进行采购之后，方法还包括：根据第二预测规则，获取目标商品处于第二时间点对应的第三销售数据；判断第三销售数据是否等于第四销售数据，第四销售数据为目标预测模型预测处于第二时间点对应的销售数据；当第三销售数据等于第四销售数据时，则确认目标商品处于销售正常状态。通过采用上述技术方案，获取目标商品处于第二时间点对应的第三销售数据，将第三销售数据与第四销售数据进行比较，使目标企业能够实时掌握目标商品的销售状态，当第一销售数据等于第二销售数据时，确认实际销售数据与预测销售数据相符，从而确认目标商品处于销售正常状态，准确的识别有助于企业避免过度干预销售过程，确保市场供需平衡。可选的，将第二采购数据向用户进行展示，具体包括：获取第二采购数据；根据用户发送的预设展示方式对第二采购数据进行展示，预设展示方式包括文本展示方式、语音展示方式以及图片展示方式。通过采用上述技术方案，在获取第二采购数据后，可基于通过预先设置的展示方式，将第二采购数据以用户设置的展示方式进行展示，以便用户对第二采购数据进行查看，进一步提升用户体验。可选的，第一运行成本为运输成本与仓库成本相加得到的总成本，运输成本为运输目标商品对应的运输成本，仓库成本为存放目标商品对应的成本。通过采用上述技术方案，获取目标企业与备选企业之间的运输成本，再获取备选企业继续储存目标商品对应的仓库成本，将运输成本与仓库成本进行相加，得到第一运行成本。可选的，第二运行成本为采购数量与采购价格相乘得到的成本，采购数量为根据补货需求确定购买目标商品的数量，采购价格为购买单个目标商品对应的价格。通过采用上述技术方案，获取备选供应商中目标商品对应的采购价格，再从补货需求中确定采购数量，将采购数量与采购价格进行相乘，得到第二运行成本。综上所述，本申请实施例中提供的一个或多个技术方案，至少具有如下技术效果或优点：1、响应于用户输入的目标商品预测请求获取供应链待测数据，再将供应链待测数据输入目标预测模型中，得到目标预测结果，这种方法比传统的人工预测更加客观和准确，再通过获取目标仓库中实时的库存数据，确保目标预测结果与实际库存状态同步，避免因信息滞后导致的采购计划不准确的问题；根据目标预测结果来确定第二采购数据，使得采购计划更加贴近实际需求，减少因采购过多或过少导致的库存问题。2、收集包含位置数据、月份数据、对标企业数据、销售数据以及用户群体数据等在内的历史数据样本集，对历史数据样本集进行处理，进而构建目标预测模型，目标预测模型可以准确地预测目标商品的需求情况，多维度的数据输入使得目标预测模型能够更全面地考虑各自可能的因素，提高预测的准确性，目标预测模型可以为企业制定采购计划、库存管理等决策提供有力支持，避免库存积压等问题。3、获取处于第一时间点的第一销售数据，再通过目标预测模型预测处于第一时间点对应的第二销售数据，比较第一销售数据与第二销售数据，能够实时监控目标商品的销售状态，并快速识别出销售异常，当第一销售数据小于第二销售数据时，确认目标商品处于销售第一异常状态，对目标子企业进行备选标记，以便于目标子企业根据销售第一异常状态灵活调整销售策略，从而优化库存配置，避免资源浪费和库存积压。4、当第一运行成本小于或等于第二运行成本时，选择从备选企业调货，可以有效降低整体的运营成本，由于备选企业已经是企业供应链的一部分，有助于加强与其他企业之间的合作关系，减少供应链中断的风险，当备选企业的运行成本更低时，选择从备选企业调货可以使得资源得到更有效的利用，避免资源浪费。"
  },
  {
    "专利名": "基于突触重塑模型的情景记忆网络设计方法",
    "申请号": "CN202410756894.0",
    "公开日": "20240823",
    "IPC 分类号": "G06N3/09;G06N3/088;G06N3/0442;G06N3/045;G06V10/82;G06V10/764",
    "申请人": "东北电力大学",
    "关键词": "情景记忆网络设计方法、突触重塑模型、特征编码器、参数重要性矩阵、视觉特征、语义特征、稀疏编码、情景特征矩阵、终身学习能力、神经网络技术",
    "摘要": "本发明公开了一种基于突触重塑模型的情景记忆网络设计方法，涉及人工智能和神经网络技术领域。本发明包括以下步骤：设计情景特征编码器作为内部记忆单元并使用突触重塑参数重要性矩阵来更新内部记忆单元参数；从待分类样本中提取图像数据的视觉特征和语义特征；对提取的特征进行竞争，选取权重大的特征进行稀疏编码，形成情景特征矩阵。本申请通过内部记忆单元和外部记忆单元的记忆设计使得模型具备终身学习的能力。内部记忆单元负责短期和动态信息处理，确保模型对当前情景记忆的快速响应和理解；外部记忆单元则提供长期存储和回忆功能，使得模型能够在不同任务和情景中保持连贯的知识积累和应用能力。",
    "说明书": "基于突触重塑模型的情景记忆网络设计方法技术领域本发明属于人工智能和神经网络领域，具体地说，涉及一种基于突触重塑模型的情景记忆网络设计方法。背景技术情景记忆是一种高度复杂的认知功能，涉及对特定事件和场景的记忆和提取。尽管在传统的神经网络模型中已经有许多针对记忆和学习的技术，但这些常规技术存在一些显著的不足，尤其是在实现终身学习和持久记忆方面。首先，传统模型通常依赖于静态权重更新机制，这意味着模型在面对新信息时需要重新训练整个网络，这不仅耗时耗力，而且容易导致灾难性遗忘，即新知识的学习会导致已有知识的丧失。有鉴于此特提出本发明。发明内容本发明要解决的技术问题在于克服现有技术的不足，提供一种基于突触重塑模型的情景记忆网络设计方法，解决了上述背景技术中提出的问题。为解决上述技术问题，本发明采用技术方案的基本构思是：一种基于突触重塑模型的情景记忆网络设计方法，包括：以下步骤：设计情景特征编码器作为内部记忆单元并使用突触重塑参数重要性矩阵来更新内部记忆单元参数；从待分类样本中提取图像数据的视觉特征和语义特征；对提取的特征进行竞争，选取权重大的特征进行稀疏编码，形成情景特征矩阵将注意力集中在能标志情景特征的图像子集上，从图像中提取出情景特征矩阵注意力机制使用门函数t通过上下文向量ctt-1tj设计基于键-值存储机制为外部记忆单元，提取视觉特征和语义特征之间的关系，形成键-值对，使用软注意力机制进行键寻址和隐状态更新；将分类结果与上下文信息结合，更新外部记忆单元的存储值。可选的，计算情景注意力权重的步骤为：通过注意门t-1式中可选的，将得到的权重可选的，外部记忆单元由键-值对其中，tt可选的，获取键的步骤为：通过情景特征编码器提取的类别数据集合中的每一个样本的特征向量ftti可选的，获取值的步骤为：每一帧图像可选的，键寻址的步骤为：使用软注意力机制得到每个存储器的对齐概率qi，键寻址前一时刻读取的值Φt-1其中lk根据获取的分类结果C和时刻i的键向量kii最后，使用Softmax函数得到新的对齐概率其中，可选的，在训练过程中，情景记忆网络通过监督学习和无监督学习相结合的方式进行训练，初始阶段采用监督学习，通过已标注数据进行模型参数调整；随后进入无监督学习阶段，通过海量未标注数据进行模型的自适应调整和优化。可选的，情景特征编码器在提取特征时，采用多尺度特征提取技术，以保证对不同尺度特征的全面捕捉。采用上述技术方案后，本发明与现有技术相比具有以下有益效果，当然，实施本发明的任一产品并不一定需要同时达到以下所述的所有优点：本申请通过内部记忆单元和外部记忆单元的记忆设计使得模型具备终身学习的能力。内部记忆单元负责短期和动态信息处理，确保模型对当前情景记忆的快速响应和理解；外部记忆单元则提供长期存储和回忆功能，使得模型能够在不同任务和情景中保持连贯的知识积累和应用能力。下面结合附图对本发明的具体实施方式做进一步详细的描述。"
  },
  {
    "专利名": "样本数据生成方法、训练方法、目标对象检测方法、装置、电子设备、存储介质和程序产品",
    "申请号": "CN202410759401.9",
    "公开日": "20240827",
    "IPC 分类号": "G06T5/50;G06V10/80;G06V20/56;G06N3/08;G06T7/246;G06V10/74;G06V10/764",
    "申请人": "北京百度网讯科技有限公司",
    "关键词": "样本数据生成方法、训练方法、目标对象检测方法、、程序产品、人工智能、自动驾驶、智慧交通、计算机视觉、深度学习、大语言模型",
    "摘要": "本公开提供了样本数据生成方法、训练方法、目标对象检测方法、装置、电子设备、存储介质和程序产品，涉及人工智能技术领域，尤其涉及自动驾驶领域、智慧交通领域、计算机视觉领域、深度学习领域和大语言模型领域。样本数据生成方法包括：获取道路融合检测数据，道路融合检测数据是根据不同来源的道路检测数据确定的，道路融合检测数据包括与道路对象相关的对象信息；基于对象信息，从待标注的候选道路图像中确定与道路对象相关联的关联对象；以及根据对象信息和关联对象，生成用于训练目标检测模型的样本数据。",
    "说明书": "样本数据生成方法、训练方法、目标对象检测方法、装置、电子设备、存储介质和程序产品技术领域本公开涉及人工智能技术领域，尤其涉及自动驾驶领域、智慧交通领域、计算机视觉领域、深度学习领域和大语言模型领域。背景技术随着人工智能技术的快速发展，在车辆自动驾驶、智慧城市交通等应用场景中，可以基于图像采集装置、激光雷达等信号采集装置来对道路环境进行检测，以实现自动化识别道路环境中的车辆、行人等道路对象。道路对象的识别准确性对于车辆自动驾驶性能、智慧交通管理性能的影响较大。发明内容本公开提供了一种样本数据生成方法、训练方法、目标对象检测方法、装置、电子设备、自动驾驶车辆、路侧设备、存储介质和程序产品。根据本公开的一方面，提供了一种样本数据生成方法，包括：获取道路融合检测数据，道路融合检测数据是根据不同来源的道路检测数据确定的，道路融合检测数据包括与道路对象相关的对象信息；基于对象信息，从待标注的候选道路图像中确定与道路对象相关联的关联对象；以及根据对象信息和关联对象，生成用于训练目标检测模型的样本数据。根据本公开的另一方面，提供了一种深度学习模型的训练方法，包括：获取样本数据；以及利用样本数据训练初始的深度学习模型，得到训练后的深度学习模型；其中，样本数据是基于本公开实施例提供的方法生成的。根据本公开的另一方面，提供了一种目标对象检测方法，包括：获取道路图像；利用深度学习模型处理道路图像，得到目标对象检测结果，其中，深度学习模型是根据本公开实施例提供的方法确定的。根据本公开的另一方面，提供了一种样本数据生成装置，包括：第一获取模块，用于获取道路融合检测数据，道路融合检测数据是根据不同来源的道路检测数据确定的，道路融合检测数据包括与道路对象相关的对象信息；第一确定模块，用于基于对象信息，从待标注的候选道路图像中确定与道路对象相关联的关联对象；以及样本数据生成模块，用于根据对象信息和关联对象，生成用于训练目标检测模型的样本数据。根据本公开的另一方面，提供了一种深度学习模型的训练装置，包括：第二获取模块，用于获取样本数据；以及训练模块，用于利用样本数据训练初始的深度学习模型，得到训练后的深度学习模型；其中，样本数据是根据本公开实施例提供的装置生成的。根据本公开的另一方面，提供了一种目标对象检测装置，包括：第三获取模块，用于获取道路图像；以及目标对象检测模块，用于利用深度学习模型处理道路图像，得到目标对象检测结果，其中，深度学习模型是根据本公开实施例提供的装置确定的。根据本公开的另一方面，提供了一种电子设备，包括：至少一个处理器；以及与至少一个处理器通信连接的存储器；其中，存储器存储有可被至少一个处理器执行的指令，指令被至少一个处理器执行，以使至少一个处理器能够执行根据本公开实施例提供的样本数据生成方法或训练方法方法。根据本公开的另一方面，提供了一种电子设备，包括：至少一个处理器；以及与至少一个处理器通信连接的存储器；其中，存储器存储有可被至少一个处理器执行的指令，指令被至少一个处理器执行，以使至少一个处理器能够执行根据本公开实施例提供的目标对象检测方法。根据本公开的另一方面，提供了一种自动驾驶车辆，包括：本公开实施例提供的电子设备。根据本公开的另一方面，提供了一种路侧设备，包括：本公开实施例提供的电子设备。根据本公开的另一方面，提供了一种存储有计算机指令的非瞬时计算机可读存储介质，其中，计算机指令用于使计算机执行本公开实施例提供的方法。根据本公开的另一方面，提供了一种计算机程序产品，包括计算机程序，计算机程序在被处理器执行时实现本公开实施例提供的方法。应当理解，本部分所描述的内容并非旨在标识本公开的实施例的关键或重要特征，也不用于限制本公开的范围。本公开的其它特征将通过以下的说明书而变得容易理解。"
  },
  {
    "专利名": "视频编辑方法、计算机设备、存储介质和计算机程序产品",
    "申请号": "CN202410762261.0",
    "公开日": "20240903",
    "IPC 分类号": "H04N21/44;H04N21/431",
    "申请人": "腾讯音乐娱乐科技（深圳）有限公司",
    "关键词": "视频编辑方法、生成式人工智能模型、图生文功能、文生图功能、图生图功能",
    "摘要": "本申请涉及一种视频编辑方法、计算机设备、存储介质和计算机程序产品。所述方法包括：响应于对待编辑视频的视频编辑指令，通过生成式人工智能模型的图生文功能，生成待编辑视频中的视频帧图像的描述文本；获取视频编辑提示词，通过生成式人工智能模型的文生图功能，基于描述文本和视频编辑提示词，生成各视频帧图像的视觉提示信息；通过生成式人工智能模型的图生图功能，基于视频帧图像和视觉提示信息，生成各视频帧图像的编辑后帧图像；根据各编辑后帧图像，输出编辑后视频。采用本方法能够满足用户针对视频的编辑需求，利用生成式人工智能模型对视频进行适应性地自动编辑和调整，以使编辑后的视频符合用户想要的编辑效果，提高视频的编辑效率。",
    "说明书": "视频编辑方法、计算机设备、存储介质和计算机程序产品技术领域本申请涉及计算机技术领域，特别是涉及一种视频编辑方法、装置、计算机设备、存储介质和计算机程序产品。背景技术在图像处理领域中，基于用户操作对原始图片或原始视频进行适应性修改能够使修改后的图片或视频更加符合用户的想法。例如：用户可以通过对原始图片或原始视频的颜色和元素等内容进行编辑和修改，使得处理后的图片或视频满足用户喜好。传统技术主要通过响应用户发出的图像处理指令等对图片或视频进行修改和编辑，然而，传统技术为满足用户针对图片或视频的编辑需求，需要花费大量时间进行编辑效果的调整，从而使得图片或视频的生成时间大大增加，不利于提高视频的编辑效率。发明内容基于此，有必要针对上述技术问题，提供一种能够提高视频的编辑效率的视频编辑方法、装置、计算机设备、计算机可读存储介质和计算机程序产品。第一方面，本申请提供了一种视频编辑方法，包括：响应于对待编辑视频的视频编辑指令，通过生成式人工智能模型的图生文功能，生成针对所述待编辑视频中的各视频帧图像的描述文本；获取所述视频编辑指令输入的视频编辑提示词，通过所述生成式人工智能模型的文生图功能，基于各所述视频帧图像的描述文本和所述视频编辑提示词，生成各所述视频帧图像对应的视觉提示信息；所述视觉提示信息用于采用图像的形式表征针对所述待编辑视频的编辑效果；通过所述生成式人工智能模型的图生图功能，基于所述视频帧图像和所述视觉提示信息，生成各所述视频帧图像对应的编辑后帧图像；根据各所述视频帧图像对应的编辑后帧图像，输出编辑后视频。在其中一个实施例中，所述方法还包括：接收目标账户针对所述编辑后帧图像是否满意输入的操作指令；在所述操作指令表征所述目标账户满意所述编辑后帧图像的情况下，执行所述根据各所述视频帧图像对应的编辑后帧图像，输出编辑后视频的步骤。在其中一个实施例中，所述方法还包括：在所述操作指令表征所述目标账户不满意所述编辑后帧图像的情况下，响应于所述目标账户对所述视频编辑提示词的更换操作，获取新的所述视频编辑提示词；返回所述通过所述生成式人工智能模型的文生图功能，基于各所述描述文本和所述视频编辑提示词，生成各所述视频帧图像对应的视觉提示信息的步骤，直至所述操作指令表征所述目标账户满意所述编辑后帧图像。在其中一个实施例中，所述生成式人工智能模型包括预训练的图生文模型，所述通过生成式人工智能模型的图生文功能，生成针对所述待编辑视频中的视频帧图像对应的描述文本，包括：通过所述预训练的图生文模型提取所述待编辑视频中的视频帧图像的视觉特征信息；通过所述预训练的图生文模型对所述视觉特征信息进行解码处理，得到所述待编辑视频中的视频帧图像的描述文本。在其中一个实施例中，所述生成式人工智能模型包括预训练的文生图模型，所述通过所述生成式人工智能模型的文生图功能，基于各所述描述文本和所述视频编辑提示词，生成各所述视频帧图像对应的视觉提示信息，包括：通过所述预训练的文生图模型获取各所述描述文本和所述视频编辑提示词在预设空间中的扩散特征信息；通过所述预训练的文生图模型基于所述扩散特征信息将预设噪声转换为所述视觉提示信息。在其中一个实施例中，所述生成式人工智能模型包括预训练的图生图模型，所述通过所述生成式人工智能模型的图生图功能，基于所述视频帧图像和所述视觉提示信息，生成各所述视频帧图像对应的编辑后帧图像，包括：通过所述预训练的图生图模型从所述视觉提示信息中去除所述视觉提示信息中的待去除噪声，得到所述视觉提示信息对应的待校验图像；在所述待校验图像与所述待校验图像在所述待编辑视频中对应的视频帧图像之间的相似程度满足预设的图像相似度条件的情况下，将所述待校验图像作为所述编辑后帧图像。在其中一个实施例中，所述视频编辑提示词包括自然语言形式的视频编辑需求文本，所述基于各所述视频帧图像的描述文本和所述视频编辑提示词，生成各所述视频帧图像对应的视觉提示信息，包括：解析各所述视频帧图像的描述文本和所述视频编辑需求文本，得到至少一视频编辑项目的指示信息；将所述至少一视频编辑项目的指示信息设置于预设模板中视频编辑项目对应的位置，生成目标提示词；通过所述生成式人工智能模型的文生图功能，基于所述目标提示词，生成各所述视频帧图像对应的视觉提示信息。第二方面，本申请还提供了一种视频编辑装置，包括：图生文模块，用于响应于对待编辑视频的视频编辑指令，通过生成式人工智能模型的图生文功能，生成针对所述待编辑视频中的各视频帧图像的描述文本；文生图模块，用于获取所述视频编辑指令输入的视频编辑提示词，通过所述生成式人工智能模型的文生图功能，基于各所述视频帧图像的描述文本和所述视频编辑提示词，生成各所述视频帧图像对应的视觉提示信息；所述视觉提示信息用于采用图像的形式表征针对所述待编辑视频的编辑效果；图生图模块，用于通过所述生成式人工智能模型的图生图功能，基于所述视频帧图像和所述视觉提示信息，生成各所述视频帧图像对应的编辑后帧图像；视频输出模块，用于根据各所述视频帧图像对应的编辑后帧图像，输出编辑后视频。第三方面，本申请还提供了一种计算机设备。所述计算机设备包括存储器和处理器，所述存储器存储有计算机程序，所述计算机程序被处理器执行时实现上述的方法的步骤。第四方面，本申请还提供了一种计算机可读存储介质。所述计算机可读存储介质，其上存储有计算机程序，所述计算机程序被处理器执行时实现上述的方法的步骤。第五方面，本申请还提供了一种计算机程序产品。所述计算机程序产品，包括计算机程序，所述计算机程序被处理器执行时实现上述的方法的步骤。上述视频编辑方法、装置、计算机设备、存储介质和计算机程序产品，通过响应于对待编辑视频的视频编辑指令，利用生成式人工智能模型的图生文功能，分析待编辑视频中的各视频帧图像，准确生成针对待编辑视频中的各视频帧图像的描述文本，为后续生成式人工智能模型的文生图功能提供数据基础；获取视频编辑指令输入的视频编辑提示词，利用生成式人工智能模型的文生图功能，基于各视频帧图像的描述文本和视频编辑提示词，生成各视频帧图像对应的视觉提示信息，从而结合描述文本和视频编辑提示词，采用图像形式的视觉提示信息准确表征针对待编辑视频的编辑效果，为后续生成式人工智能模型的图生图功能提供数据基础；利用生成式人工智能模型的图生图功能，基于视频帧图像和视觉提示信息，生成各视频帧图像对应的编辑后帧图像，从而在视觉提示信息的基础上，结合原始的待编辑视频，准确生成待编辑视频中各视频帧图像对应的编辑后帧图像，并根据各视频帧图像对应的编辑后帧图像，输出编辑后视频，能够在满足用户针对视频的编辑需求的同时，利用生成式人工智能模型对视频进行适应性地自动编辑和调整，以使编辑后的视频符合用户想要的编辑效果，从而提高视频的编辑效率。"
  },
  {
    "专利名": "基于文档图像的问答方法、装置、设备、存储介质及程序产品",
    "申请号": "CN202410763359.8",
    "公开日": "20240903",
    "IPC 分类号": "G06F16/35;G06F16/332;G06N20/00;G06F40/35;G06V30/19;G06V30/18;G06V30/416",
    "申请人": "中国建设银行股份有限公司",
    "关键词": "问答方法、版面分析模型、文本特征信息、图像特征信息、图文对齐信息、问答模型、人工智能、文档图像",
    "摘要": "本申请提供一种基于文档图像的问答方法、装置、设备、存储介质及程序产品。涉及人工智能领域。该方法包括：获取目标文档图像及对应的问题相关信息，并将目标文档图像输入至预设版面分析模型中；采用预设版面分析模型确定目标文档图像中的至少一个目标版面类型标识及目标版面类型标识在目标文档图像中的区域信息；对问题相关信息、至少一个目标版面类型标识及目标版面类型标识在目标文档图像中的区域信息依次进行拼接及编码得到文本特征信息；获取图像特征信息，并采用预设对齐策略对图像特征信息以及文本特征信息进行对齐得到图文对齐信息；基于图文特征信息及预设问答模型确定目标文档图像对应的问题答复信息。提高文档图像问答的准确性。",
    "说明书": "基于文档图像的问答方法、装置、设备、存储介质及程序产品技术领域本申请涉及人工智能领域，尤其涉及一种基于文档图像的问答方法、装置、设备、存储介质及程序产品。背景技术随着计算机技术以及人工智能领域的不断发展，对文档的理解也由人为识别转变为智能识别，从而提高工作效率。目前对文档进行智能识别一般是预先建立问答模型并将文档转换为对应的文档图像，然后将文档图像以及针对文档提出的问题输入至问答模型中，并由问答模型按照上述问题在文档图像中确定出对应的答案并输出。但是这种采用问答模型直接根据文档图像确定答案的方法，问答模型对文档图像中各部分的理解都是均衡的，使得某个问题是针对文档的局部问题时，所确定出的答案不够准确，降低文档图像问答的准确性。发明内容本申请提供一种基于文档图像的问答方法、装置、设备、存储介质及程序产品，用以解决现有技术中当某个问题是针对文档的局部问题时，所确定出的答案不够准确，降低文档图像问答的准确性的技术问题。第一方面，本申请提供一种基于文档图像的问答方法，包括：获取目标文档图像及对应的问题相关信息，并将所述目标文档图像输入至预设版面分析模型中；所述预设版面分析模型是采用标注预设信息的预设文档图像训练至收敛得到的；所述预设信息为：预设文档图像中的至少一个预设版面类型标识及各所述预设版面类型标识在所述预设文档图像中的区域信息；所述预设版面类型标识包括以下的任意一项：总标题标识、页眉标识、页脚标识、文本标识、段落标识、图片标题标识、图片标识、表格标题标识、表格标识、公式标识、参考文献标识；采用所述预设版面分析模型确定所述目标文档图像中的至少一个目标版面类型标识及所述目标版面类型标识在目标文档图像中的区域信息；对所述问题相关信息、至少一个目标版面类型标识及所述目标版面类型标识在目标文档图像中的区域信息依次进行拼接处理及编码处理，以获得所述目标文档图像对应的文本特征信息；所述拼接处理是基于预设统一格式进行的；获取图像特征信息，并采用预设对齐策略对所述图像特征信息以及所述文本特征信息进行对齐处理，以获得所述目标文档图像对应的图文对齐信息；基于所述图文特征信息及预设问答模型确定所述目标文档图像对应的问题答复信息。在一种可能的设计中，所述采用所述预设版面分析模型确定所述目标文档图像中的至少一个目标版面类型标识及所述目标版面类型标识在目标文档图像中的区域信息，包括：根据训练结果对所述目标文档图像进行划分，以获得目标文档图像中的至少一个圈定区域，并确定各圈定区域对应的目标版面类型标识；基于划分结果获取各圈定区域对应的区域信息。在一种可能的设计中，所述采用所述预设版面分析模型确定所述目标文档图像中的至少一个目标版面类型标识及所述目标版面类型标识在目标文档图像中的区域信息之前，还包括：响应于接收到用户在所述预设文档图像中圈定区域的操作，对所述圈定区域内的文档内容进行识别，以确定对应的预设版面类型标识；确定在所述预设文档图像中所述圈定区域的区域信息，以获得所述预设版面类型标识对应的区域信息；采用对应的预设版面类型标识及所述预设版面类型标识对应的区域信息对各圈定区域进行标记，以获得标注预设信息的预设文档图像。在一种可能的设计中，所述基于所述文本特征信息及预设问答模型确定所述目标文档图像对应的问题答复信息，包括：获取预设问答模型；所述预设问答模型是采用标注问题相关信息及对应问题答复信息的预设文档图像训练至收敛得到的；将所述图文对齐信息输入至预设问答模型中，并采用所述预设问答模型根据所述图文对齐信息确定所述问题相关信息对应的问题答复信息；输出所述问题答复信息，并将所述问题答复信息确定为目标文档图像对应的问题答复信息。在一种可能的设计中，所述获取图像特征信息之前，还包括：采用预设编码策略对所述目标文档图像进行编码处理，以获得所述目标文档图像对应的图像特征信息；所述图像特征信息包括全文档内容以及对应的位置信息。在一种可能的设计中，所述问题相关信息包括版面类型关联标识；所述采用预设对齐策略对所述图像特征信息以及所述文本特征信息进行对齐处理，包括：根据文本特征信息中的版面类型关联标识在至少一个目标版面类型标识中确定关联版面类型标识；所述关联版面类型标识为关联问题相关信息的目标版面类型标识；获取所述关联版面类型标识在所述预设文档图像中的区域信息，并根据图像特征信息中的位置信息在全文档内容中确定所述关联版面类型标识的区域信息对应的目标文档内容；在所述目标文档内容以及问题相关信息之间构建对应关系，以完成对齐处理。在一种可能的设计中，所述采用所述预设问答模型根据所述图文对齐信息确定所述问题相关信息对应的问题答复信息，包括：对所述图文对齐信息进行解码，以获得问题相关信息以及对应的目标文档内容；根据训练结果在所述目标文档内容中确定所述问题相关信息对应的问题答复信息。第二方面，本申请提供一种基于文档图像的问答装置，包括：获取模块，用于获取目标文档图像及对应的问题相关信息；输入模块，用于将所述目标文档图像输入至预设版面分析模型中；所述预设版面分析模型是采用标注预设信息的预设文档图像训练至收敛得到的；所述预设信息为：预设文档图像中的至少一个预设版面类型标识及各所述预设版面类型标识在所述预设文档图像中的区域信息；所述预设版面类型标识包括以下的任意一项：总标题标识、页眉标识、页脚标识、文本标识、段落标识、图片标题标识、图片标识、表格标题标识、表格标识、公式标识、参考文献标识；确定模块，用于采用所述预设版面分析模型确定所述目标文档图像中的至少一个目标版面类型标识及所述目标版面类型标识在目标文档图像中的区域信息；处理模块，用于对所述问题相关信息、至少一个目标版面类型标识及所述目标版面类型标识在目标文档图像中的区域信息依次进行拼接处理及编码处理，以获得所述目标文档图像对应的文本特征信息；所述拼接处理是基于预设统一格式进行的；所述获取模块，还用于获取图像特征信息；所述处理模块，还用于采用预设对齐策略对所述图像特征信息以及所述文本特征信息进行对齐处理，以获得所述目标文档图像对应的图文对齐信息；所述确定模块，还用于基于所述图文特征信息及预设问答模型确定所述目标文档图像对应的问题答复信息。第三方面，本申请实施例提供一种电子设备，包括：至少一个处理器和存储器；所述存储器存储计算机执行指令；所述至少一个处理器执行所述存储器存储的计算机执行指令，使得所述至少一个处理器执行如上第一方面以及第一方面各种可能的设计所述的基于文档图像的问答方法。第四方面，本申请实施例提供一种计算机可读存储介质，所述计算机可读存储介质中存储有计算机执行指令，当处理器执行所述计算机执行指令时，实现如上第一方面以及第一方面各种可能的设计所述的基于文档图像的问答方法。第五方面，本申请实施例提供一种计算机程序产品，包括计算机程序，所述计算机程序被处理器执行时，实现如上第一方面以及第一方面各种可能的设计所述的基于文档图像的问答方法。本申请提供的基于文档图像的问答方法、装置、设备、存储介质及程序产品，获取目标文档图像及对应的问题相关信息，并将所述目标文档图像输入至预设版面分析模型中；所述预设版面分析模型是采用标注预设信息的预设文档图像训练至收敛得到的；所述预设信息为：预设文档图像中的至少一个预设版面类型标识及各所述预设版面类型标识在所述预设文档图像中的区域信息；所述预设版面类型标识包括以下的任意一项：总标题标识、页眉标识、页脚标识、文本标识、段落标识、图片标题标识、图片标识、表格标题标识、表格标识、公式标识、参考文献标识；采用所述预设版面分析模型确定所述目标文档图像中的至少一个目标版面类型标识及所述目标版面类型标识在目标文档图像中的区域信息；对所述问题相关信息、至少一个目标版面类型标识及所述目标版面类型标识在目标文档图像中的区域信息依次进行拼接处理及编码处理，以获得所述目标文档图像对应的文本特征信息；所述拼接处理是基于预设统一格式进行的；获取图像特征信息，并采用预设对齐策略对所述图像特征信息以及所述文本特征信息进行对齐处理，以获得所述目标文档图像对应的图文对齐信息；基于所述图文特征信息及预设问答模型确定所述目标文档图像对应的问题答复信息。由于预先设置了多种预设版面类型，并以标注至少一个预设版面类型标识及各预设版面类型标识对应区域信息的预设文档图像为训练样本得到了预设版面分析模型，所以通过获取目标文档图像及对应的问题相关信息，就可将目标文档图像输入至预设版面分析模型中，并可采用预设版面分析模型确定目标文档图像中的至少一个目标版面类型标识及目标版面类型标识在目标文档图像中的区域信息。并通过对问题相关信息、至少一个目标版面类型标识及目标版面类型标识在目标文档图像中的区域信息依次进行基于统一格式的拼接处理及编码处理，就可获得所述目标文档图像对应的文本特征信息，提高文本特征信息的可读性。从而通过获取图像特征信息，就可对图像特征信息及文本特征信息进行对齐处理得到图文特征信息，并可基于图文特征信息及预设问答模型确定目标文档图像对应的问题答复信息。使得问答模型能够根据文档图像的版面情况对各部分进行理解，当某个问题是针对文档的局部问题时，能够准确确定出答案，提高文档图像问答的准确性。"
  },
  {
    "专利名": "一种基于生成式神经网络模型设计抗体结构和序列的方法",
    "申请号": "CN202410752382.7",
    "公开日": "20240712",
    "IPC 分类号": "G06N3/09;G06N3/042;G06N3/0475;G16B40/00;G16B30/00",
    "申请人": "北京大学",
    "关键词": "生成式神经网络模型、抗体结构和序列设计、图消息传播、离散变分自编码器、注意力机制、序列-结构联合设计、离散隐空间张量、人工智能技术、抗原-抗体复合物结构、抗体CDR区域、亲和力改善",
    "摘要": "本发明公开了一种基于生成式神经网络模型设计抗体结构和序列的方法，属于人工智能技术领域。本发明利用公开的实验观测抗原‑抗体复合物结构数据集和开源序列模型构建图数据集，搭建基于图消息传播、离散变分自编码器和注意力机制的神经网络并完成网络训练，给定抗原和模板抗体复合物结构，从头生成抗体CDR区域的序列和结构。该方法实现了对靶向结合特定抗原结合位点的抗体功能片段的序列‑结构联合设计，同时利用基于离散隐空间张量的机器学习模型有效衡量新生成抗体片段的亲和力改善程度，其结果与实验数据具有良好的对应关系，且对模型的中间特征层分析体现了网络对普适生化规律的捕捉，对于实现功能引导的抗体分子生成具有开创性意义。",
    "说明书": "一种基于生成式神经网络模型设计抗体结构和序列的方法技术领域本发明涉及人工智能生成式算法、机器学习回归模型、抗体结构预测、抗体序列表征学习领域，具体涉及一种同时生成抗体蛋白互补决定区域骨架三维结构和氨基酸序列且可以预测其与靶标蛋白亲和力的方法。背景技术抗体是由 B淋巴细胞产生的重要免疫应答蛋白之一。它可以特异性地结合外来病原体的表面，阻止它们侵入机体或通过激活下游免疫机制将其清除。抗体中和功能的成功依赖于其识别各种分子的能力。为了适应病原体高度多样化的外来结构，机体通过基因重组和体细胞超突变预先构建了庞大的序列库。在与抗原蛋白的相互作用过程中，只有亲和力更高的抗体才会被大量复制并进化为主要的功能性抗体。作为治疗性大分子药物，抗体被广泛应用于治疗从神经退行性疾病等各种人类疾病。治疗性抗体开发是一个耗时的过程，需要进行迭代评估。在庞大的体外抗体库中进行多轮筛选，以寻找具有最佳性能的候选抗体。这些候选抗体可能包含其他不利的生物物理性质，如溶解性或稳定性差。通过突变对这些性质进行优化，新的额外修饰可能会影响先前优化的性能，因此只能反复迭代来获得最佳的结果。近年来基于机器学习的计算方法提供了一种高效的计算机设计解决方案，减轻了筛选新型抗体的负担。机器学习模型可以被用来合成强效抗体功能片段，即单序列可变区域结合蛋白。该类型方法对一种特定抗原进行高通量结合定量测定，然后根据实验数据训练的适应度景观进行外推，从而获得全新的抗体功能片段。这种对关键性质的初步分析加速了筛选程序，但不适用于任意随机病原体。应用于蛋白质序列库的大型语言模型能够在更高维空间中捕获序列、结构和功能之间的复杂依赖关系。经过微调后，通用的蛋白质序列模型可以被用于蛋白结合热稳定性预测、抗体三维结构预测以及临床治疗性抗体的亲和力优化。但利用该类模型进行新型抗体单体设计需要持续进行“突变-预测”操作。这种迭代式优化对于改善某一个目标性质是有效的，而在需要考虑多种性质优化（如结合特异性和亲和力）的情景下，该采样策略将消耗大量时间和资源。因此，许多方法旨在直接从头生成功能性抗体片段的结构和序列，从而节省冗余的高维空间搜索操作。生成式神经网络作为一种端到端方法，已成为从头设计新抗体的新范式。Luo等（Luo, Shitong, et al. Antigen-specific antibody design and optimizationwithdiffusion-based generative models for protein structures.Advances inNeural Information Processing Systems 35 (2022): 9754-9767）设计了基于扩散网络的抗体CDR区域设计模型，允许将先验的生物学知识作为条件。尽管该模型可以感知结合位点的环境信息，但它们是在六个独立的抗体功能环数据集上训练和测试的。这种数据分割确保了对不同功能环动态的精确的学习，但是忽略了自然条件下功能环组合效应。此外，作为承担多种功能（如识别、结合和中和）的最关键区域，新设计的抗体互补决定区（CDR）既需要新颖性，也需要具备更优的临床性质。这要求生成模型能够理解蛋白质拓扑结构和功能之间的依赖关系，而当前的从头生成方案缺乏透明度和可解释性，难以实现针对功能进行特异性抗体功能片段生成。发明内容针对上述抗体设计中的技术缺口，本发明旨在提供一种基于生成式神经网络模型设计抗体结构和序列的方法，以实现对靶向结合特定抗原结合位点的抗体功能片段的序列-结构联合设计，并预测新生成抗体片段对抗原的亲和力。为实现上述技术目的，本发明采取如下技术方案：一种基于生成式神经网络模型设计抗体结构和序列的方法，该方法利用公开的实验观测抗原-抗体复合物结构数据集和开源序列模型构建图数据集，搭建基于图消息传播、离散变分自编码器和注意力机制的神经网络并完成网络训练，给定抗原和模板抗体复合物结构，从头生成抗体CDR区域的序列和结构；具体包括以下步骤：1）建立抗原-CDR复合物的图数据集，包括：1a）对公开的抗原-抗体复合物的三维分子实验观测结构数据集进行预处理，得到抗原-CDR复合物的数据集，然后根据CDR序列相似度进行聚类，并拆分为训练集和测试集；1b）对抗原-CDR复合物的三维结构进行图抽象表示，将每个抗原-CDR复合物转换为一个无向异构图G(V, E), 其中V表示节点集，E表示边，V包含两种节点{Vp, Ve}，分别与抗体表位残基或抗原表位残基的Cα原子实际映照；1c）从蛋白质序列预训练模型获取嵌入表征向量作为图节点特征向量；2）利用抗原-CDR复合物的图数据集构建图神经网络编码器，获得包含图整体信息的隐空间表征张量；3）基于图神经网络编码器输出的隐空间表征张量，构建离散变分采样器，采样获得最近邻的生成张量；4）构建感知抗原表位的基于注意力机制的解码器，至此，完成编码器-采样器-解码器的生成网络构建；5）生成网络与亲和力预测网络的训练：用步骤1）预处理得到的抗原-CDR复合物的数据集，完成生成网络训练；利用部分有实验标定数据的抗原-CDR复合物数据，完成预测结合亲和力的监督式网络训练；6）从步骤3）构建的采样器中采样生成新的生成张量，根据步骤1c）所述方法获得目标抗原的特征向量，二者同时输入步骤4）构建的且已训练完成的解码器，获得全新生成的抗体CDR区域三维结构和序列。作为一种优选方案，步骤1a）的预处理包括：从公开的抗原-抗体复合物结构数据集中排除了所有纳米抗体（无轻链）、未结合抗体（无抗原）以及以糖分子或核酸为抗原的抗体；以抗体柔性区域整体分辨率为标准，过滤掉低于8埃的结构；对于抗原与多个抗体结合的复合物结构，将每个文件拆分成多个文件，每个文件只包含一对抗体及其结合的抗原链。在获得的每对结构中，对抗体分子按照Chothia标准重新编号，包含三个重链环(H1, H2,H3)和三个轻链环(L1, L2, L3)的CDR区域被剪切出来，并与结合的抗原链一起构成新的复合物，即抗原-CDR复合物。为应对序列不等长情况，在六个环的两端用来自其邻近片段区域的残基进行填充，填充长度根据六个环在数据集中的各自长度分布而定，尽量包含90%以上数据。作为一种优选方案，步骤1a）所述的训练集和测试集的分割方法为：根据CDR序列相似性将数据分成多个堆，使用Mmseqs2对高于40%同源性的联合CDR环序列进行聚类；对于生成的类集合，以4:1的比例将它们拆分成训练集和测试集。上述步骤2）中，所述图神经网络编码器由传播层、池化层、线性输出层构成。传播层基于邻域消息传递模型，对每一个图节点以聚合邻域内其他节点的特征向量的模式进行更新其自身特征向量；聚合方式为对所有邻居节点的特征向量经邻域注意力矩阵进行有权相加。池化层基于门控机制，将多个重要节点向量合并为表征图整体的一维向量。该一维向量传入线性输出层，包含激活和归一化运算，获得压缩后的隐空间表征张量。作为一种优选方案，步骤2）中传播层指，图节点的向量其中所述步骤2）中的邻域注意力矩阵α其中步骤2）中的池化层从所有CDR节点中获得抗原-CDR复合物图的整体表示向量作为一种优选方案，上述步骤3）中的离散变分采样器指，来自编码器的隐空间表征张量m上述步骤4）中，所述基于注意力机制的解码器包含全连接线性层、交叉注意力层和SE(3)等变结构复原层。从采样器输出的生成张量作为一种优选方案，步骤4）所述解码器中的全连接线性层，将采样得到的生成张量经多层感知机变换后获得高维度的特征向量所述步骤4）中的所述交叉注意力层有两层，在给定抗原表位内的氨基酸与生成的抗体特征向量之间，计算多头交叉注意力矩阵，从而将结合面特征信息整合进抗体向量中所述步骤4）中的SE(3)等变结构复原层，包含两层不变点注意力层，在抗体主链组成的结构单元之间进行具有SE(3)等变性质的注意力矩阵计算；使用预测的骨架帧和相应的旋转矩阵和平移向量，可以重建片段的骨架三维坐标；通过全连接线性层和softmax函数将抗体特征向量Ncdr作为一种优选方案，所述步骤5）中的亲和力预测网络使用了高斯混合模型，用于对数据集中少量结合自由能标注的数据点做亲和力预测，输入向量为经编码器压缩后的隐空间表征张量，代表后验分布；或者从密码本中采样得到的采样生成张量，代表先验分布。作为一种优选方案，所述步骤6）中采样的实现方式为掩码自注意力网络。采样生成张量由一系列密码本中的生成向量构成，这些生成向量拥有自己的编号，因此每一个采样生成张量都可以用一串编号代表，并且组成隐空间编号数据集。对该数据集我们使用掩码自注意力网络来根据前文编号预测某一位置编号内容。该网络可以视作对编码隐空间分布的高精度拟合，生成新的数据点即可等同于从该拟合分布中做有条件采样。本发明的有益效果：本发明的抗体设计方法通过基于深度注意力网络的抗体序列-结构共同生成算法，实现了对靶向结合特定抗原结合位点的抗体功能片段的序列-结构联合设计，同时利用基于离散隐空间张量的机器学习模型有效衡量新生成抗体片段的亲和力改善程度，其结果与实验数据具有良好的对应关系，且对模型的中间特征层分析体现了网络对普适生化规律的捕捉，对于实现功能引导的抗体分子生成具有开创性意义。"
  },
  {
    "专利名": "一种基于智能故障树的故障自动定位方法和装置",
    "申请号": "CN202410751697.X",
    "公开日": "20240712",
    "IPC 分类号": "G06F30/27;G06N5/04",
    "申请人": "中国航空工业集团公司金城南京机电液压工程研究中心",
    "关键词": "故障自动定位方法、智能故障树、MBSE模型、系统仿真模型、健康度参数阈值、实时健康度值、人工智能、系统故障模式库、故障树模块、实时故障模块",
    "摘要": "本申请提供一种基于智能故障树的故障自动定位方法和装置，属于人工智能领域。包括：基于MBSE模型构建故障树模块；利用系统仿真模型仿真结果修正故障树模块中各个子模块之间的连接关系，得到目标故障树模块；建立系统故障模式库与故障树模块中各个部件级子模块之间的链接关系；根据系统仿真模型统计系统故障状态下的性能测量参数，计算健康度参数阈值；基于故障状态下的性能测量参数计算目标故障树模块中各个部件级子模块的实时健康度值；与健康度参数阈值比较，定位该部件级子模块是否为实时故障模块；基于实时故障模块在系统故障模式库中匹配与之对应的实时元器件级故障模块；以实时故障模块和实时元器件级故障模块作为故障对应故障位置。",
    "说明书": "一种基于智能故障树的故障自动定位方法和装置技术领域本申请涉及人工智能技术领域，尤其涉及一种基于智能故障树的故障自动定位方法和装置。背景技术故障树分析法是一种直观性较强的图形演绎的故障事件逻辑推理方法，将导致系统故障的直接、间接、硬件、环境及人为等诸多因素形象的表现为故障树的形式，以树的形式将系统故障定位到元器件，分析导致系统故障的原因及其发生概率，直观明了，思路清晰，逻辑性较强，能够辅助系统设计者梳理系统的故障模式，发现单元故障的危害性，及时发现系统的薄弱环节。对于架构复杂、使用场景较多的系统，因其失效模式多，对应的故障树顶事件多、每个顶事件对应的故障模式多，其故障模式难以找全，故障传递路径不清晰；且不同模式下相同顶事件对应的故障模式也不同，故障树较多且不同故障树的中间事件繁多，故障树体量较大，致使故障树局限于文本报告，查阅困难，使用效率较低。同时，对于功能耦合性较强的系统，其部件级元器件的故障影响难以区分，在故障树自顶向下追溯故障模式时，很难甄别是由哪些中间对顶事件造成影响，使故障传播途径不明确，故障追溯及故障定位过程较困难，最终导致故障树使用率低下。发明内容有鉴于此，本申请提供一种基于智能故障树的故障自动定位方法和装置，可提升故障树的使用率。具体地，本申请是通过如下技术方案实现的：本申请第一方面提供一种基于智能故障树的故障自动定位方法，所述方法包括：建立MBSE模型，并基于所述MBSE模型构建故障树模块，所述故障树模块最小单元为部件级；利用系统仿真模型仿真结果修正所述故障树模块中各个子模块之间的连接关系，得到目标故障树模块；建立系统故障模式库与故障树模块中各个部件级子模块之间的链接关系，所述系统故障模式库中最小单元为元器件级；根据系统仿真模型统计系统故障状态下的性能参数，计算健康度参数阈值；监测系统实时运行状态，若所述系统发生故障，基于所述故障状态下的性能参数计算所述目标故障树模块中各个部件级子模块的实时健康度值；若所述实时健康度值低于所述健康度参数阈值，定位该部件级子模块为实时故障模块；基于所述实时故障模块在所述系统故障模式库中匹配与之对应的实时元器件级故障模块；以所述实时故障模块和所述实时元器件级故障模块作为故障对应的故障位置。本申请第二方面提供一种基于智能故障树的故障自动定位装置，所述装置包括构建模块、修正模块、链接模块、计算模块、定位模块、匹配模块和确定模块；其中；所述构建模块，用于建立MBSE模型，并基于所述MBSE模型构建故障树模块，所述故障树模块最小单元为部件级；所述修正模块，用于利用系统仿真模型仿真结果修正所述故障树模块中各个子模块之间的连接关系，得到目标故障树模块；所述链接模块，用于建立系统故障模式库与故障树模块中各个部件级子模块之间的链接关系，所述系统故障模式库中最小单元为元器件级；所述计算模块，用于根据系统仿真模型统计系统故障状态下的性能参数，计算健康度参数阈值；所述计算模块，还用于监测系统实时运行状态，若所述系统发生故障，基于所述故障状态下的性能参数计算所述目标故障树模块中各个部件级子模块的实时健康度值；所述定位模块，用于在所述实时健康度值低于所述健康度参数阈值时，定位该部件级子模块为实时故障模块；所述匹配模块，用于基于所述实时故障模块在所述系统故障模式库中匹配与之对应的实时元器件级故障模块；所述确定模块，用于以所述实时故障模块和所述实时元器件级故障模块作为故障对应的故障位置。本申请提供的基于智能故障树的故障自动定位方法和装置，首先通过建立MBSE模型，并基于所述MBSE模型构建故障树模块，所述故障树模块最小单元为部件级，然后利用系统仿真模型仿真结果修正所述故障树模块中各个子模块之间的连接关系，得到目标故障树模块，进而建立系统故障模式库与故障树模块中各个部件级子模块之间的链接关系，所述系统故障模式库中最小单元为元器件级，并根据系统仿真模型统计系统故障状态下的性能参数，计算健康度参数阈值；进一步的，监测系统实时运行状态，若所述系统发生故障，基于所述故障状态下的性能参数计算所述目标故障树模块中各个部件级子模块的实时健康度值，若所述实时健康度值低于所述健康度参数阈值，定位该部件级子模块为实时故障模块，从而基于所述实时故障模块在所述系统故障模式库中匹配与之对应的实时元器件级故障模块，最后以所述实时故障模块和所述实时元器件级故障模块作为故障对应的故障位置。这样，通过构建基于MBSE模型的故障树模块、系统仿真模型和系统故障模式库，将故障的监测分为三个层级，仿真层级的真实监测和故障树实现的部件级别的故障监测以及故障模式库中元器件级别的故障监测定位，融合了仿真结果的准确性，按照不同级别准确定位故障位置，提高定位的准确性和快速性；利用系统仿真模型仿真结果修正故障树模块得到目标故障树模块，能够将部分顶层故障不明确的故障元进一步明确故障逻辑，完成故障树的逻辑结构，提高后期故障定位的准确性；进一步的，将目标故障树模块与系统仿真模型相结合，把系统仿真模型中的测量参数转换为健康度参数，并将健康度参数与部件故障相对应，当系统发生故障时，通过计算目标故障树模块中各个部件级子模块的实时健康度值，定位实时健康度值低于健康度参数阈值的部件级子模块为实时故障模块，实现系统顶层故障的追溯，对于部分耦合、关联程度较强的故障，能够根据简化后的参数计算取代复杂的故障解耦过程，降低故障定位的计算量和准确性，进一步的，基于与系统故障模式库匹配对应的实时元器件级故障模块，得到故障位置，可以提高故障定位的细化程度，进一步提高故障定位的准确性。"
  },
  {
    "专利名": "人工智能虚拟现实酒瘾评估与干预方法及装置",
    "申请号": "CN202410753166.4",
    "公开日": "20240709",
    "IPC 分类号": "G06F3/01;A61B5/374;A61B5/0533;A61B5/346;G06F123/02;G06F18/2431;G06F18/243;A61B5/16;G06F18/2411;A61B5/00;G16H50/20;G16H20/70;G16H50/30;G06N20/10",
    "申请人": "中南大学湘雅二医院",
    "关键词": "虚拟现实呈现、脑电数据信息、心电数据信息、皮电数据信息、支持向量机、机器学习模型、渴求程度评估、干预强度和策略、人工智能、酒瘾评估、酒精干预、生理指标信息",
    "摘要": "本发明提供一种人工智能虚拟现实酒瘾评估与干预方法及装置，方法包括：通过虚拟现实呈现不同虚拟场景；实时记录不同虚拟场景下，当前患者的脑电数据信息、心电数据信息和皮电数据信息；以及对应虚拟场景下对酒精的渴求程度；将获得的各类生理指标信息和渴求程度输入训练好的支持向量机机器学习模型，评估出酒精使用障碍组、正常组；学习并识别出与不同渴求程度相关的特征，评估出对酒精的综合渴求状态；基于评估的酒精使用障碍分组和对酒精的渴求程度制定初步干预强度和策略，实时记录干预过程中的生理指标信息，根据生理指标信息动态调整干预强度和策略；本发明能够准确可靠的评估出患者对酒精的综合渴求状态并给与个性化干预。",
    "说明书": "人工智能虚拟现实酒瘾评估与干预方法及装置技术领域本发明涉及成瘾评估技术领域，尤其涉及一种人工智能虚拟现实酒瘾评估与干预方法及装置。背景技术虚拟现实（Virtual Reality，VR）技术目前在神经科学和心理学领域中快速发展，已经有了十分广泛的应用，包括对焦虑症、抑郁症和创伤后应激障碍等精神疾病的评估和治疗。在治疗酒精使用障碍过程中，酒精使用障碍线索暴露是导致复饮的重要原因之一。从已有的VR相关物质使用障碍研究来看，物质相关VR环境能成功诱发渴求，并在线索反应的评估方面具有优势。针对酒精障碍的非药物心理治疗方法较多，例如认知行为治疗(CognitiveBehavioral Therapy，CBT)、动机强化治疗(Motivational Enhancement Therapy，MET)、正念疗法(Mindfulness Therapy)等，然而由于传统的心理治疗方法生态效度低，无法达到很好的效果。而VR技术可以使酒精使用障碍患者在虚拟环境中体验到真实的感受，创造与成瘾记忆形成相似而逼真的环境，让酒精使用障碍患者有身临其境的感觉，可以提升线索反应的效果。目前针对酒精使用障碍的评估仅仅停留于临床量表评估，较为主观，缺乏客观的生理指标；现有技术中，对酒精的患者的评估往往比较片面，评估结果准确性较低，且不能可靠的评估出患者对于酒精的渴求程度以及给出个性化干预方案。因此，亟需一种人工智能虚拟现实酒瘾评估与干预方法及装置，能够准确可靠的评估出患者对于酒精的综合渴求状态并个性化干预。发明内容本发明的目的是提供一种人工智能虚拟现实酒瘾评估与干预方法及装置，旨在解决传统的评估方法准确性和可靠性低的技术问题。为实现上述目的，第一方面，本发明提供一种人工智能虚拟现实酒瘾评估与干预方法，其步骤包括：S1：通过虚拟现实模拟呈现与酒精有关的不同虚拟场景，包括静息场景、中性场景、酒精线索暴露场景；S2：实时记录不同虚拟场景下，当前患者的脑电数据信息、心电数据信息和皮电数据信息；并在场景切换时对患者在对应虚拟场景下的酒精的渴求程度进行评价；S3：将步骤S2获得的脑电数据信息、心电数据信息和皮电数据信息，以及对酒精的渴求程度均输入训练好的支持向量机机器学习模型(Support Vector Machine, SVM)，所述支持向量机机器学习模型评估输出酒精使用障碍组、正常组；同时所述支持向量机机器学习模型对当前患者在不同虚拟场景下不同生理指标的权重，学习并识别出与不同渴求程度相关的特征，评估获得患者对酒精的综合渴求状态；S4：先基于步骤S3评估出的酒精使用障碍分组和对酒精的渴求程度制定出初步干预强度和策略，基于所述初步干预强度和策略进行干预时，实时记录干预过程中患者的心电数据信息和皮电数据信息，并根据干预过程中获得的客观数据动态调整干预强度和策略。作为上述方案进一步的改进，在步骤S1中，所述静息场景为平静的环境，如海浪沙滩等放松场景；所述中性场景为与酒精无关的场景；所述酒精线索暴露场景为与酒精相关的线索场景，用于引发患者的渴求反应，如独饮或聚会饮酒。作为上述方案进一步的改进，在步骤S1中，为患者呈现播放不同虚拟场景时，按照静息场景、第一中性场景、酒精线索暴露场景和第二中性场景的顺序进行播放。作为上述方案进一步的改进，所述脑电数据信息包括不同脑区间的功能连接强度信息、不同脑区的功率谱密度信息，以及脑电微状态下的平均持续时间、出现频率、时间覆盖率、微状态振幅、转换概率和微状态的全局解释方差中的几种或全部指标信息。作为上述方案进一步的改进，在获得不同脑区间的功能连接强度信息包括脑电信号的皮尔森相关系数、波谱相干性和互信息性。作为上述方案进一步的改进，获得不同脑区的功能连接强度信息的方法步骤包括：首先提取关键网络，再基于已知的脑区网络（如默认模式网络、前额叶-边缘系统网络）计算功能连接矩阵；然后进行组间对比，采用独立样本t检验或ANOVA（Analysis of Variance，即方差分析）比较两组功能连接矩阵在所述关键网络连接上的差异，获得渴求状态对功能连接强度的影响特征信息。作为上述方案进一步的改进，获得不同脑区的功率谱密度信息的方法步骤包括：首先计算频谱特征：对每位参与者的脑电波(Electroencephalogram,EEG)数据进行频谱分析，得到δ、θ、α、β、γ各频段的功率；再进行多维度分析，利用多变量统计方法获得不同频段功率与渴求状态及组别的关联特征信息。作为上述方案进一步的改进，获得脑电微状态下的各类指标信息的方法步骤包括：先采用微状态识别算法（优选，K-means聚类算法）划分脑电活动的不同状态组；分析各组在微状态下的平均持续时间、出现频率、时间覆盖率、微状态振幅、转换概率和微状态的全局解释方差上的差异，获得渴求状态对脑电微状态下的各类影响特征信息。作为上述方案进一步的改进，所述心电数据信息包括一系列能够反映心脏活动的时域数据信息与频域数据信息；所述时域数据信息包括心率、平均RR间期、最大RR间期、最小RR间期、最大最小RR差、标准差NN、NN50(相邻RR间期差大于50毫秒的相邻间期对的数量)、PNN50（相邻RR间期差大于50毫秒的相邻间期对的占比）、SDSD(相邻RR间期差的标准差)、TINN（三角形插值法测得的最大RR间期与最小RR间期的差） 、TriIndex(通过计算相邻RR间期的三角形面积来度量心率的变异性)中的几种或全部；所述频域数据信息包括低频成分（LF, Low Frequency）、高频成分（HF, HighFrequency）、归一化低频（LFNorm, Normalized Low Frequency）、归一化高频（HFNorm,Normalized High Frequency）、LF/HF比值（低频成分与高频成分之比）和总功率（TotalPower）中的几种或全部。作为上述方案进一步的改进，所述皮电数据信息包括每个对应场景下的最大皮肤电阻（skin resistance，SR）值、最小皮肤电阻值、平均皮肤电阻值和皮肤电阻值标准差。作为上述方案进一步的改进，所述渴求程度包括无渴求、轻度渴求、中度渴求和重度渴求四个程度。第二方面，本发明还提供一种上述人工智能虚拟现实酒瘾评估与干预方法的装置，包括VR酒精使用障碍评估系统、VR酒精使用障碍干预系统、VR设备和处理系统，所述VR酒精使用障碍评估系统包括评估场景数据库模块、脑电采集模块、心电采集模块和皮电采集模块；所述评估场景数据库模块至少包括静息场景、中性场景和酒精线索暴露场景；所述VR酒精使用障碍干预系统包括干预场景数据库模块、所述心电采集模块和所述皮电采集模块；所述干预场景数据库模块至少包括酒精线索暴露场景、厌恶场景、放松训练场景和正向激励场景，所述VR设备分别与所述评估场景数据库模块、所述干预场景数据库模块和所述处理系统相连接；所述处理系统包括存储执行模块、接收模块和控制模块，所述存储执行模块用于存储并执行训练好的支持向量机机器学习模型；所述接收模块与各采集模块相连接 ，用于接收其采集的生理指标信息并反馈给所述存储执行模块；所述控制模块与所述存储执行模块相连接，用于接收所述存储执行模块的输出结果并反馈给干预场景数据库模块。由于本发明采用了以上技术方案，使本申请具备的有益效果在于：本发明提供一种人工智能虚拟现实酒瘾评估与干预方法，其步骤包括：通过虚拟现实模拟呈现与酒精有关的不同虚拟场景，包括静息场景、中性场景、酒精线索暴露场景；实时记录不同虚拟场景下，当前患者的脑电数据信息、心电数据信息和皮电数据信息；并在场景切换时对患者在对应虚拟场景下的酒精的渴求程度进行评价；将获得的脑电数据信息、心电数据信息和皮电数据信息，以及对酒精的渴求程度均输入训练好的支持向量机机器学习模型，所述支持向量机机器学习模型评估输出酒精使用障碍组、正常组；同时所述支持向量机机器学习模型对当前患者在不同虚拟场景下不同生理指标的权重，学习并识别出与不同渴求程度相关的特征，评估获得患者对酒精的综合渴求状态；先基于评估出的酒精使用障碍分组和对酒精的渴求程度制定出初步干预强度和策略，基于所述初步干预强度和策略进行干预时，实时记录干预过程中患者的心电数据信息和皮电数据信息，并根据干预过程中获得的客观数据动态调整干预强度和策略；本发明利用心电、皮电、脑电技术与虚拟现实（VR）相结合进行酒精使用障碍评估；虚拟场景包括静息场景、酒精线索暴露场景和中性场景三类虚拟现实场景，在评估过程中，对当前患者在对应虚拟场景下对酒精渴求程度进行评估和记录，然后将获得的心电、皮电、脑电生理指标信息和渴求程度输入训练好的支持向量机机器学习模型进行酒精使用障碍程度和对酒精的渴求状态，本发明中结合对患者在虚拟场景下渴求程度的主观评估和在虚拟场景下获得的皮电、心电、脑电客观生理指标信息的客观评估，从而能够更加准确的识别酒精使用障碍者和渴求状态可以让医生更好的把握患者情况，做出准确的诊断；最后再基于评估结果制定初步干预强度和策略，在干预过程中再次采集患者的皮电和心电客观生理指标信息，并基于采集的客观生理指标信息动态调整干预强度和策略，如此的设置，能够根据患者的实际情况给予个性化的干预，从而达到良好的矫正效果，并能缩短矫正时间。"
  },
  {
    "专利名": "一种新能源工程车用蒸发器总成",
    "申请号": "CN202420359501.8",
    "公开日": "20240910",
    "IPC 分类号": "B60H1/00;B60H1/22",
    "申请人": "广西奥兰热管理科技有限公司",
    "关键词": "新能源工程车、蒸发器总成技术、蒸发器组件、固定组件、蒸发器外壳、蒸发器盖板、安装件、斜角架、冷芯、APTC制热芯体、蒸发风机、汽车蒸发器总成",
    "摘要": "本实用新型涉及汽车蒸发器总成技术领域，且公开了一种新能源工程车用蒸发器总成，包括蒸发器组件和固定组件，所述蒸发器组件包括蒸发器外壳，在蒸发器外壳上固定有蒸发器盖板，同时蒸发器外壳的一端开设有与内部互通输出槽，而蒸发器外壳的侧部开设有与内部互通的输入槽，并且蒸发器外壳的侧部设置有用于固定在车中的安装件，所述蒸发器外壳内的一端固定有斜角架，在斜角架内固定有冷芯，同时蒸发器外壳内的另一端固定有安装架，在保留了传统吸风式设计的同时，通过更换APTC制热芯体至蒸发风机前方的设计，使得APTC制热芯体在运作的状态下，通过蒸发风机所产生的风体，将热源直接从输出槽向外输出，从而避免对蒸发风机造成加热过度，导致变形的问题。",
    "说明书": "一种新能源工程车用蒸发器总成技术领域本实用新型涉及汽车蒸发器总成技术领域，具体为一种新能源工程车用蒸发器总成。背景技术新能源汽车是指采用非常规的车用燃料作为动力来源，实现行驶的汽车，目前，市面上常见的新能源汽车采用电能作为驱动动力来源，而新能源汽车和燃油汽车的空调系统截然不同，传统的燃油汽车将发动机工作所产生的热量加发动机散热器中的水，由水泵将发动机散热系统中的热水引入蒸发箱中的制热芯片，通过鼓风机驱动空气从而与驾驶室的空气进行热交换，而新能源汽车没有发动机，无法产生大量热量，制热芯片就没有了持续高热量来源满足驾驶室升温的需求。目前，现有的新能源工程车用蒸发器总成，大多采用将冷芯和制热芯片放置在蒸发风机后方，通过控制冷芯或制热芯片运作，并通过蒸发风机将空气吸附内部，与所产生的气体结合后，从输出槽向外输入驾驶室，从而达到升温的效果，但是在制热过程中，大量热源直接接触蒸发风机，长时间易导致蒸发风机烘烤变形，同时传统的制热芯体，无法达到良好的制热效果，存在一定的缺陷。实用新型内容(一)解决的技术问题针对现有技术的不足，本实用新型提供了一种新能源工程车用蒸发器总成，具备能够避免蒸发风机烘烤变形以及提高了制热芯体的加热效果等优点，解决了现阶段的蒸发风机，在制热芯片加热的高温状态下，易变形以及传统制热芯片无法达到良好的制热效果的问题。(二)技术方案为实现上述目的，本实用新型提供如下技术方案：一种新能源工程车用蒸发器总成，包括蒸发器组件和固定组件，所述蒸发器组件包括蒸发器外壳，在蒸发器外壳上固定有蒸发器盖板，同时蒸发器外壳的一端开设有与内部互通输出槽，而蒸发器外壳的侧部开设有与内部互通的输入槽，并且蒸发器外壳的侧部设置有用于固定在车中的安装件，所述蒸发器外壳内的一端固定有斜角架，在斜角架内固定有冷芯，同时蒸发器外壳内的另一端固定有安装架，在安装架内固定有APTC制热芯体，同时斜角架和安装架之间固定有稳固架，在稳固架内固定有蒸发风机，通过改变传统蒸发器总成内各器件的位置，在蒸发风机运作状态下，使得空气经过输入槽进入蒸发器外壳内，将冷芯所制处的冷风向前吹动，使得冷风从输出槽输出，实现向车内输入冷气效果，而APTC制热芯体在加热后，通过蒸发风机运作的状态下，将APTC制热芯体所制处的热气从输出槽向外输出，从而实现向车内输入热气效果，同时APTC制热芯体具有热阻小，换热效率高的特性；所述固定组件包括安装在稳固架内的稳固压板，稳固压板的底部贴合在蒸发风机上方，稳固压板用于压制蒸发风机，将蒸发风机进行固定，避免其产生晃动的作用。作为上述方案的进一步改进，所述斜角架的两端固定在蒸发器外壳内的一端，且与输入槽相对应；通过上述技术方案，斜角架的一端固定在蒸发器外壳内一端靠近输入槽接口处的斜角位置，与输入槽之间呈45°倾斜角，使得在制冷状态下，冷芯运作，外界空气通过蒸发风机运作的状态下，将空气吸入蒸发器外壳内时，将冷芯所产生的冷气同空气结合后，从输出槽排出的效果。作为上述方案的进一步改进，所述斜角架和安装架上均套接有稳固压杆，在稳固压杆的侧部套接有连接筒，连接筒螺纹连接在架体内；通过上述技术方案，稳固压杆向下移动，贴合在对应的装置体上，实现对装置体进行固定的作用。作为上述方案的进一步改进，所述连接筒内套接有张力弹簧，张力弹簧的一端贴合在稳固压杆的一端；通过上述技术方案，张力弹簧具备展开向下推动稳固压杆，使得稳固压杆的底部紧贴在装置体上，对齐进行加固，避免装置在对应的架体内产生晃动的作用。作为上述方案的进一步改进，所述稳固压杆的一端固定有吸附盘，且吸附在APTC制热芯体和蒸发风机上；通过上述技术方案，吸附盘具体为橡胶材质支撑，具备一定的柔性，当稳固压杆向下移动时，使得吸附盘紧贴在对应的装置体上，对齐进行吸附固定作用，增加装置体在对应架体中的稳定性。作为上述方案的进一步改进，所述稳固压板上开设有贯穿底部的连接孔，在连接孔内铰接有转动杆，转动杆螺纹连接在稳固架上，并固定有转动钮；通过上述技术方案，在顺时针或逆时针转动转动钮时，使得转动杆侧部螺纹与稳固架内螺纹连接的作用力下，使得转动杆在稳固架内上下移动，使底部对应铰接的稳固压板底部紧贴在蒸发风机上方，对其压紧固定或调松后对蒸发风机拆卸后进行清洁或更换的作用。作为上述方案的进一步改进，所述稳固压板上固定有移动杆，移动杆套接在稳固架内；通过上述技术方案，稳固压板具体呈X形状，且每端的顶面均安装有移动杆，移动杆套接在稳固架上对应位置，当稳固压板上下移动时，使得移动杆在稳固架内上下伸缩，从而提高稳固压板升降的稳定性。作为上述方案的进一步改进，所述稳固压板的底部固定有定位钮，且贴合在蒸发风机上；通过上述技术方案，当稳固压板向下移动时，使得定位钮紧贴在蒸发风机上对应位置，从而实现对蒸发风机进行固定的作用。与现有技术相比，本实用新型提供了一种新能源工程车用蒸发器总成，具备以下有益效果：1、该新能源工程车用蒸发器总成，在保留了传统吸风式设计的同时，通过更换APTC制热芯体至蒸发风机前方的设计，使得APTC制热芯体在运作的状态下，通过蒸发风机所产生的风体，将热源直接从输出槽向外输出，从而避免对蒸发风机造成加热过度，导致变形的问题。2、该新能源工程车用蒸发器总成，太难过采用APTC制热芯体代替传统的水暖制热芯体，电能转换率能达到95％，且安装方便，没有了传统水循环系统，从而有效节省了水管、水阀等附件的成本。"
  },
  {
    "专利名": "一种新能源工程车辆的热管理系统及车辆",
    "申请号": "CN202410025771.X",
    "公开日": "20240514",
    "IPC 分类号": "B60K1/00;B60L58/26;B60L58/27;B60K11/02",
    "申请人": "中铁工程装备集团隧道设备制造有限公司",
    "关键词": "热量管理、新能源工程车辆、热管理系统、电池热管理回路、液压油热管理回路、电气热管理回路、散热装置",
    "摘要": "本发明属于热量管理技术领域，具体涉及一种新能源工程车辆的热管理系统及车辆。热管理系统包括三个独立的热管理回路：第一回路为电池热管理回路，设置有动力电池散热装置；第二回路为液压油热管理回路，设置有液压油散热装置；第三回路为用于实现底盘电气件和上装电气件热管理的电气热管理回路，设置有电气散热装置；动力电池散热装置、液压油散热装置和电气散热装置集成在一个散热器中，散热器上设置有风扇。通过上述设置，本发明的热管理系统降低了热管理系统控制的复杂度，提高了热管理系统的集成度，提升了整机轻量化水平。",
    "说明书": "一种新能源工程车辆的热管理系统及车辆技术领域本发明属于热量管理技术领域，具体涉及一种新能源工程车辆的热管理系统及车辆。背景技术近年来随着国家新能源行业的发展，在隧道和矿山施工领域使用的非道路工程设备中，新能源工程车辆也在逐渐发展。新能源工程车辆包括有动力电池、上装驱动电机、底盘驱动电机、电机控制器和液压油箱等多种部件，其散热性能的好坏决定了这些部件的使用寿命、安全性，以及电气系统的工作效率。因此，需要使用水泵、散热器、压缩机及冷凝器等设备对新能源工程车辆进行热管理，但由于工程车辆构成复杂，对应的热管理设备也较多，整个工程车辆的热管理系统集成度不高，控制较为复杂。发明内容本发明的目的在于提供一种新能源工程车辆的热管理系统及车辆，用以解决新能源工程车辆的热管理系统集成度不高及控制较为复杂的问题。本发明为解决上述技术问题而提供一种新能源工程车辆的热管理系统，包括三个独立的热管理回路：第一回路为电池热管理回路，设置有动力电池散热装置；第二回路为液压油热管理回路，设置有液压油散热装置；第三回路为用于实现底盘电气件和上装电气件热管理的电气热管理回路，设置有电气散热装置；所述动力电池散热装置、液压油散热装置和电气散热装置集成在一个散热器中，所述散热器上设置有风扇。进一步地，所述电池热管理回路包括制冷剂支路和散热支路，制冷剂支路和散热支路通过板式换热器进行能量交换，动力电池散热装置为制冷剂支路上的冷凝器，所述散热支路上依次设置有第一水泵、板式换热器和加热器。进一步地，所述电气热管理回路包括主回路、底盘电气件冷却支路和上装电气件冷却支路，两个支路通过控制阀与主回路连通，所述主回路上依次设置第二水泵和电气散热装置。进一步地，所述电池热管理回路上还设置有第一温度传感器，用于检测动力电池系统的温度T1；液压油热管理回路上还设置有第二温度传感器，用于检测液压油的温度T2；底盘电气件冷却支路上还设置有第三温度传感器，用于检测底盘电气件的温度T3；上装电气件冷却支路上还设置有第三温度传感器，用于检测上装电气件的温度T4。进一步地，所述风扇至少设置3组，包括装配在动力电池散热装置上的第一风扇，装配在液压油散热装置上的第二风扇，以及装配在电气散热装置上的第三风扇。进一步地，所述电池热管理回路的控制策略包括：0℃≤T1＜第一设定温度时，电池热管理回路不开启；第一设定温度≤T1≤第二设定温度时，不开启压缩机，控制第一水泵以第一设定转速运转，第一风扇以第二设定转速运转；第二设定温度＜T1≤第三设定温度时，控制第一水泵以额定转速运转，第一风扇以最大转速运转，开启压缩机，且压缩机的运转功率随T1的升高而增大；当T1＞第三设定温度时，进入紧急下电模式，第一设定温度＜第二设定温度＜第三设定温度。进一步地，所述电气热管理回路的控制策略包括：当底盘电气件温度或上装电气件温度大于第四设定温度时，控制第二水泵以额定转速运转，第三风扇以最大转速运转。进一步地，当底盘电气件温度、上装电气件温度和液压油温度中的任一温度大于第四设定温度时，控制第一风扇、第二风扇和第三风扇均以最大转速运转。进一步地，所述上装电气件还包括充电机，当工程车辆处于充电模式时，若动力电池系统温度T1＜0℃，先通过加热器或电池箱内的电加热膜对动力电池系统进行加热，加热至T1≥第一设定温度时，控制充电机对动力电池进行充电。上述技术方案的有益效果为：本发明通过设置独立控制的电池热管理回路、液压油热管理回路和电气热管理回路，能够分别对工程车辆中的动力电池系统、液压油及电气件进行热管理，工程车辆的热管理系统架构简单清晰，降低了热管理系统控制的复杂度，动力电池散热装置、液压油散热装置和电气散热装置集成在一个散热器，提高了热管理系统的集成度，提升了整机轻量化水平。为解决上述技术问题，本发明还提供了一种车辆，车辆为新能源工程车辆，包括上述介绍的一种新能源工程车辆的热管理系统。上述技术方案的有益效果为：通过在新能源工程车辆中设置独立控制的电池热管理回路、液压油热管理回路和电气热管理回路的热管理系统，降低了热管理控制的复杂度，动力电池散热装置、液压油散热装置和电气散热装置集成在一个散热器，提高了热管理系统的集成度，提升了整机轻量化水平。"
  },
  {
    "专利名": "一种冷却系统及新能源工程车辆",
    "申请号": "CN202410001342.9",
    "公开日": "20240402",
    "IPC 分类号": "B60K11/04;F01P7/08;B60K11/06;F02B29/04;F16H57/04;F01P3/18;F01P3/20;B60H1/32;B60H1/00;F01P7/04;F15B21/0423;F01P5/02",
    "申请人": "徐工集团工程机械股份有限公司科技分公司",
    "关键词": "冷却系统、新能源工程车辆、散热风扇、散热芯体、散热器总成、中冷散热、水散热、轮边减速机、驱动电机、驱动电机控制器、管线路简化、冷却系统、新能源工程车辆、轮边减速机、驱动电机",
    "摘要": "本发明公开了一种冷却系统及新能源工程车辆，其包括散热风扇、第一散热芯体和第二散热芯体、中冷散热芯体和水散热芯体；所述第一散热芯体、第二散热芯体、中冷散热芯体和水散热芯体均集成在散热器总成上，并位于所述散热风扇出风侧的同一迎风面上；所述中冷散热芯体和水散热芯体分别用于对发动机的进气和进水冷却；所述第一散热芯体连接第一循环油路，用于对轮边减速机冷却；所述第二散热芯体连接第一循环水路，用于对驱动电机及驱动电机控制器冷却。本发明的简化了冷却系统的管线路，为整车其他系统元件留出布置空间，大幅提升整车空间利用率。",
    "说明书": "一种冷却系统及新能源工程车辆技术领域本发明涉及新能源工程车辆技术领域，特别涉及一种冷却系统及新能源工程车辆。背景技术大型工程车辆，如大吨位装载机，适用于工况恶劣、工作负载变化大、对可靠性及效率要求较高的大型矿山、港口、铁路等工作场景。传统大吨位装载机普遍以液力传动为基础，配合大排量发动机实现整机对功率的需求。液力传动装载机选用的大排量发动机具有能耗高，系统组成元件繁多，日常保养及维修费用高的缺点。随着用户对工程车辆可靠性要求的不断提升，能源绿色低碳转型的持续推进，传统工程机械制造商对工程车辆动力传动形式的研究逐渐转向新能源领域。新能源工程车辆是一种较为理想的大吨位装载机动力传动形式，满足了各种复杂恶劣工况对大吨位装载机对动力性能的需求，能耗小，故障率低，维修成本低，对减少碳排放也起到了积极作用。在一些相关技术中，大吨位的新能源工程车辆冷却系统存在元件数量多，发热量大，由于整机布局限制，冷却系统各元件分布在整机各个部位，造成散热水泵、散热油泵、散热风扇、散热器、冷却管线路、电器管线路等零部件数量繁多、布局混乱及占用车辆空间大等诸多问题。此外，对于大吨位的新能源工程车辆，因加工制造简单、成本低，通常采用轮边减速机代替传统大吨位装载机通过桥驱动轮胎为整机提供动力及制动功能的设计。轮边减速机内集成有整车行车制动器及驻车制动器，车辆在长下坡等频繁制动工况下容易导致减速机内油温过高，如果轮边减速机不能及时冷却，容易造成制动性能下降及减速机因润滑不良导致的减速机失效的情况；而目前对轮边驱动混合动力大吨位装载机冷却系统的研究相对较少，对于轮边减速机的冷却，现有的方案通常采用外部的制动盘在减速机外部，通过增加主动风冷的方式为其散热，这种散热方式的设计对于大吨位机型来说其制动效果较差，且容易影响轮边减速机的使用寿命。发明内容本发明的目的在于克服现有技术中的不足，提供了一种冷却系统及新能源工程车辆。为解决上述技术问题，本发明是采用下述技术方案实现的：第一方面，本发明提供一种冷却系统，包括散热风扇、第一散热芯体和第二散热芯体、中冷散热芯体和水散热芯体；所述第一散热芯体、第二散热芯体、中冷散热芯体和水散热芯体均集成在散热器总成上，并位于所述散热风扇出风侧的同一迎风面上；所述中冷散热芯体和水散热芯体分别用于对发动机的进气和进水冷却；所述第一散热芯体连接第一循环油路，用于对轮边减速机冷却；所述第二散热芯体连接第一循环水路，用于对驱动电机及驱动电机控制器冷却。结合第一方面，可选的，所述第一循环水路包括第一集水器、第二集水器、第三集水器、以及并联设置的第一水泵和第二水泵；所述第二散热芯体的出水口分两路分别通过第一水泵和第二水泵后连接至第一集水器的进水口；所述第一集水器和第二集水器上均设置有多个出水口，冷却水分别经第一集水器的各出水口分流至各驱动电机控制器后汇流至第二集水器，再经第二集水器的各出水口分流至各驱动电机后汇流至第三集水器；所述第三集水器的出水口与第二散热芯体的进水口连接。结合第一方面，可选的，各所述驱动电机控制器与第一集水器之间的水路上以及各所述驱动电机与第二集水器之间的水路上均设置有电磁阀；各所述电磁阀分别用于控制其所在水路的通断与冷却水流量。结合第一方面，可选的，第一循环油路包括油泵，所述第一散热芯体的出油口与轮边减速机进油口连通，所述轮边减速机出油口通过油泵连接至第一散热芯体的进油口。结合第一方面，可选的，还包括集成在所述散热器总成上的第三散热芯体；所述第三散热芯体连接第二循环水路，用于对发电机、发电机控制器以及电容冷却。结合第一方面，可选的，所述第二循环水路包括第三水泵和第四集水器；所述第三散热芯体的出水口通过第三水泵连接至第四集水器，所述第四集水器的三个出水口分别连接至发电机、发电机控制器和电容的进水口，所述发电机、发电机控制器和电容的出水口分别连通至第三散热芯体的进水口。结合第一方面，可选的，所述发电机、发电机控制器和电容的进水口与第四集水器的出水口之间的水路上均设置有电磁阀，各所述电磁阀分别用于控制其所在水路的通断与冷却水流量。结合第一方面，可选的，所述散热器总成上还集成有第四散热芯体和空调冷凝器，所述第四散热芯体用于对整车液压系统冷却，所述空调冷凝器用于对空调组件冷却。结合第一方面，可选的，还包括整车控制器；轮边减速机、驱动电机、驱动电机控制器、发电机、发电机控制器和电容内均设有温度传感器；所述整车控制器与散热风扇、各温度传感器、各电磁阀、各油泵、第一水泵、第二水泵、第三水泵分别电连；整车控制器，用于根据各所述温度传感器获得的各温度分别控制其对应电磁阀、油泵、第一水泵、第二水泵和/或第三水泵的通断与开度，以及控制所述散热风扇的启动和转速。第二方面，本发明还提供一种新能源工程车辆，包括如第一方面任一所述的冷却系统。与现有技术相比，本发明所达到的有益效果是：本发明提供的冷却系统，通过将第一散热芯体、第二散热芯体、中冷散热芯体和水散热芯体集成在散热器总成上进行集中散热，提高整车的散热效果，同时节省了冷却系统占用整车内部的空间。本发明通过第一循环油路对轮边减速机进行冷却的设计方案，克服了现有散热方案容影响其制动功能的缺陷；通过增加油路降温的方式，能够提高轮边减速机冷却效果的同时，确保了轮边减速机的制动效果，有利于延长其使用寿命。本发明提供的第一循环水路和第二循环水路通过利用水泵集中提供冷却水，以及利用集水器提供分散冷却水的设计，简化了冷却系统的管线路、元件数量少、元件集成度高、为整车其他系统元件留出布置空间，大幅提升整车空间利用率、系统简单、易于实现、成本低；此外，本发明提供的冷却系统或其子系统可广泛应用到混动工程车辆及纯电工程车辆，如取消第二循环水路对发电机、发电机控制器及电容进行冷却的设计即可应用到纯电车型中。本发明通过整车控制器控制各电磁阀、水泵、油泵、散热风扇的配合，在满足散热性能的前提下来调整水泵、油泵、风扇的功耗，达到降低冷却系统功耗的目的。"
  },
  {
    "专利名": "换电装置及工程车辆",
    "申请号": "CN202323617477.8",
    "公开日": "20240618",
    "IPC 分类号": "B60K1/04",
    "申请人": "长城重工有限公司",
    "关键词": "换电装置、工程车辆、安装单元、更换单元、吊装单元、动力电池、新能源工程车辆、动力电池、工程车辆推广",
    "摘要": "本实用新型提供了一种换电装置及工程车辆，包括安装单元、更换单元和吊装单元，安装单元设于车架；更换单元沿前后方向滑动连接于所述安装单元，且所述更换单元还绕第一轴线与所述安装单元转动连接，所述第一轴线与前后方向呈夹角设置，动力电池安装于所述更换单元，所述更换单元向背离所述安装单元的一侧滑动至最远端时，所述更换单元绕所述第一轴线向下翻转；吊装单元转动连接于所述安装单元，所述吊装单元用于吊装动力电池。本实用新型提供的换电装置及工程车辆，旨在解决现有技术中新能源工程车辆动力电池的更换受限、成本较高，严重影响新能源工程车辆推广使用的问题。",
    "说明书": "换电装置及工程车辆技术领域本实用新型属于新能源换电装置技术领域，更具体地说，是涉及一种换电装置及工程车辆。背景技术电动化工程设备逐渐取代老式的内燃机工程设备，然而装载机、挖掘机等工程机械设备由于长期进行重型作业，能耗非常之高，换电可以有效地解决电动化工程设备的续航焦虑问题。但目前装载机、挖掘机等工程车辆的换电工作通常需要在换电站内进行，不仅需要建设换电站，还需要配置专用的换电设备，在新能源装载机、挖掘机等工程车辆的投资成本和运行成本中占有相当大的比重。虽然这种换电模式对于新能源工程车辆集群的场景是比较合适的，但是对于新能源工程车辆不多，而且需要连续作业的场景，建设换电站的路线投资成本就会很高，而且每一次换电都需要在换电站内进行，这样会使得新能源装工程车辆的换电操作复杂化，提高了时间成本和人力成本。为了降低新能源工程车辆的换电成本，部分拥有新能源工程车辆较少的用户采用吊装设备对动力电池进行更换。但是，大多数工程机械车辆需要野外作业，工作环境受限，吊装设备等大型工程机械根本无法使用，不仅严重影响新能源工程车辆的正常使用，而且对于新能源工程车辆的推广产生了较大的阻碍。实用新型内容本实用新型的目的在于提供一种换电装置及工程车辆，旨在解决现有技术中新能源工程车辆动力电池的更换受限、成本较高，严重影响新能源工程车辆推广使用的问题。为实现上述目的，本实用新型采用的技术方案是：第一方面，提供一种换电装置，包括：安装单元，设于车架；更换单元，沿前后方向滑动连接于所述安装单元，且所述更换单元还绕第一轴线与所述安装单元转动连接，所述第一轴线与前后方向呈夹角设置，动力电池安装于所述更换单元，所述更换单元向背离所述安装单元的一侧滑动至最远端时，所述更换单元绕所述第一轴线向下翻转；以及吊装单元，转动连接于所述安装单元，所述吊装单元用于吊装动力电池。结合第一方面，在一种可能的实现方式中，所述安装单元包括沿左右方向间隔分布的多个固定件，多个所述固定件分别连接于车架，所述更换单元沿前后方向滑动连接于多个所述固定件。结合第一方面，在一种可能的实现方式中，所述安装单元还包括连接于多个所述固定件的连接件。结合第一方面，在一种可能的实现方式中，所述安装单元沿前后方向开设有滑槽，所述滑槽内设有限位杆，所述限位杆的轴线平行于左右方向，所述更换单元包括：支撑组件，包括沿前后方向滑动连接于车架的支撑平台和连接于所述支撑平台后侧的滑动件，所述滑动件滑动设于所述滑槽内，且所述滑动件沿前后方向开设有限位槽，所述限位杆插设于所述限位槽内，所述滑动件向背离所述安装单元的一侧滑动至最远端时，所述滑动件绕所述限位杆向下翻转；以及驱动组件，与所述安装单元转动连接，所述驱动组件的驱动端转动连接于所述支撑平台，用于驱动所述支撑平台沿前后方向滑动。结合第一方面，在一种可能的实现方式中，所述滑动件靠近所述安装单元的一侧具有弧形的让位部，所述让位部位于所述滑动件的顶部。结合第一方面，在一种可能的实现方式中，所述驱动组件包括：伸缩驱动器，转动连接于所述安装单元；以及紧固件，连接于所述支撑平台，所述紧固件沿左右方向延伸，所述伸缩驱动器的伸缩端与所述紧固件转动连接。结合第一方面，在一种可能的实现方式中，所述更换单元还包括分别与所述安装单元和所述驱动组件连接的锁定组件，所述锁定组件包括：导向件，连接于所述安装单元，所述导向件沿左右方向设置；以及锁定件，沿前后方向开设有锁紧槽，所述导向件插设于所述锁紧槽内，所述锁定件的还与所述紧固件转动连接，所述支撑平台向下翻转至最低点时，所述导向件与所述锁紧槽的外缘挂接。结合第一方面，在一种可能的实现方式中，所述吊装单元包括：吊装驱动器，转动连接于所述安装单元，所述吊装驱动器为伸缩构件；以及吊装组件，转动连接于所述安装单元，且所述吊装组件还与所述吊装驱动器的驱动端转动连接，所述吊装组件用于吊装动力电池。结合第一方面，在一种可能的实现方式中，所述吊装组件包括转动连接于所述安装单元的吊装臂，所述吊装臂的中间部连接有驱动杆，所述驱动杆与所述吊装驱动器转动连接，所述吊装臂的一端转动连接于所述安装单元，另一端用于与动力电池连接。本实用新型提供的换电装置的有益效果在于：与现有技术相比，本实用新型换电装置直接安装于车架，随工程车辆的行进。当需要更换动力电池时，沿前后方向向背离安装单元的一侧滑动更换单元，在更换单元滑动至最远端后，更换单元向下翻转，从而使连接于更换单元的动力电池同步向下翻转。更换单元向下翻转至指定位置后，吊装单元将车载动力电池卸下。然后，吊装单元将新的动力电池吊装至与更换单元连接，随后更换单元向上转动并沿前后方向滑动复位。本实用新型无需使用外部吊装设备进行动力电池的更换，在野外等工作现场可以更加方便快捷的实现动力电池更换，保证新能源工程车辆持续的续航能力。同时，也无需建立专用的换电站，降低了换电成本，有利于新能源工程车辆的大范围推广。第二方面，本实用新型实施例另提供一种工程车辆，包括上述任意一项所述的换电装置。本实用新型提供的工程车辆的有益效果在于：与现有技术相比，本实用新型工程车辆采用了上述的换电装置，与上述的换电装置具有类似的技术效果，在此不再赘述。"
  },
  {
    "专利名": "一种新能源工程车辆用多功能组合阀及其控制方法",
    "申请号": "CN202311808079.6",
    "公开日": "20240409",
    "IPC 分类号": "B60T17/00;B60T15/02;B60T15/36;B60T17/04;B60T13/26",
    "申请人": "芜湖盛力科技股份有限公司",
    "关键词": "多功能组合阀、油水分离器、气压信号开关、控制方法、电加热器、消音器、电动空压机、气制动系统、节约能源、降低能耗、制动管路、冬季畅通、降低噪音、新能源工程车辆、电动空压机、气制动系统、电动工程车、制动管路",
    "摘要": "本发明公开了一种新能源工程车辆用多功能组合阀，包括油水分离器组合阀，油水分离器组合阀包括阀体，阀体包括进气口、出气口和排气口；在阀体的进气口位置，设置气压信号开关。本发明还公开了该多功能组合阀的控制方法。该多功能组合阀还设置电加热器和消音器；采用上述技术方案，实现新能源电动车的电动空压机在气制动系统压力过低时开启，压力达标时关机，从而达到节约能源、降低能耗的效果；实现电动工程车制动管路在冬季畅通不结冰的功能，进而解决电动工程车无法行驶的问题；可降低整车噪音，减少噪声污染，进而解决了尖锐“啸叫”声影响驾驶员及工作人员身心健康的问题。",
    "说明书": "一种新能源工程车辆用多功能组合阀及其控制方法技术领域本发明属于新能源电动工程车辆气压制动系统的技术领域。更具体地，本发明涉及一种新能源工程车辆用多功能组合阀。本发明还涉及该多功能组合阀的控制方法。背景技术传统燃油工程车辆，气制动系统通常采用由燃油发动机直接带动的活塞式空压机来提供压缩空气，与空压机配合使用的空气处理装置通常是由卸荷阀、油水分离器、安全阀等组合成的油水分离器组合阀。其工作频率取决于燃油发动机和空压机，发动机工作即组合阀工作，发动机停机即组合阀停机，系统通常有工作时间长，工作频率高，工作噪声大等问题。近年来发展的新能源电动工程车，制动系统采用电动空压机来压缩空气，若依然采用传统油水分离器组合阀处理空气，则将因为频繁无用工作增大制动系统电耗，进而增大整机电耗，极大减少了车辆行驶里程及工作时间；其次因电动工程车产热量较小，冬季时气制动管路会因内部冷凝水结冰，而导致堵塞、破损，进而导致整机无法行驶；再次因电动工程车整体工作噪声小，而传统油水分离器组合阀排气噪声大，会增大整机噪声水平，影响驾驶员及工作人员身心健康。采用“汽车；多功能；阀；油；水；分离器”等关键词，对现有公开的技术文献进行检索，其检索结果如下：1、中国专利文献：“一种多功能汽车制动器气液动力控制装置”，专利(申请)车为：201520949826.2，其记载的技术方案是：“多功能汽车制动器气液动力控制装置，包括供能气源、油水分离器、智能控制模块、第一电磁阀、第二电磁阀、液体增压缸、液压传感器、气压传感器、液压制动器、气动制动器；所述供能气源与所述油水分离器连接；所述油水分离器与所述第一电磁阀、第二电磁阀连接；所述第一电磁阀与所述液体增压缸连接；所述液体增压缸与所述液压传感器连接；所述液压传感器与所述液压制动器连接；所述第二电磁阀与所述气压传感器连接；所述气压传感器与所述气动制动器连接；所述智能控制模块与所述第一电磁阀、第二电磁阀、液压传感器、气压传感器连接”；该技术文献记载其取得技术效果是：“结构简单、制造成本低，应用灵活，功能强大，可靠性高、便于维护”。2、中国专利文献：“一种带散热冷却和油水分离的多功能干燥器总成”，专利(申请)号为：201820093717.9，其记载的技术方案是：“带散热冷却和油水分离的多功能干燥器总成，包括干燥筒和安装在干燥筒底部的主体，所述主体上开设有用于进气的进气口，进气口通过a腔与干燥筒内部的环形通道连接，a腔内安装有用于进行油水分离的旋风盘，干燥筒的顶部设有与环形通道连通的c腔，c腔中的压缩空气经过干燥筒内的分子筛的过滤之后进入到d腔中，所述d腔通过单向阀与e腔连接，e腔通过四保阀与f腔连接，f腔通过四保阀与g腔连接，g腔通过卸载阀与h腔连接，h腔的端部设有排气口”；该技术文献记载其取得技术效果是：“高集成度：空干器、四保阀和油水分离器集成一体，安装简单便捷，无需额外的管路、接头和支架，有助于缩短制动响应时间”但是，上述公开的与本申请相关的技术文献，并没有能够解决现有技术中存在的“制动系统电耗大、冬季时气制动管路会因内部冷凝水结冰、行驶过程中的噪音大”等问题和缺陷。发明内容本发明提供一种新能源工程车辆用多功能组合阀，其目的是提高多功能组合阀的综合性能，包括节能、降噪，防止阀内结冰。为了实现上述目的，本发明采取的技术方案为：本发明的新能源工程车辆用多功能组合阀，包括油水分离器组合阀，所述的油水分离器组合阀包括阀体，所述的阀体包括进气口、出气口和排气口；在所述的阀体的控制腔体位置，设置气压信号开关。所述的气压信号开关通过通讯信号电路与车辆电脑连接。所述的车辆电脑根据气压信号开关采集的气压信号，控制电动空压机的启停，即在气制动系统压力低于设定工作压力值时供气；达到或超过设定工作压力值时停止供气。所述的阀体内设置电加热器，所述的电加热器的控制电路与车辆电脑连接；所述的新能源工程车设置大气温度传感器，所述的大气温度传感器通过信号电路与车辆电脑连接，所述的车辆电脑根据大气温度传感器的信号判断是否开启电加热器进行加热。在所述的排气口上，设置消音器；所述的排气口通过消音器连通大气。所述的消音器内设有多个用于吸收音响能量的小腔体和小孔。所述的进气口与电动空压机气源出气口通过输气管路连接。所述的出气口与储气筒通过储气管路连接。为了实现与上述技术方案相同的发明目的，本发明还提供了以上所述的新能源工程车辆用多功能组合阀的控制方法，其技术方案是：当电动空压机开启后，向所述的进气口供气，由油水分离器组合阀分离空气中的油脂、水分；并在过滤杂质后，经所述的出气口向储气筒充气；当所述的气压信号开关感知大气气压超出系统额定工作气压值时，所述的油水分离器组合阀卸荷，将超压空气经排气口、消音器排入大气；同时，由所述的气压信号开关输出电信号至车辆电脑，由车辆电脑控制电动空压机停机；当系统气压低于额定工作气压值时，所述的气压信号开关停止输出电信号至车辆电脑，由车辆电脑控制电动空压机开机；当整车的大气温度传感器感知车辆处于低温环境时，由车辆电脑控制所述的电加热器开启，为油水分离器组合阀的腔体易积水位置加热，防止油水分离器组合阀内的冷凝水结冰；当大气温度传感器感知大气处于常温环境下，则车辆电脑控制电加热器关闭。所述的电加热器采用电阻通电加热。本发明采用上述技术方案，通过对传统油水分离器组合阀增加气压信号输出、电加热防结冰、排气消音功能等，更好地适配新能源电动工程车辆的需要；可实现新能源电动车的电动空压机在气制动系统压力过低时开启，压力达标时关机，从而达到节约能源、降低能耗的效果；进而解决了电动工程车辆行驶里程虚标、工作时间短的问题；可实现电动工程车制动管路在冬季畅通不结冰的功能，进而解决了电动工程车无法行驶的问题；可减弱整车噪音，减少噪声污染，进而解决了尖锐“啸叫”声影响驾驶员及工作人员身心健康的问题。"
  },
  {
    "专利名": "一种新能源工程车辆用BMS控制器",
    "申请号": "CN202323059915.3",
    "公开日": "20240614",
    "IPC 分类号": "H05K5/02;H05K5/03",
    "申请人": "乐圆技术有限公司",
    "关键词": "新能源工程车辆、BMS控制器、低压通讯连接器、DCDC、BMS控制板、模块化设计、金属壳体封装",
    "摘要": "本实用新型提供了一种新能源工程车辆用BMS控制器，属于新能源技术领域，该新能源工程车辆用BMS控制器包括箱体及与所述箱体配套的盖体，其中，所述箱体内部包括低压通讯连接器、DCDC、BMS控制板、隔板，所述盖体设置于所述箱体顶部，所述低压通讯连接器设置在所述箱体的左右侧壁，所述DCDC固定在所述隔板上，所述隔板左右两侧打孔，用于进行线束固定，所述盖体设置有绑线装置，所述绑线装置用于车辆线束的布置、安装；其中，所述盖体四周还设置有螺丝孔，用于通过螺丝钉将所述盖体固定到所述箱体；控制箱中的BMS采用模块化设计，并采用金属壳体封装，能够提高安全性、可维护性，信号干扰现象减少。",
    "说明书": "一种新能源工程车辆用BMS控制器技术领域本实用新型属于新能源技术领域，具体而言，涉及一种新能源工程车辆用BMS控制器。背景技术新能源工程车辆是一种用于各种工程建设项目，例如道路建设、桥梁建设、土方工程等。其动力源主要由电池供电，这些电池通常是锂离子电池。这些卡车使用电力代替传统的内燃机动力，具有环保、能源效率高和降低操作成本等优点。BMS是电池管理系统(Battery Management System)的缩写。BMS控制盒是电动车辆或电池系统中的一个关键组件，旨在监控、管理和保护电池组的性能和安全。其主要功能包括电池单体的电压平衡、温度监测、状态估计、充电和放电控制，以及故障检测和安全保护。高压电池内部的电压非常高，因此在维护和维修时存在潜在的危险。操作员需要采取额外的安全措施，以确保他们不会受到电击伤害。由于BMS位于高压盒内部，维护或更换BMS组件通常需要关闭整个电池系统，这会导致停机时间和生产损失。此外，因为BMS通常密封在高压盒内，它们不易检查和维修。高压电池内部可能存在电磁干扰，这会对BMS传感器和通信线路产生不利影响。信号干扰可能导致BMS无法准确监测电池状态，从而增加电池故障的风险。高压电池内部的温度通常较高，这可能对BMS的运行稳定性产生负面影响。实用新型内容有鉴于此，本实用新型提供一种新能源工程车辆用BMS控制器，能够提高BMS的运行稳定性。本实用新型是这样实现的：本实用新型提供一种新能源工程车辆用BMS控制器，包括箱体及与所述箱体配套的盖体，其中，所述箱体内部包括低压通讯连接器、DCDC、BMS控制板、隔板，所述盖体设置于所述箱体顶部，所述低压通讯连接器设置在所述箱体的左右侧壁，所述DCDC固定在所述隔板上，所述隔板左右两侧打孔，用于进行线束固定，所述盖体设置有绑线装置，所述绑线装置用于车辆线束的布置、安装；其中，所述盖体四周还设置有螺丝孔，用于通过螺丝钉将所述盖体固定到所述箱体。低压通讯连接器采用安费诺品牌产品，增强信号传输可靠性；内部使用军品级DCDC转换器，可以把24V电转成12V电，可以使用多种不同品牌型号的BMS，具有可替换性。采用的4个连接器的功能及型号为：1、整车通讯：HC08B-P32R；2、高压盒通讯：HC08A-P32R；3、调试诊断：AT04-12PB-PM05；4、电池箱通讯：AT04-12PA-PM05，其中，同侧的两个连接器插件，颜色、键位不同，避免错接。BMS控制箱有明显的优越性：安全、可维护性提高，信号干扰现象减少。在上述技术方案的基础上，本实用新型的一种新能源工程车辆用BMS控制器还可以做如下改进:其中，所述低压通讯连接器包括与整车通讯低压连接器、与高压盒通讯低压连接器、调试用低压连接器、与电池箱通讯低压连接器，所述与整车通讯低压连接器、所述与高压盒通讯低压连接器相邻位于所述箱体左侧壁，所述调试用低压连接器、所述与电池箱通讯低压连接器相邻位于所述箱体右侧壁。进一步的，所述隔板连接所述箱体的前后侧壁。采用上述改进方案的有益效果为：盒内DCDC固定在隔板上。隔板左右两侧打孔，方便线束固定，减轻车辆行驶中线束的震动现象，保证连接器连接牢固、通信可靠，为新能源车辆的正常行驶做好保证。进一步的，所述BMS控制板设置于所述隔板下方，连接所述箱体底壁。进一步的，所述BMS控制板与所述隔板不相连。采用上述改进方案的有益效果为：隔板下方留有充足的空间，满足BMS通信线束布置要求。进一步的，所述绑线装置为多个。采用上述改进方案的有益效果为：BMS盒盖设计考虑到在工程车辆上的实际安装布局，设计有绑线装置，方便车辆其他部件线束的布置、安装，有利于整车线束布置。进一步的，所述绑线装置根据线束布线位置进行分布。进一步的，所述箱体为矩形。进一步的，所述箱体采用碳钢材质。采用上述改进方案的有益效果为：箱体采用碳钢材质，强度大、重量轻、材质环保、占用空间小、固定方便、防护等级IP68满足防护要求。进一步的，所述盖体顶部设置有铭牌。采用上述改进方案的有益效果为：铭牌可以包含有关产品、设备或系统的重要信息，例如制造商名称、型号号码、序列号、生产日期和安全指南。这有助于用户或维护人员迅速识别和识别设备，以便进行维护、故障排除或其他操作。与现有技术相比较，本实用新型提供的一种新能源工程车辆用BMS控制器的有益效果是：1：电池维护安全性增加：将BMS放置在独立的控制箱内意味着维护人员可以访问BMS系统而不需要打开高压电池盒，从而减少了直接与高压电池接触的机会，这有助于降低电击和其他电池相关风险的潜在威胁；2：独立控制箱可以提供物理隔离，防止电池系统的电压和电流泄漏到周围环境，这种隔离有助于确保BMS在各种环境条件下稳定运行，同时保护维护人员免受潜在的危险；3：在独立的控制箱内，BMS的组件更容易访问和更换，而不需要干预高压电池本身，这简化了维护工作，减少了维护所需的时间和劳动力；4：控制箱中的BMS采用模块化设计，这意味着单独的组件可以更容易地更换，而无需替换整个系统，这降低了维护成本，延长了设备寿命；5：独立的BMS控制箱可以更容易适应不同类型和规格的电池组，这提供了更大的灵活性，使车辆制造商能够选择不同电池供应商或适应特定应用需求。"
  },
  {
    "专利名": "一种新能源工程车辆用高压配电盒",
    "申请号": "CN202323060028.8",
    "公开日": "20240604",
    "IPC 分类号": "B60L3/00;H02B1/46;H02B1/24;H02J7/00;H02B1/20",
    "申请人": "乐圆技术有限公司",
    "关键词": "高压配电盒、壳体设计、高压连接器、MSD、低压连接器、电气件布局、电路复杂性、能源效率、环境影响、电动汽车控制、新能源工程车辆、高压配电技术",
    "摘要": "本实用新型提供了一种新能源工程车辆用高压配电盒，属于高压配电技术领域，包括壳体，壳体顶部设置有铭牌，壳体外壁设置有高压连接器、MSD、低压连接器，以铭牌的阅读方向为壳体的前面，高压连接器设置在壳体前面以及后面，MSD设置于壳体的左面，低压连接器设置于壳体前面，高压连接器包括加热连接器、TMS、壳体后面高压连接器，加热连接器、TMS、低压连接器相邻位于壳体前面；高压连接器有明确、清晰的永久性文字标识区分类别，且同类别的高压连接器正极与负极使用颜色进行区分；通过采用集中式电气件布局，降低了电路的复杂性，提高能源效率、安全性、可维护性，降低环境影响，以及提供更智能的电动汽车控制。",
    "说明书": "一种新能源工程车辆用高压配电盒技术领域本实用新型属于高压配电技术领域，具体而言，涉及一种新能源工程车辆用高压配电盒。背景技术工程车辆一般用于各种工程建设项目，例如道路建设、桥梁建设、土方工程等。这些卡车通常用于采矿和重型物料运输工作，因此其电气系统需要能够应对高电压和高功率的要求。新能源配电箱则是一种用于电动或混合动力的配电设备，以适应环保和能源效率的需求。传统工程车辆高压配电箱通常采用分散式布局，电气件分散在各个位置，导致电路复杂性高，维护困难。由于电气件分散，一旦出现故障，需要更多的时间和精力来诊断和修复问题，降低了设备的可靠性和维护效率。分散布局可能导致空间浪费，使得设备较大而笨重，不利于车辆的紧凑设计。公告号为CN211829725U的中国实用新型专利：一种新能源汽车高压配电箱(申请号为：CN201922119929.7)，包括高压配电箱(1)、进电口(2)、出电口(3)、散热孔(4)，其特征在于：所述高压配电箱(1)一侧安装有进电口(2)，所述出电口(3)嵌固于高压配电箱(1)一侧且位于进电口(2)下方，所述散热孔(4)配合安装于高压配电箱(1)与出电口(3)同一侧。上述的一种新能源汽车高压配电箱没有体现额定电流等具体参数，不能保证设备的可靠性。实用新型内容有鉴于此，本实用新型提供一种新能源工程车辆用高压配电盒，能够提供工程车辆行驶与使用中需要的能量功率参数与额定电流参数要求。本实用新型是这样实现的：本实用新型提供一种新能源工程车辆用高压配电盒，包括壳体，其中，所述壳体顶部设置有铭牌，所述壳体外壁设置有高压连接器、MSD、低压连接器，其中，所述高压连接器设置在所述壳体前面以及后面，所述MSD设置于所述壳体的左面，所述低压连接器设置于所述壳体前面，所述高压连接器包括加热连接器、TMS、壳体后面高压连接器，所述加热连接器、所述TMS、所述低压连接器相邻位于所述壳体前面。高压新能源配电箱可以实现的放电额定电流最大900A，同时，能够实现的功能为：通过CAN总线与电池管理系统(BMS)进行通讯，与BMS一起实现对12个电池包的充电与放电。也可以独立实现对最大额定放电电流达900A的工程机械车辆的配电控制如：3路加热(额定功率10kW)供电、水冷机组供电、2路电机控制器(额定功率500kW、峰值功率800kW)供电、2路快充充电。可以实现对13个继电器进行控制及其粘连检测、各个高压连接器的互锁控制。具有IP67的防护等级、占地面积小的优点。各高压连接器内部使用铜排方向或者键位进行区别，避免接错，保证安全性。在上述技术方案的基础上，本实用新型的一种新能源工程车辆用高压配电盒还可以做如下改进:其中，所述高压连接器在所述壳体正面包括放电端高压连接器、加热连接器、TMS，所述加热连接器、所述TMS、所述低压连接器相邻位于所述壳体前面，所述放电端高压连接器位于所述加热连接器、所述TMS、所述低压连接器两侧；其中，同类别的所述高压连接器(20)正极与负极使用颜色进行区分。采用上述改进方案的有益效果为：手维护开关位于壳体左面，方便操作人员轻松访问并进行维护操作。这有助于提高设备的可维护性和操作性。进一步的，所述加热连接器为3个，分别用于连接系统的3条并联电池箱支路，3个所述加热连接器相邻位于所述TMS和所述低压连接器之间。进一步的，所述低压连接器左侧的所述放电端高压连接器为放电正极高压连接器，所述TMS右侧的所述放电端高压连接器为放电负极高压连接器。采用上述改进方案的有益效果为：通过将正极和负极连接器分别分布在MSD两侧可以简化整体电气布线。这样的布局减少了电缆交叉和混乱，使系统更加有序。将连接器分布在MSD两侧使得维护过程更为方便。维修人员可以更容易地定位和处理连接问题，减少了维护时间。将连接器两侧分布有助于减少电路干扰，提高系统的稳定性和可靠性。进一步的，所述放电端高压连接器为4个，包括2个正极高压连接器和2个负极高压连接器。采用上述改进方案的有益效果为：通过使用铜排方向或键位进行区别可以防止误连接，确保正极和负极连接器正确地匹配。这有助于避免极性混淆，减少设备损坏的风险。区分正极和负极连接器的设计使得维护过程更加简化。维修人员可以更容易地识别和更换有问题的连接器，提高了维护效率。进一步的，所述MSD为3个，分别连接系统的3条并联电池箱支路进入高压配电箱的正极铜排，3个所述MSD相邻。采用上述改进方案的有益效果为：3个相邻的手维护开关允许同时或快速切换多个功能或模式。这对于需要频繁进行不同操作的情况非常有用，操作人员可以一目了然地找到所需的开关。这些相邻的手维护开关可以用于控制不同的功能或子系统。这种多功能性使操作人员能够在一个位置轻松地管理多个方面的设备或系统。进一步的，所述壳体后面高压连接器包括电池端高压连接器以及充电端高压连接器。采用上述改进方案的有益效果为：具有电池端高压连接器和充电端高压连接器的连接器设计使电池更容易安装和更换。这可以减少停机时间，提高设备的可用性。进一步的，所述电池端高压连接器为6个，包括3个正极电池端高压连接器和3个负极电池端高压连接器。采用上述改进方案的有益效果为：3个正极和3个负极电池端高压连接器的设计有助于平衡电流分配，确保每个电池得到相等的充电和放电。这有助于延长电池组的寿命并提高性能。具有多个电池端高压连接器意味着如果某个电池端高压连接器出现故障，其他电池端高压连接器仍然可以继续工作，从而可以使车辆低速行驶到维修场所，进行维修。进一步的，所述充电端高压连接器为4个，包括2个正极充电端高压连接器和2个负极充电端高压连接器，分别连接系统的2个快充充电支路的正极与负极，2个所述正极充电端高压连接器相邻位于相邻的2个所述负极充电端高压连接器右侧。采用上述改进方案的有益效果为：将正极充电端高压连接器和负极充电端高压连接器相邻放置有助于简化充电电路设计。这可以减少电路布线的复杂性，提高充电效率。相邻放置充电端高压连接器有助于减少电路干扰，提高系统的稳定性和可靠性。进一步的，所述电池端高压连接器对称位于所述充电端高压连接器两侧，3个所述电池端高压连接器的负极电池端高压连接器位于所述充电端高压连接器的负极充电端高压连接器左侧，3个所述电池端高压连接器的正极电池端高压连接器位于所述充电端高压连接器的正极充电端高压连接器右侧。采用上述改进方案的有益效果为：这种对称布局有助于保持电路的清晰度。正极和负极电池端高压连接器与正极和负极充电端高压连接器对应，减少了连接混乱的可能性。对称布局使得维护人员更容易定位和处理电池端高压连接器和充电端高压连接器的问题，提高了维护效率。与现有技术相比较，本实用新型提供的一种新能源工程车辆用高压配电盒的有益效果是：1：集中布局：新能源配电箱采用集中式电气件布局，将控制器、电池管理系统(BMS)和电气元件放置在一个相对集中的位置；这降低了电路的复杂性，使得维护和维修更加容易；2：电气冗余性：新能源配电箱通常包括电气冗余性，即备用电路和元件；这种冗余性可以在主要电气元件出现故障时自动切换到备用系统，从而确保车辆的可靠性和安全性；3：充电和能源管理：配电箱还包括充电控制器，它能够管理电池的充电过程；这使得充电过程更加高效、安全，并且可以支持多种类型的满足国标充电协议，GBT 27930-2015兼容GBT 27930-2011的充电设备；此外，能源管理系统可以监测车辆的能源使用情况，优化能源流向，最大化能源的利用；4：安全性提升：配电箱的集中排布和电气冗余性增强了电气系统的安全性；它们通常配备了多重安全装置，包括过载保护、短路保护和电气隔离，以减少电气事故的风险。"
  },
  {
    "专利名": "一种新能源工程车锂电池组用散热装置",
    "申请号": "CN202322735279.5",
    "公开日": "20240517",
    "IPC 分类号": "H01M10/613;H01M10/6561;H01M10/625;H01M10/653;H01M10/6556;H01M10/6567;H01M10/6554",
    "申请人": "上海特储新能源科技有限公司",
    "关键词": "新能源工程车、锂电池组、散热装置、驱动风扇、电机、螺纹丝杆、滑块、挡板、新能源汽车技术",
    "摘要": "本实用新型涉及新能源汽车技术领域，公开了一种新能源工程车锂电池组用散热装置，包括箱体，所述箱体一侧壁固定连接有两个固定块，两个所述固定块一端面均固定连接有驱动风扇，所述箱体一侧底端固定连接有电机，所述电机的输出端连接有主动轮，所述主动轮通过皮带传动连接有从动轮，所述主动轮与从动轮均连接有螺纹丝杆，两个所述螺纹丝杆外壁均滑动套设有滑块，两个所述滑块之间固定连接有挡板。本实用新型中，能够有效的对电池组产生的热量进行散热，能够便于工作人员对电池进行拆卸更新替换，该一种新能源工程车锂电池组用散热装置在投入使用时能够有效对电池组进行减少直接的碰撞，延长使用寿命。",
    "说明书": "一种新能源工程车锂电池组用散热装置技术领域本实用新型涉及新能源汽车技术领域，尤其涉及一种新能源工程车锂电池组用散热装置。背景技术目前的新能源工程车在使用过程中对电力需求较大，电池组在运行时负载较大，电池组的发热量较高，且汽车在行驶时因为路况原因有一定的颠簸，这会加剧电池组的发热，当电池组的发热速率高与散热速率时电池组的温度会持续升高，最终会导致电池组损坏，针对目前的电池组使用过程中所暴露的问题。实用新型内容本实用新型的目的是为了解决现有技术中存在的缺点，而提出的一种新能源工程车锂电池组用散热装置，该一种新能源工程车锂电池组用散热装置在投入使用时，能够有效的对电池组产生的热量进行散热，该一种新能源工程车锂电池组用散热装置在投入使用时，能够便于工作人员对电池进行拆卸更新替换，该一种新能源工程车锂电池组用散热装置在投入使用时能够有效对电池组进行减少直接的碰撞，延长使用寿命。为实现上述目的，本实用新型提供了如下技术方案：一种新能源工程车锂电池组用散热装置，包括箱体，所述箱体一侧壁固定连接有两个固定块，两个所述固定块一端面均固定连接有驱动风扇；所述箱体一侧底端固定连接有电机，所述电机的输出端连接有主动轮，所述主动轮通过皮带传动连接有从动轮，所述主动轮与从动轮均连接有螺纹丝杆，两个所述螺纹丝杆外壁均滑动套设有滑块，两个所述滑块之间固定连接有挡板；通过上述技术方案，通过驱动风扇，起到了对箱体内部热量进行有效散热，通过主动轮带动从动轮，带动挡板上下移动，起到了带动挡板上下移动的作用。进一步地，所述箱体通过铰链铰接有箱盖，所述箱盖下端面开设有多个凹槽；通过上述技术方案，通过铰链铰接有箱盖，起到防止灰尘进入箱体内部的作用。进一步地，所述挡板上端面开设有多个凹型槽，多个所述凹型槽均分别与多个凹槽相配合；通过上述技术方案，通过凹型槽均分别与多个凹槽相配合，起到了固定箱体内部的电池的作用。进一步地，所述箱盖上端面靠中间固定连接有把手；通过上述技术方案，通过设置有把手，起到了打开箱盖的作用。进一步地，所述箱体外壁开设有多个透气孔，多个所述透气孔内部均固定连接有过滤网；通过上述技术方案，通过开设有多个透气孔，起到了透气散热的作用，通过设置过滤网，起到了防止灰尘杂质进入箱体内。进一步地，所述箱体的一侧壁开设有两个卡扣槽；通过上述技术方案，箱体的一侧壁开设有两个卡扣槽，起到了固定箱盖的作用。进一步地，所述箱盖一侧面开设有两个卡扣；通过上述技术方案，通过箱盖一侧面开设有两个卡扣，起到了与卡扣槽相配合的作用，起到了固定箱盖的作用。进一步地，所述箱体两侧壁均固定开设有把手槽；通过上述技术方案，通过箱体两侧壁均固定开设有把手槽，起到了提起整个箱体的作用。本实用新型具有如下有益效果：1、本实用新型提出的一种新能源工程车锂电池组用散热装置，相比现有的一种新能源工程车锂电池组用散热装置，该一种新能源工程车锂电池组用散热装置在投入使用时，通过对箱体内部设置有多个凹槽，可对电池进行有效的减震，避免在颠簸时电池内外箱内部晃动，对电池和外箱造成损坏，同时可将顶盖方便打开清洗，防止大量灰尘堆积，影响外箱的散热，并加速外箱内部与外界空气的流通，延长电池的使用寿命，从而提高了该散热装备的使用寿命和实用性。2、本实用新型提出的一种新能源工程车锂电池组用散热装置，相比现有的一种新能源工程车锂电池组用散热装置，该一种新能源工程车锂电池组用散热装置在投入使用时，通过设置有风扇。3、本实用新型提出的一种新能源工程车锂电池组用散热装置，相比现有的一种新能源工程车锂电池组用散热装置，该一种新能源工程车锂电池组用散热装置在投入使用时，通过防尘网和通孔之间的配合，使空气在进入外箱内部时，将空气中携带的尘埃阻挡，防止尘埃堆积在内部，使外箱内部的空气不能流通，降低电池的使用寿命，以确保空气流通，提高了该防护箱的实用性。"
  },
  {
    "专利名": "一种新能源工程车用降噪式稀土永磁电机",
    "申请号": "CN202223408791.0",
    "公开日": "20230613",
    "IPC 分类号": "H02K9/06;H02K5/20;H02K5/24;H02K5/18;H02K5/16",
    "申请人": "无锡华盛力通电驱动系统有限公司",
    "关键词": "降噪式稀土永磁电机、电机外壳、头端盖、尾端盖、风机罩、固定支座、密封圈、封闭空间、阻抗复合式消声器、新能源工程车",
    "摘要": "本实用新型公开了一种新能源工程车用降噪式稀土永磁电机，包括电机外壳、头端盖、尾端盖、风机罩和固定支座，所述头端盖通过螺丝安装于电机外壳一端，所述尾端盖和风机罩均通过螺丝安装于电机外壳另一端，所述风机罩罩于尾端盖外侧，所述头端盖与电机外壳之间设置有第一密封圈，所述尾端盖与电机外壳之间设置有第二密封圈。本实用新型通过设置第一密封圈、第二密封圈、第三密封圈和第四密封圈来构筑封闭空间，电机内部的噪音和散热风机产生的噪音都被隔绝在封闭空间内，同时电机内部的热量能够正常传递到电机外壳表面，并通过散热翅片来扩大散热面积，提高了电机的散热效率，噪音随气流穿过阻抗复合式消声器时逐渐衰减，从而达到消声降噪目的。",
    "说明书": "一种新能源工程车用降噪式稀土永磁电机技术领域本实用新型涉及永磁电机技术领域，具体涉及一种新能源工程车用降噪式稀土永磁电机。背景技术永磁同步电机主要由定子、转子和端盖等部件构成，定子由叠片叠压而成以减少电动机运行时产生的铁耗，其中装有三相交流绕组，称作电枢。转子可以制成实心的形式，也可以由叠片压制而成，其上装有永磁体材料。根据电机转子上永磁材料所处位置的不同，永磁同步电机可以分为突出式与内置式两种结构形式。现有的永磁电机在使用时，其上往往设置有降噪装置，但降噪效果却不够全面，且容易阻碍电机的正常散热。例如申请号为CN202023305081.6公开的一种降噪式永磁性电机，该专利通过设置第一机壳和第二机壳与机座密封连接，其两侧的连接部分又通过密封条进行密封处理，从而使得其内部形成的腔体为真空状态，可对永磁电机内部的工作状态起到良好的隔音效果，而其内部的隔音棉可直接对其产生的噪音进行减震隔绝，双层的隔音结构相互配合，极大的提高了永磁性电机的隔音效果。该专利降噪效果不够全面，且不利于电机正常散热，该专利的散热箱上未设置相应的降噪装置来辅助降噪，风扇工作时，扇叶快速旋转并吹出高速气流，同时伴随着强烈的噪音，隔音棉不仅能够吸音降噪，还具有隔热保温的功能，隔音棉设置电机内部会阻碍电机正常散热。因此，发明一种新能源工程车用降噪式稀土永磁电机来解决上述问题很有必要。实用新型内容本实用新型的目的是提供一种新能源工程车用降噪式稀土永磁电机，以解决技术中现有的永磁电机在使用时，其上往往设置有降噪装置，但降噪效果却不够全面，且容易阻碍电机的正常散热的问题。为了实现上述目的，本实用新型提供如下技术方案：一种新能源工程车用降噪式稀土永磁电机，包括电机外壳、头端盖、尾端盖、风机罩和固定支座，所述头端盖通过螺丝安装于电机外壳一端，所述尾端盖和风机罩均通过螺丝安装于电机外壳另一端，所述风机罩罩于尾端盖外侧，所述头端盖与电机外壳之间设置有第一密封圈，所述尾端盖与电机外壳之间设置有第二密封圈，所述风机罩与电机外壳之间设置有第三密封圈，所述风机罩远离电机外壳的一端通过螺丝安装有阻抗复合式消声器，所述阻抗复合式消声器一端延伸至风机罩内部，所述阻抗复合式消声器与风机罩之间设置有第四密封圈，所述电机外壳固定连接于固定支座顶部，所述固定支座底部固定连接有防滑减震垫。优选的，所述第一密封圈、第二密封圈、第三密封圈、第四密封圈和防滑减震垫均由橡胶材料制成，固定支座底部设置的防滑减震垫可以防止电机因震动而与地面发生摩擦，有利于进一步扼制噪音的产生。所述电机外壳内部设有定子、转子和转轴，所述定子安装于电机外壳内壁，所述转子套于定子内部，定子上缠绕的线圈通电后产生磁场，转子在磁场作用下进行旋转并带动转轴进行转动。所述转轴固定连接于转子中部，所述转轴贯穿转子设置，所述转轴一端延伸至头端盖外侧，所述转轴另一端延伸至尾端盖外侧。所述头端盖内部安装有第一轴承，所述尾端盖中部安装有第二轴承。所述转轴一端与第一轴承转动连接，所述转轴另一端与第二轴承转动连接，通过第一轴承和第二轴承对转轴两端进行承载。所述风机罩内部设有散热风机，所述转轴延伸至尾端盖外侧的一端与散热风机传动连接，转轴转动的同时带动散热风机进行工作。所述电机外壳表面固定连接有散热翅片，所述散热翅片数量设为多个，多个所述散热翅片均匀分布，通过散热翅片来扩大散热面积，有利于提高电机的散热效率。在上述技术方案中，本实用新型提供的技术效果和优点：通过第一密封圈和第二密封圈将头端盖和尾端盖与电机外壳构成封闭空间A，电机内部的噪音大多被隔绝在封闭空间A内，同时电机内部的热量能够正常传递到电机外壳表面，并通过散热翅片来扩大散热面积，有利于提高电机的散热效率；通过第三密封圈和第四密封圈将电机外壳和阻抗复合式消声器与风机罩构成封闭空间B，散热风机产生的噪音被隔绝在封闭空间B内，同时噪音随气流穿过阻抗复合式消声器时逐渐衰减，从而达到消声降噪目的；固定支座底部设置有防滑减震垫，可以防止电机因震动而与地面发生摩擦，有利于进一步扼制噪音的产生。"
  },
  {
    "专利名": "拖拉机用换电底托以及换电总成",
    "申请号": "CN202223314459.8",
    "公开日": "20230512",
    "IPC 分类号": "B60L53/80;B60K1/04",
    "申请人": "上海玖行能源科技有限公司",
    "关键词": "换电底托、换电总成、主托架、侧托架、支撑台、导向锁止部件、框架安装、电池重心、操控性能、新能源工程车辆",
    "摘要": "本实用新型公开了一种拖拉机用换电底托以及换电总成，属于新能源工程车辆技术领域，拖拉机用换电底托包括主托架、侧托架、支撑台和导向锁止部件；所述主托架形成矩形承托板架；所述主托架的两侧对称设置所述侧托架，所述侧托架形成位于主托架两侧的承托板架；所述主托架与所述侧托架形成凸形支撑台构造；所述导向锁止部件安装于所述主托架和/或侧托架。本申请所述换电底托，不仅可实现换电的基本功能，且可保证框架安装于电动拖拉机之上的稳定性，便于定位安装，框架电池的整体重心被放低，提高电动拖拉机的操控性能。",
    "说明书": "拖拉机用换电底托以及换电总成技术领域本实用新型属于电动工程车辆技术领域，尤其涉及一种拖拉机用换电底托以及换电总成。背景技术随着蓄电池技术的不断发展与成熟、能源问题的日益严峻，蓄电池作为能源载体越来越广泛的应用于各个领域的自动化设备之中。目前，传统汽车逐渐被新能源汽车所代替，随之而来的，伴随相关技术的不断成熟，一些种类的工程车辆也开始出现新能源车型。工程车辆的工作环境一般是批量工作于一定范围的工程场地中，所以换电式的蓄电池更加适用于工程车辆。换电型卡车已经展现出了其优势。拖拉机作为一种工程车辆，目前还是多装配柴油机动力总成，以蓄电池和电机作为动力总成的电动拖拉机已经出现，并势必取代现有传统拖拉机。但是，目前电动拖拉机的电池构造均是固定装配于拖拉机的架体，所以，有必要设计一种适用于拖拉机专用框架电池的换电底托部件以及适用于拖拉机的换电总成。实用新型内容针对现有技术存在的问题，本实用新型提供了一种解决目前无电动拖拉机可用的换电用电池单元组件的问题的拖拉机用换电底托以及换电总成。本实用新型是这样实现的，一种拖拉机用换电底托，其特征在于，包括主托架、侧托架、支撑台和导向锁止部件；所述主托架形成矩形承托板架；所述主托架的两侧对称设置所述侧托架，所述侧托架形成位于主托架两侧的承托板架；所述主托架与所述侧托架形成凸形支撑台构造；所述导向锁止部件安装于所述主托架和/或侧托架。在上述技术方案中，优选的，所述主托架的长边两侧连接竖直向下延伸的竖架，所述侧托架连接于所述竖架。在上述技术方案中，优选的，所述主托架的侧边与所述侧托架的侧边的竖向投影形成四个阴角，在所述换电底托的阴角处设置四个角锁止组件，所述角锁止组件包括两所述导向锁止部件；同一角锁止组件中的两所述导向锁止部件上端设有分别指向主托架和侧托架的导向楔形面；同一角锁止组件中的两所述导向锁止部件上端设有分别指向主托架和托架侧的锁止销。角锁止组件的形成外侧双向四角式止锁构造，可进一步提高电动拖拉机专用框架电池安装的稳定性。拖拉机长期工作于颠簸振动的环境下，这种装卡固定方式，对框架电池安装的稳定性的作用是显著的。在上述技术方案中，优选的，所述主托架、侧托架和竖架焊接。在上述技术方案中，优选的，所述主托架安装二级导向柱，所述二级导向柱的轴线竖向且顶端呈锥形构造。本实用新型申请的优点和效果是：本申请技术方案中所提出的换电底托，主托架与侧托架形成凸形支撑台，这种特殊的底托结构设计，令其可以搭载“驮包”状的框架电池，与拖拉机的架梁结构特性相匹配，令“驮包”状的框架电池可稳定搭载于架梁，不仅可实现换电的基本功能，且可保证框架安装于电动拖拉机之上的稳定性，便于定位安装，框架电池的整体重心被放低，提高电动拖拉机的操控性能。本实用新型的另一目的，提出一种拖拉机的换电总成，包括架梁，其特征在于，所述架梁安装上述换电底托，所述换电底托安装框架电池。在上述技术方案中，优选的，所述架梁包括两条相互平行的主梁体、柱座体和与主梁体连接且向上斜向延伸的斜梁体，所述换电底托的主托架支撑连接所述柱座体，所述换电底托的侧托架支撑连接所述斜梁体。在上述技术方案中，优选的，所述框架电池包括电池框架和安装于电池框架的电池包，所述电池框架包括中间框架，侧框架和卡槽；所述中间框架形成矩形框架构造，所述中间框架安装若干所述电池包；所述中间框架的两侧对称设置所述侧框架，所述侧框架形成框架构造，所述侧框架安装所述电池包；所述卡槽由所述中间框架的下部与两所述侧框架的内侧部围构形成，所述卡槽是与所述凸形的支撑台适配的凹形结构。在上述技术方案中，优选的，所述中间框架的左右侧面与所述侧框架的前后端面形成位于所述电池框架四角处的阴角直角构造，所述角锁止组件分别卡装于所述阴角直角构造。在上述技术方案中，优选的，所述中间框架的底部设有与所述二级导向柱位置对应的轴线竖向的导向孔。"
  },
  {
    "专利名": "一种可电流分配的车载充电高压柜装置及其应用",
    "申请号": "CN202211309765.4",
    "公开日": "20221122",
    "IPC 分类号": "B60L3/00;B60L53/14;B60L58/12",
    "申请人": "苏州亚太精睿传动科技股份有限公司",
    "关键词": "电流分配、车载充电高压柜、直流模块、采集模块、DC/DC模块、控制模块、动作模块、整车控制系统、新能源汽车、高压交流电、高压直流电、低压直流电",
    "摘要": "本发明提供了一种可电流分配的车载充电高压柜装置及其应用，属于新能源汽车技术领域。直流模块将高压交流电转化为高压直流电输入DC/DC模块和电机系统；采集模块采集直流模块输出的电流和温度；DC/DC模块将高压直流电转化为低压直流电；控制模块分析采集模块输入的信号，并根据整车控制系统信号进行功能判断，并输出控制信号给动作模块和DC/DC模块；动作模块接收控制模块的信号，进行电流路径切换，以实现整车控制系统信号需要的功能。本发明能够实现自主电流分配，将本发明的装置集成在大型新能源工程车辆中，可长时间使用，降低车辆对固定式充电桩的需求，提升使用效率，达到在一定范围内连续作业的需求。",
    "说明书": "一种可电流分配的车载充电高压柜装置及其应用技术领域本发明涉及新能源汽车技术领域，尤其涉及一种可电流分配的车载充电高压柜装置以及应用。背景技术随着碳排放压力的不断增加，新能源产业链的发展不断完善，技术不断迭代更新，纯电动车辆以其环保、低噪音、经济、易保养等优点逐步提高市场化占有率的份额。不仅在乘用车领域纯电方案日趋成熟，工程机械车辆也开始由传统燃油车向纯电动或者油电混合方向深入发展。在新能源汽车的普及同时，也让新能源汽车的缺点逐渐暴露出来。新能源汽车目前普遍采用的充电装置（充电桩）固定在指定地点，地点可以是车库或者是类似加油站功能的充电站或其他人为指定地点。受限于电池技术的发展，以动力电池作为动力源的纯电动车辆或者插电式混动车辆动力电池电量低于某值时，电池系统会向整车上报相应故障代码用以提示此时需将车辆开往指定充电地点进行电池系统充电。车辆在往返于工作地点和充电地点所消耗的能源和时间将提高项目的生产成本。在考虑连续作业前提下，现有主流的固定式充电桩技术，其分布位置、充电时间、往返充电路程，成为纯电或插电式车辆普及的掣肘。尤其对于区域性工作车辆，充电基础设施的建设、充电时间、再次投入效率都加大了车主的使用成本，成为使用瓶颈。现有技术存在如下不足：1.以动力电池作为动力源的纯电动车辆或者插电式混动车辆动力电池电量低于某值时，需要前往固定式充电桩进行充电，浪费时间，消耗能源。发明内容为解决现有技术中存在的技术问题，本发明提供了一种可电流分配的车载充电高压柜装置，包括所述可电流分配的车载充电高压柜装置的输入端具有与市电连接的接口，输出与低压电源系统、电机系统和车辆内置高压电池连接；包括：直流模块、DC/DC模块、采集模块、动作模块和控制模块；直流模块与DC/DC模块连接，DC/DC模块与动作模块和控制模块连接，动作模块和采集模块均与控制模块连接；控制模块与整车控制系统连接；直流模块将高压交流电转化为高压直流电输入DC/DC模块和电机系统；DC/DC模块将高压直流电转化为低压直流电；采集模块采集直流模块输出的直流电的电流和温度数据；控制模块接收整车控制系统信号后，分析采集模块输入的信号，根据整车控制系统信号进行功能判断，并输出控制信号给动作模块和DC/DC模块；动作模块接收控制模块的信号，进行电流路径切换，以实现整车控制系统信号需要的功能。本发明能够实现自主电流分配，将本发明的装置集成在大型新能源工程车辆中，可长时间使用，降低车辆对固定式充电桩的需求，提升使用效率，达到在一定范围内连续作业的需求。本发明提供了一种可电流分配的车载充电高压柜装置，所述可电流分配的车载充电高压柜装置的输入端具有与市电连接的接口，输出与低压电源系统、电机系统和车辆内置高压电池连接；包括：直流模块、DC/DC模块、采集模块、动作模块和控制模块；直流模块与DC/DC模块连接，DC/DC模块与动作模块和控制模块连接，动作模块和采集模块均与控制模块连接；控制模块与整车控制系统连接；直流模块将高压交流电转化为高压直流电输入DC/DC模块和电机系统；采集模块采集直流模块输出的直流电的电流和温度数据；DC/DC模块将高压直流电转化为低压直流电；控制模块接收整车控制系统信号后，分析采集模块输入的信号，根据整车控制系统信号进行功能判断，并输出控制信号给动作模块和DC/DC模块；动作模块接收控制模块的信号，进行电流路径切换，以实现整车控制系统信号需要的功能。优选地，还包括输入接口模块和输出接口模块，输入接口模块具有与市电连接的接口；输出接口模块与低压电源系统、电机系统和车辆内置高压电池连接。优选地，输入接口模块与DC/DC模块、直流模块和控制模块分别连接；输出接口模块与动作模块连接。优选地，车辆内置高压电池接口与输出接口模块为输入输出双向连接，电机系统接口与输出接口模块为输入输出双向连接。优选地，动作模块包括六个继电器，分别为第一继电器、第二继电器、第三继电器、第四继电器、第五继电器和第六继电器；通过各继电器的通断，进行电流路径切换；第一继电器连接直流模块的输出端和DC/DC模块的输入端；第二继电器连接直流模块的输出端和车辆内置高压电池接口；第三继电器连接DC/DC模块输入的直流电与车辆内置高压电池接口；第四继电器连接车辆内置高压电池接口与电机系统接口；第五继电器与预充电阻串联后，与第四个继电器并联；第六继电器连接从直流模块输出的直流电与电机系统接口。优选地，采集模块包括2个双向电流传感器，分别为第一电流传感器和第二电流传感器，分别采集经直流模块转化输出的直流电的正负极电流；以及2个温度传感器，分别为第一温度传感器和第二温度传感器，分别采集经直流模块转化输出的直流电的正负极的温度。优选地，控制模块包括主控板，主控板执行如下操作：输出采集电流传感器和温度传感器信号给采集模块；输出各继电器的通断信号给动作模块；接收整车控制系统信号并反馈信号给整车控制系统；向直流模块发送控制直流模块启动及停止的信号；与直流模块和DC/DC模块进行CAN通讯交流。优选地，控制模块接收整车控制系统是否需要高压上电的信号并反馈可电流分配的车载充电高压柜装置故障信号及环境信号给整车控制系统。优选地，控制模块判断当前运行工况，并根据当前运行工况，输出实现相应功能的控制信号。优选地，运行工况包括：380V交流线缆是否接通、整车是否需要高压上电、整车是否存在故障、当前是否使用车辆内置高压电池作为动力源、车辆内置高压电池是否需要充电、电机系统是否处于制动状态以及低压电源是否需要进行充电。优选地，在380V线缆接通的工况下，控制模块输出车辆独立使用市电进行工作的控制信号。优选地，在380V线缆未接通的工况下，控制模块输出车辆独立使用车辆内置高压电池工作的控制信号。优选地，在380V线缆接通的工况下，若车辆内置高压电池电量低于预设高压下限阈值，判断车辆内置高压电池需要充电，控制模块输出车辆使用市电进行充电的控制信号。优选地，在低压电源电压低于预设低压下限阈值时，判断低压电源需要进行充电，控制模块输出驱动DC/DC模块工作的控制信号。例如，低压电压电量低于18V，其他部件会出现不工作的情况，所以低压电源电压要高于18V，预设低压下限阈值高于18V，如20V，当低压电源电压低于20V时，进行充电，此值也可由客户定义。优选地，在整车需要上高压电的工况时，控制模块输出为电机系统进行预充的控制信号。高压上电工作原理：可电流分配的车载充电高压柜装置接收唤醒信号，可电流分配的车载充电高压柜装置低压上电；控制模块判断动作模块的第一继电器至第六继电器六个继电器是否都处于断开状态，如果都处于断开状态，则判断第一继电器至第六继电器六个继电器是否都无粘连故障（通过判断输出缺不缺相，电流值等进行判断），如果都无粘连故障，则发送第一继电器至第六继电器六个继电器的状态给整车控制系统；控制模块持续判断是否收到整车控制系统要求高压上电信号，如果收到整车控制系统要求高压上电信号，控制模块输出整车高压上电控制信号，即高压使能；在高压使能情况下，闭合第五继电器，由预充电阻为整车供电，缓解整车突然上高压产生大的冲击电流，间隔第一时间间隔后，闭合第四继电器，由车辆内置高压电池连接电机系统，为整车供电，然后断开第五继电器，发送上高压状态，表示可电流分配的车载充电高压柜装置可以做好工作准备；控制模块判断直流模块输出电压值是否大于第一直流电压阈值：如果直流模块输出电压值小于等于第一直流电压阈值，说明没有市电接入，则使用车辆内置高压电池为整车供电；判断低压低压电源当前剩余电量是否低于预设低压下限阈值，即低压电源是否需要充电；如果低压电源当前剩余电量低于预设低压下限阈值，说明低压电源需要充电，则闭合第三继电器，将车辆内置高压电池的高压直流电通过DC/DC模块转换为低压直流电后为低压电源充电，充电过程中，判断低压电源当前剩余电量是否高于预设低压上限阈值，如果是，说明低压电源电量已充够，断开第三继电器，停止为低压电源充电，如果否，则继续充电，直至低压电源当前剩余电量高于预设低压上限阈值，停止充电；如果直流模块输出电压值大于第一直流电压阈值，说明有市电接入，则闭合第六继电器，断开第四继电器，断开车辆内置高压电池，使用市电通过直流模块转换为直流电为整车供电；判断车辆内置高压电池当前剩余电量是否低于预设高压下限阈值，即车辆内置高压电池是否需要充电；如果车辆内置高压电池当前剩余电量低于预设高压下限阈值，说明车辆内置高压电池需要充电，则闭合第二继电器，由直流模块持续为车辆内置高压电池充电，充电过程中，判断车辆内置高压电池当前剩余电量是否高于预设高于预设高压上限阈值，如果是，说明车辆内置高压电池电量已充够，断开第二继电器，停止为车辆内置高压电池充电，如果否，则继续充电，直至车辆内置高压电池当前剩余电量高于预设高于预设高压上限阈值，停止充电；判断低压电源当前剩余电量是否低于预设低压下限阈值，即低压电源是否需要充电；如果低压电源当前剩余电量低于预设低压下限阈值，说明低压电源需要充电，则闭合第一继电器，将直流模块的高压直流电通过DC/DC模块处理转化为低压直流电后为低压电源充电，充电过程中，判断低压电源当前剩余电量是否高于预设低压上限阈值，如果是，说明低压电源电量已充够，断开第一继电器，停止为低压电源充电，如果否，则继续充电，直至低压电源当前剩余电量高于预设低压上限阈值，停止充电。高压下电工作原理：可电流分配的车载充电高压柜装置接收下电信号，判断第六继电器是否闭合，即当前是否为市电为整车供电：如果第六继电器闭合，则当前为市电为整车供电，断开第六继电器，判断第六继电器是否断开，如果未断开，反馈下电故障信号；如果断开，执行第二继电器状态判断；如果第六继电器断开，则当前为高压电池为整车供电，断开第四继电器，判断第四继电器是否断开，如果未断开，反馈下电故障信号；如果断开，执行第二继电器状态判断；第二继电器状态判断，即判断是否当前直流模块在为高压电池充电：如果第二继电器闭合，说明当前直流模块在为高压电池充电，则断开第二继电器，判断第二继电器是否断开，如果未断开，反馈下电故障信号，如果断开，执行第一继电器状态判断及第三继电器状态判断；第一继电器状态判断，即判断是否直流模块在为低压电源充电：如果第一继电器闭合，说明当前直流模块在为低压电源充电，则断开第一继电器，判断第一继电器是否断开，如果未断开，反馈下电故障信号，如果断开，反馈高压下电完成信号；第三继电器状态判断，即判断是否高压电池在为低压电源充电：如果第三继电器闭合，说明当前高压电池在为低压电源充电，则断开第三继电器，判断第三继电器是否断开，如果未断开，反馈下电故障信号，如果断开，反馈高压下电完成信号。与现有技术相对比，本发明的有益效果如下：1. 本发明的可电流分配的车载充电高压柜装置通过控制模块判断具体运行工况，在不同工况下，控制模块通过采集模块进行环境的采集，通过动作模块进行相应的动作，可实现集成本发明装置的新能源车辆进行自主电流分配，将本发明的装置集成在大型新能源工程车辆中，可长时间使用，降低车辆对固定式充电桩的需求，提升使用效率，达到在一定范围内连续作业的需求。"
  },
  {
    "专利名": "基于新能源工程车的气制动和电制动的动态扭矩分配方法",
    "申请号": "CN202211018601.6",
    "公开日": "20221125",
    "IPC 分类号": "B60T13/74;B60L7/26;B60T13/58",
    "申请人": "西安主函数智能科技有限公司",
    "关键词": "动态扭矩分配方法、车辆状态信息、工况信息、制动模式、扭矩分配策略、PID动态算法、电驱制动力矩、气压制动力矩、新能源工程车、气制动、电制动",
    "摘要": "本发明公开了一种基于新能源工程车的气制动和电制动的动态扭矩分配方法，其包括：基于采集的车辆状态信息和工况信息，确定车辆制动模式的类型，车辆制动模式包括滑行自主制动模式、人工参与制动模式、滑行自主制动到人工参与制动切换模式以及人工参与制动到滑行自主制动切换模式；基于车辆制动模式类型确定扭矩分配策略。本发明在满足整车制动安全和驾驶需求的基础上，实时采集车辆状态信息和工况信息，通过PID动态算法准确分配电驱制动力矩和气压制动力矩，提高制动安全性的同时，极大的回收了电能，从而减少整车能耗。",
    "说明书": "基于新能源工程车的气制动和电制动的动态扭矩分配方法技术领域本发明涉及工程车制动控制技术领域。更具体地说，本发明涉及一种基于新能源工程车的气制动和电制动的动态扭矩分配方法。背景技术在现有传统工程运输车中，制动系统主要采用压缩空气的气制动方法。因工程运输车的满载质量大、工况复杂、工作量饱满，尤其在重载下工况，长时间制动容易引起各个制动鼓温度过高，存在制动失效风险。因此，传统车型在重载下工况使用时，在制动系统会单独增加电涡流辅助制动系统，而且在主制动系统增加制动鼓水冷却设备，避免长期刹车轮毂高温风险。现有新能源工程运输设备中，制动系统有气压制动和电驱系统反馈制动，大大减少制动系统的配置复杂度和降低了气制动参与程度，但现有新能源工程运输车中，制动工况依然会因为制动力分配不合理导致系列问题，尤其是重载下坡工况，车辆在滑行时电驱回馈制动扭矩设为定值，当车辆运行状态和工况发生变化时，制动效果也随之发生变化时强时弱，很难满足驾驶意愿；车辆在驾驶员脚踩踏板制动时，电制动与气制动会共同参与或者气制动在制动踏板达到一定开度后再参与——此扭矩分配方法仅仅是将电、气制动扭矩简单叠加，容易制动过度。在重载下坡工况中还存在一些其它问题，如驾驶员需频繁在制动踏板和油门踏板之间来回切换，使得整车驾驶感极差同时整车能耗也高；另外由于工程运输设备与大多数乘用车或商用车不同，不属于电机直驱传动系统，普遍配置变速箱。乘用车制动扭矩分配方法中采用制动踏板开度和电机转速的查表方式发送给电机制动目标扭矩，而此方法不能准确满足工程运输设备各挡位下的实时制动需求。发明内容本发明的一个目的是解决至少上述问题，并提供至少后面将说明的优点。本发明还有一个目的是提供一种基于新能源工程车的气制动和电制动的动态扭矩分配方法，在满足整车制动安全和驾驶需求的基础上，实时采集车辆状态信息和工况信息，通过PID动态算法准确分配电驱制动力矩和气压制动力矩，提高制动安全性的同时，极大的回收了电能，从而减少整车能耗。为了实现根据本发明的这些目的和其它优点，提供了一种基于新能源工程车的气制动和电制动的动态扭矩分配方法，其包括：基于采集的车辆状态信息和工况信息，确定车辆制动模式的类型，车辆制动模式包括滑行自主制动模式、人工参与制动模式、滑行自主制动到人工参与制动切换模式以及人工参与制动到滑行自主制动切换模式；基于车辆制动模式类型确定扭矩分配策略，其包括：滑行自主制动模式，判断实际需求功率是否大于最大允许电制动功率，若是则执行电制动扭矩和气制动扭矩，否则执行电制动扭矩；人工参与制动模式，手柄参与制动情况下，判断实际需求功率是否大于最大允许电制动功率，若是则执行电制动扭矩和气制动扭矩，否则执行电制动扭矩；制动踏板参与制动、手柄和制动踏板同时参与制动的情况下，均执行电制动扭矩和气制动扭矩；滑行自主制动到人工参与制动切换模式，切换之前扭矩分配遵循滑行自主制动模式，切换之后扭矩分配遵循人工参与制动模式，切换时刻执行电制动扭矩和气制动扭矩；人工参与制动到滑行自主制动切换模式，切换之前扭矩分配遵循人工参与制动模式，切换之后扭矩分配遵循滑行自主制动模式，切换时刻执行电制动扭矩。优选的是，所述的基于新能源工程车的气制动和电制动的动态扭矩分配方法，滑行自主制动模式中，以及人工参与制动模式的手柄参与制动情况下：当实际需求功率大于最大允许电制动功率时，均按照公式(2)～(3)分别计算得到电制动扭矩和气制动扭矩的分配百分比；当实际需求功率小于等于最大允许电制动功率时，均按照公式(1)的计算得到电制动扭矩；式中，P123CurrentGeartransout优选的是，所述的基于新能源工程车的气制动和电制动的动态扭矩分配方法，最大允许电制动功率P2式中，SOC＝电池充电容量/电池额定容量×100％；VBatBatPermitMaxInCurt_Pulse优选的是，所述的基于新能源工程车的气制动和电制动的动态扭矩分配方法，传动轴功率的计算为：滑行自主制动模式下，手柄不参与制动时，判断坡度值是否小于预设坡度阈值，若是则将车辆目标转速和车辆实际转速的差值作为控制输入，通过动态PID控制算法，得到传动轴功率P111213式中，v为车速、Δn为传动轴转速差值、m为整车质量；r为车辆轮胎的半径；i0优选的是，所述的基于新能源工程车的气制动和电制动的动态扭矩分配方法，手柄需求功率P13优选的是，所述的基于新能源工程车的气制动和电制动的动态扭矩分配方法，人工参与制动模式的制动踏板参与制动情况下，实际需求功率为制动踏板需求功率P14优选的是，所述的基于新能源工程车的气制动和电制动的动态扭矩分配方法，人工参与制动模式的手柄和制动踏板同时参与制动情况下，取手柄需求功率和制动踏板需求功率中的最大值作为实际需求功率P15优选的是，所述的基于新能源工程车的气制动和电制动的动态扭矩分配方法，滑行自主制动到人工参与制动切换模式中，切换时刻对应的电制动分配扭矩为滑行自主模式退出时刻对应的扭矩值；气制动扭矩的分配百分比为滑行自主模式退出时刻对应的气制动扭矩百分比与手柄开度或制动踏板开度之和。优选的是，所述的基于新能源工程车的气制动和电制动的动态扭矩分配方法，人工参与制动到滑行自主制动切换模式中，切换时刻对应的电制动分配扭矩为人工参与制动模式退出时刻对应的电制动扭矩与滑行自主制动模式进入时刻对应的电制动扭矩之和。优选的是，所述的基于新能源工程车的气制动和电制动的动态扭矩分配方法，预设坡度阈值为-5±1％。本发明至少包括以下有益效果：本发明车辆运行工况和驾驶员操作方式，实时计算和分配制动系统中电制动与气制动参与程度，达到在满足制动安全和性能基础上，尽可能回收电制动能量。在制动工况，实时采集车辆的状态信息(车辆的驱动轮的转速、手柄信号、油门踏板信号、制动踏板信号、脚制动阀等)和车辆工况信息(坡度等)，基于车辆状态信息和工况信息，进行逻辑判断，确定车辆的制动模式(制动状态)，本发明将制动状态分为滑行自主制动状态、脚踏板制动状态和两者切换状态。针对不同制动状态，采用不同的动态计算方法，进行合理分配电驱制动力矩(电制动扭矩)和气压制动力矩(气制动扭矩分配百分比)，尤其在中间转换模式中，为了解决模式转换带来的扭矩突变和冲击，根据不同的转换状态进行单独计算和分配，本发明经过重载下坡工况的矿区测试，与常用电、气制动策略及方法对比，满足同样制动效果和安全性能的基础上，电制动回馈率提升30～40％。本发明的其它优点、目标和特征将部分通过下面的说明体现，部分还将通过对本发明的研究和实践而为本领域的技术人员所理解。"
  },
  {
    "专利名": "双车体电动公铁两用牵引车",
    "申请号": "CN202120935720.2",
    "公开日": "20211126",
    "IPC 分类号": "B60F1/04",
    "申请人": "山东东铁动力科技有限公司",
    "关键词": "双车体、电动公铁两用牵引车、铰接相连、橡胶轮组、导向轮、空气压缩机、储气瓶、轨道交通设备、新能源工程车",
    "摘要": "本实用新型涉及一种双车体电动公铁两用牵引车，属于轨道交通设备。本实用新型采用的技术方案是：包括前车体和后车体，前车体和后车体之间铰接相连，前车体下部设置前橡胶轮组和前导向轮，后车体下部设置后橡胶轮组和后导向轮，后车体的内部设置电动机和变速箱，电动机与后车体的前橡胶轮组间通过变速箱驱动相连，后车体内还设置有蓄电池，蓄电池为电动机提供电源，前车体内设置空气压缩机和储气瓶，后车体内的蓄电池为空气压缩机提供动力电源。本实用新型的优点在于：双车体公铁两用牵引车动力为电动，适应某些场合的电动驱动需求；双车体结构自重大，载重力强，符合当前新能源工程车的发展路径。",
    "说明书": "双车体电动公铁两用牵引车技术领域本实用新型涉及一种双车体电动公铁两用牵引车，属于轨道交通设备。背景技术公铁两用牵引车是常见的轨道交通设备，其进场方便，具有常规的公路行驶功能和轨道行驶功能。目前的公铁两用牵引车还是采用柴油机驱动，驱动力大，适合重载。电动驱动的汽车或轨道牵引车近些年进入市场，具有无排放特性，在一些场合中需求逐渐出现。目前的双车体电动公铁两用牵引车多采用舵轮结构实现转弯，车体为一体结构。传动的公铁两用牵引车为两车体，其自重大，载重力强。发明内容本发明提供一种双车体电动公铁两用牵引车，实现电动驱动双车体公铁两用牵引车。为实现上述目的，本实用新型采用的技术方案是：双车体电动公铁两用牵引车，包括前车体和后车体，前车体和后车体之间铰接相连，前车体下部设置前橡胶轮组和前导向轮，后车体下部设置后橡胶轮组和后导向轮，后车体的内部设置电动机和变速箱，电动机与后车体的前橡胶轮组间通过变速箱驱动相连，后车体内还设置有蓄电池，蓄电池为电动机提供电源，前车体内设置空气压缩机和储气瓶，后车体内的蓄电池为空气压缩机提供动力电源。作为优选，前车体由前框架及前框架前端的配重组成，空气压缩机和储气瓶设置在前框架内，前框架覆盖前机罩，前框架的上部一周设置有前栏杆。作为优选，后车体由后框架、后配重和驾驶室组成，后车体在靠近铰接相连的位置为驾驶室，驾驶室与后框架相连，所述后配重处于后框架的端部位置，发动机、减速箱和蓄电池设置在后框架内，后框架外部覆盖后机罩，后框架顶部一周设置有后栏杆。作为优选，前车体和后车体的端部位置分别设有车钩头，车钩头与待牵引或推动的车厢相连。作为优选，前车体和后车体的铰接位置设有锁死机构，锁死结构将前车体和后车体固定在一起。作为优选，后车体在驾驶室一侧设有液压油箱。本实用新型的优点在于：双车体公铁两用牵引车动力为电动，适应某些场合的电动驱动需求；双车体结构自重大，载重力强，符合当前新能源工程车的发展路径。"
  },
  {
    "专利名": "一种环保型及具有轮胎测压功能的新能源工程车",
    "申请号": "CN201711023682.8",
    "公开日": "20180327",
    "IPC 分类号": "B60C23/04;B60S1/66",
    "申请人": "孙洪军",
    "关键词": "新能源工程车、吸尘机构、检测机构、报警机构、调节组件、升降单元、往复单元、转动单元、数据检测、报警提醒、环保型、轮胎测压功能、新能源汽车",
    "摘要": "本发明涉及一种环保型及具有轮胎测压功能的新能源工程车，包括车体和车轮，还包括吸尘机构、检测机构和报警机构，吸尘机构包括移动组件和调节组件，调节组件包括升降单元、往复单元和转动单元，报警机构包括两个电磁铁、摆动杆、震动片和两个固定板。该环保型及具有轮胎测压功能的新能源工程车中，通过吸尘机构，可以对车体的车厢的各个位置，对扬起的尘土进行吸收，尽可能的减少使其他车辆蒙灰的情况发生，减轻对城市的市容市貌的影响，通过检测机构和报警机构，可以对轮胎的气压进行检测并且即使对司机进行报警提醒，从而解决轮胎的问题，提高运输工作的效率，通过这些，大大提高新能源汽车的实用性和可靠性。",
    "说明书": "一种环保型及具有轮胎测压功能的新能源工程车技术领域本发明涉及新能源汽车领域，特别涉及一种环保型及具有轮胎测压功能的新能源工程车。背景技术新能源汽车是指除汽油、柴油发动机之外所有其它能源汽车，包括燃料电池汽车、混合动力汽车、氢能源动力汽车和太阳能汽车等，其废气排放量比较低。目前的很多的工程车都已经采用了新能源汽车代替以前的燃油车，然而，这些新能源工程车在实际使用时，还是存在一些不足，比如工程车在运输土料时，常常会扬起大量的灰尘，这些不仅容易使使其他车辆蒙灰，而且影响城市的市容市貌，此外，工程车的轮胎检测及提醒也十分重要，轮胎的气压过高或者过低都影响着工程车的使用，如果能够解决以上问题，将大大提高新能源汽车的实用性和可靠性。发明内容本发明要解决的技术问题是：为了克服现有技术的不足，提供一种环保型及具有轮胎测压功能的新能源工程车。本发明解决其技术问题所采用的技术方案是：一种环保型及具有轮胎测压功能的新能源工程车，包括车体和车轮，还包括吸尘机构、检测机构和报警机构，所述吸尘机构和报警机构均设置在车体的内部，所述检测机构设置在车轮上；所述吸尘机构包括移动组件和调节组件，所述调节组件设置在移动组件上，所述移动组件与调节组件传动连接；所述调节组件包括升降单元、往复单元和转动单元，所述往复单元设置在升降单元的内部，所述转动单元设置在往复单元上，所述升降组件与往复组件传动连接，所述往复组件与转动单元传动连接；所述升降单元包括气缸和升降块，所述气缸竖向设置在移动组件上，所述气缸的气杆与升降块相连；所述往复单元包括第二电机、半齿轮、两个条形齿轮和移动框，所述第二电机水平设置在升降块的内部，所述第二电机与半齿轮传动连接，所述移动框水平设置在升降块的一侧，两个条形齿轮分别水平设置在移动框的内壁的上下两侧且关于移动框对称，所述半齿轮设置在两个条形齿轮之间，所述半齿轮与条形齿轮啮合；所述转动单元包括驱动室、第三电机、驱动轮、连接线和吸尘管，所述吸尘管设置在移动框的下方，所述驱动室设置在移动框的下方的一侧，所述第三电机水平设置在驱动室的内部，所述第三电机与驱动轮传动连接，所述驱动轮的轮面与半齿轮的轮面垂直，所述驱动轮通过连接线与吸尘管相连；所述报警机构包括两个电磁铁、摆动杆、震动片和两个固定板，所述摆动杆水平设置在车体的内部，所述摆动杆的一端与车体的内部铰接，所述摆动杆的另一端与震动片相连，所述震动片水平设置，两个电磁铁分别水平设置在摆动杆的上下两侧且关于摆动杆对称，两个固定板分别水平设置在震动片的上下两侧且关于震动片对称。作为优选，为了控制调节组件的位置，第一电机启动，丝杆随之转动从而带动移动块移动，通过控制第一电机的转动，可以使得移动块带动调节组件移动到适合位置。所述移动组件包括第一电机、丝杆和移动块，所述第一电机水平设置在车体的内部，所述丝杆水平设置，所述移动块上设有通孔，所述通孔的内部设有与丝杆匹配的内螺纹，所述第一电机通过丝杆与移动块传动连接，所述气缸竖向设置在移动块上。作为优选，为了使移动块水平稳定的沿着导向杆方向移动，所述移动块的两侧设有两个导向杆，两个导向杆分别水平设置在移动块的两侧且关于丝杆对称，所述移动块和导向杆抵靠，所述移动块与导向杆滑动连接。作为优选，为了检测轮胎的气压情况，移动板受到轮胎内部的气压的作用力开始移动，弹簧被压缩，通过测压表检测弹簧作用力的大小，从而判断轮胎气压的状况，当气压过低或者过高时，进行警报提醒。所述检测机构包括壳体、移动板、弹簧和测压表，所述车轮上设有气门芯，所述壳体水平设置，所述壳体套设在气门芯上，所述移动板竖向设置在壳体的内部且在壳体的内部滑动，所述弹簧水平设置，所述测压表设置在壳体的内部，所述测压表通过弹簧与移动板相连。作为优选，为了使移动板水平稳定的移动，从而使得测压表检测弹簧上的作用力的数值准确，所述壳体的内部还设有两个平衡单元，两个平稳单元均设置在移动板的同一侧，两个平衡单元关于移动板对称，所述平衡单元包括固定杆和套管，所述固定杆水平设置，所述固定杆与移动板相连，所述套管套设在固定杆上，所述套管固定在壳体的内部，所述固定杆与套管滑动连接。作为优选，为了使得移动框水平稳定的移动，所述移动框的上方还设有稳固单元，所述稳固单元包括燕尾槽和滑动块，所述燕尾槽水平固定在移动框的上方且与升降块相连，所述滑动块与燕尾槽匹配，所述滑动块在燕尾槽的内部滑动，所述滑动块与移动框的上方相连。作为优选，为了对司机进行警报提醒，注意轮胎的气压的状态。所述车体的内部设有报警提示灯。作为优选，为了使第一电机精确稳定的工作，所述第一电机为伺服电机。作为优选，为了充分利用太阳能进行发电，从而节约其他能源，更加环保，所述车体的上方设有太阳能电池板。作为优选，为了能够进行无线传输信号，所述车体的内部还设有天线。本发明的有益效果是，该环保型及具有轮胎测压功能的新能源工程车中，通过吸尘机构，可以对车体的车厢的各个位置，对扬起的尘土进行吸收，尽可能的减少使其他车辆蒙灰的情况发生，减轻对城市的市容市貌的影响，通过检测机构和报警机构，可以对轮胎的气压进行检测并且即使对司机进行报警提醒，从而解决轮胎的问题，提高运输工作的效率，通过这些，大大提高新能源汽车的实用性和可靠性。"
  },
  {
    "专利名": "一种复合型新能源储能汽车",
    "申请号": "CN201610163602.8",
    "公开日": "20160629",
    "IPC 分类号": "B60N3/10;B60K8/00;B60L8/00;B60P3/32;B60L11/18",
    "申请人": "石家庄新华能源环保科技股份有限公司",
    "关键词": "复合型新能源储能汽车、变速及传动机构、风力发电机、太阳能发电系统、二氧化碳载体动力系统、干冰储罐、液态二氧化碳驱动单元、冷凝器、液态二氧化碳管路、绿色能源汽车",
    "摘要": "本发明涉及一种复合型新能源储能汽车，包括车体、车轮、发电机、启动电机、变速及传动机构、风力发电机、太阳能发电系统和以二氧化碳为载体的动力系统。以二氧化碳为载体的动力系统设有干冰储罐、发电机和液态二氧化碳驱动单元。液态二氧化碳驱动单元设有膨胀机、蒸发器、冷凝器和工质泵。膨胀机的一头通过离合器与变速及传动机构连接，另一头与发电机同轴连接。液态二氧化碳下部出口通过液态二氧化碳管路与冷凝器连接，冷凝器出口通过压缩机连接到干冰储罐的高温二氧化碳气体入口。本发明通过太阳能和风能发电，利用以二氧化碳为载体的动力系统进行储能和供能，为汽车提供动力，灵活调节能量，实现绿色能源汽车全天候正常行驶。",
    "说明书": "一种复合型新能源储能汽车技术领域本发明属于新能源汽车技术领域，涉及一种新能源汽车，具体涉及一种复合型新能源储能汽车。背景技术近年来汽车的生产量连年剧增，汽车尾气成为了环境污染的重要原因。针对汽车污染的问题，各国政府都积极制定汽车尾气排放标准，其中欧盟的标准极其严格，成为了其他国家制定标准的重要参照。为了应对不断严格的汽车尾气排放标准，各大汽车厂商目前主要采取利用新能源来解决汽车尾气和能源匮乏的重要问题。太阳能、风能、势能成为了解决这些问题的方向。太阳能的利用主要是通过太阳能电池板，利用光电效应，将太阳辐射能直接转换成电能，利用太阳能电池进行储存和利用。风能是利用风力带动风车叶片旋转，再通过增速机将旋转的速度提升，来带动发电机发电，然后储存和使用。然而由于太阳能和风能利用受到天气和自然环境的影响，能量的储存和供应受到限制，不能保证时刻有充足的电力驱动汽车运行。发明内容本发明的目的是提供一种复合型新能源储能汽车，通过太阳能和风能发电，利用以二氧化碳为载体的动力系统进行储能和供能，为汽车提供动力，灵活调节能量，实现绿色能源汽车全天候正常行驶。本发明复合型新能源储能汽车，包括车体、车轮、发电机、启动电机、变速及传动机构和太阳能发电系统。太阳能发电系统包括太阳能电池板和蓄电池，太阳能电池板通过太阳能发电电路连接到蓄电池，发电机与蓄电池连接，启动电机通过电机离合器与变速及传动机构连接。新能源汽车设有以二氧化碳为载体的动力系统，以二氧化碳为载体的动力系统设有干冰储罐、液态二氧化碳泵、发电机和液态二氧化碳驱动单元，干冰储罐设有干冰入口、液态二氧化碳上部抽出口、液态二氧化碳下部出口、低温二氧化碳气体出口和高温二氧化碳气体入口。液态二氧化碳驱动单元设有膨胀机、蒸发器、冷凝器和工质泵，膨胀机的工质出口通过冷凝器与工质泵连接，工质泵的出口通过蒸发器连接到膨胀机的工质入口。膨胀机一头通过膨胀机离合器与变速及传动机构连接，另一头与发电机同轴连接。液态二氧化碳上部抽出口和液态二氧化碳下部出口与液态二氧化碳泵连接，液态二氧化碳泵出口通过液态二氧化碳管路与冷凝器连接，冷凝器出口通过压缩机连接到干冰储罐的高温二氧化碳气体入口。汽车设有启动电机，启动电机与变速及传动机构连接。汽车设有干冰制造机，干冰储罐的液态二氧化碳上部抽出口和液态二氧化碳下部出口连接到液态二氧化碳泵入口，液态二氧化碳泵的出口分为两路，一路连接到干冰制造机，干冰制造机的出口连接到干冰入口，一路通过液态二氧化碳管路连接到冷凝器入口。汽车设有空调、冰箱储物柜和低温二氧化碳风机，干冰储罐的低温二氧化碳气体出口与低温二氧化碳风机连接，低温二氧化碳风机出口通过低温二氧化碳气体管路连接到空调和冰箱储物柜，空调和冰箱储物柜的出口通过高温二氧化碳气体管路连接到干冰储罐的高温二氧化碳气体入口。蓄电池通过用电电路与启动电机、工质泵、压缩机和低温二氧化碳风机连接，汽车智能化控制。汽车设有风力发电机，风力发电机通过风力发电电路连接到蓄电池，风力发电机分别安装在汽车顶部、前部、后部和车轮的轮毂上。汽车设有GPS定位系统， GPS定位系统安装在前窗玻璃处。GPS系统将车辆的运行信息，随时反馈到科班中心。车体顶部装有压力发电板，太阳能电池板覆盖汽车全身。压力发电板与太阳能电池板在不同的环境下进行切换，不同环境下都可以发电。汽车设有反制动发电机构，反制动发电机构安装在车轮上，反制动发电机构与蓄电池电路连接。干冰储罐、低温二氧化碳气体管路、高温二氧化碳气体管路、液态二氧化碳管路和液态二氧化碳泵安装在载人车厢之外，载人车厢内设有二氧化碳检测报警仪，当车厢内的二氧化碳超标时，智能系统自动打开车窗。干冰储罐上设置安全阀和排空阀，防止罐内压力超过安全值，在长期不使用时，可以排空干冰储罐系统。干冰储罐内加有臭味剂，干冰储罐内的隔板不完全把罐体分成若干份，而是在隔板上部或下部或中间的某个位置留有适当的间隙，使储罐内具有一个联通的通道，使气态二氧化碳、液态二氧化碳和干冰处于联通的状态，便于气态二氧化碳和液态二氧化碳的流动和冷却。隔板至少有一个。隔板的材料可以是金属材料、非金属的复合材料。干冰储罐的内层为耐低温材料或复合材料，如耐低温钢，外层为金属材料或复合材料，内层和外层之间设有绝热保温材料；所述绝热保温材料为膨胀珍珠岩、保温砖或复合保温层。内壁循环管可以是在内壁布置，也可以充满整个罐体。干冰储罐上设有人工加入干冰口和抽取液态二氧化碳口。液态二氧化碳上部抽出口通过三通阀分别与抽取液态二氧化碳口和液态二氧化碳泵连接。本发明另一选择方案为，以二氧化碳为介质的动力系统设有干冰储罐和气态二氧化碳驱动单元，二氧化碳驱动单元设有膨胀机、蒸发器、换热器和压缩机。干冰储罐的液态二氧化碳上部抽出口和液态二氧化碳下部出口连接到液态二氧化碳泵入口，液态二氧化碳泵的出口分为两路，一路连接到干冰制造机，干冰制造机连接到干冰入口。另一路通过液态二氧化碳管路连接到换热器，换热器出口通过蒸发器连接到膨胀机。膨胀机出口通过换热器连接到压缩机，压缩机出口通过高温二氧化碳气体管路连接到干冰储罐的高温二氧化碳气体入口，用低温二氧化碳的膨胀功直接驱动汽车运行。以二氧化碳为载体的动力系统设有气液分离器和干冰过滤器，干冰储罐设有隔板、内壁循环管、1～50根外循环管和循环入口，使低温气体在干冰储罐内高温气体入口区域与高温气体混合。低温二氧化碳气体出口通过干冰过滤器和气液分离器连接到低温二氧化碳风机。隔板将干冰储罐分为两部分，高温二氧化碳气体管路分为两路，一路连接到高温二氧化碳气体入口，另一路连接到内壁循环管，内壁循环管的下部出口通过外循环管连接到循环入口。启动电机的齿轮可以分离和啮合，汽车在行驶中减小油门时，风力发电系统风阀自动打开，风电系统开始发电，风阀朝向可以智能调整。既可以行车时使用，又可以停车时有风的天气中自动打开使用，压力发电系统在下雨、下冰雹时启用，给第三、四蓄电池充电。汽车车身全覆盖太阳能电池板，电池板给第三、四蓄电池充电。第三、四蓄电池与第一、二蓄电池形成互补关系，给整个汽车系统供电。汽车的玻璃是双面强化玻璃，既保证了汽车内部人员和财物的安全，又保证了乘客在必要时从内部敲碎车窗逃生的需要。此汽车不但是行车工具，还可以当作旅馆、公寓、住宅和办公场所，营造成一个安全舒适、空气洁净的车内环境。干冰储罐上设有两个液态二氧化碳上部抽出口，同时在抽完液态二氧化碳后，加入干冰。在汽车正常运转后，启动电机通过电机离合器脱离传动装置，避免负载运行。停车时、用电量大时或当电池电量低于设定值时，智能控制系统将启动膨胀机，给电池充电，保证用户的正常使用。以二氧化碳为载体的动力系统可以用在水泥罐车、矿山装载车、重型卡车、中小型卡车、旅游车、房车、公共汽车和电动自行车。冰箱储物柜上设有干冰车送货员和用户都可打开的锁。本发明再一种选择方案为，以二氧化碳为载体用于固定场所的储能动力系统设有干冰储罐、液态二氧化碳驱动单元、空调和冰箱。液态二氧化碳驱动单元设有发电机和蓄电池。膨胀机与发电机同轴连接，发电机的输入电路与蓄电池连接，蓄电池的输出端与干冰储罐电路连接。干冰储罐的液态二氧化碳下部出口连接到液态二氧化碳泵，液态二氧化碳泵出口分为两路，一路连接到干冰制造机，另一路通过液态二氧化碳管路与冷凝器连接，冷凝器出口通过压缩机连接到干冰储罐的高温二氧化碳气体入口。干冰储罐的低温二氧化碳气体出口通过干冰过滤器和气液分离器连接到低温二氧化碳风机，低温二氧化碳风机出口通过低温二氧化碳气体管路与空调和冰箱连接。空调和冰箱的出口通过高温二氧化碳气体管路连接到干冰储罐的高温二氧化碳气体入口。汽车的前盖、干冰加入口和液态二氧化碳抽出口只允许专业人员打开。本发明复合型新能源储能汽车通过太阳能、风能和势能发电，利用以二氧化碳为载体的动力系统进行储能和供能，为汽车提供动力，灵活调节能量，实现绿色能源汽车全天候正常行驶。汽车后面带有冰箱储物柜，适合加入各类生、熟食品以及各种物品、邮件。汽车里面温度适宜，空气新鲜，配合科班中心的运作，可作为移动居所和办公场所使用。既可以采用固定式加入干冰、抽取液态二氧化碳的方式，又可以采用移动干冰车加入干冰、抽取液态二氧化碳进入干冰车，干冰车也可以给冰箱储物柜进出物品，省去了电动汽车的充电桩，并具有网络购物功能。干冰车的送货员不需要与用户见面。而科班中心配备就餐场所，通过科班中心可以购物和叫各种的外卖和熟食品，同时配备盥洗室、卫生间，方便住在车里的人员的生活。车内具有可接收有线电视和无线电视的可折叠隐藏式电视机。具有各种无线网络功能，方便车内人员办公。科班中心还配有私人物品储藏柜。 所述汽车没有尾气排放，采用二氧化碳蓄能，既可以利用太阳能又可以利用风能、压力能充电使用，节约能源。"
  },
  {
    "专利名": "机械能链动力汽车",
    "申请号": "CN200220018092.9",
    "公开日": "20030604",
    "IPC 分类号": "B60K8/00",
    "申请人": "杨永明",
    "关键词": "机械能链动力汽车、恒力变速器、调速控制器、机械能链驱动动力装置、弹簧板式储能器、起拨电动机、蓄电池组、变速箱、绿色能源汽车",
    "摘要": "本实用新型是一种以机械能为驱动动力的机械能链动力汽车，主要包含有一恒力变速器、一离合器、差速器、调速控制器及操纵杆，所用的驱动动力机是一种机械能链驱动动力装置，该装置包含有至少一对二只弹簧板式储能器、与储能器相应的起拨电动机、一蓄电池组、一具有一根输出轴的变速箱，弹簧板式储能器的壳体通过一轴承组装置在主轴上。本实用新型汽车行驶可以不用油、气，在行驶时也不再排放“三废”，是一种真正的“绿色能源汽车”。此外，本实用新型容易实施，价格便宜，有利于推广使用。",
    "说明书": "机械能链动力汽车技术领域本实用新型涉及汽车，是一种以机械能为驱动动力的机械能链动力汽车。背景技术现有作汽车驱动动力的装置有：汽油发动机、柴油发动机、燃气发动机、燃氢发动机、电动机等，其中用得十分成熟、普遍的是燃油(汽油、柴油)发动机。但是，目前的燃油发动机存在着两方面不可避免的问题，一是石油的自然储藏量十分有限，会有枯竭的 一天，二是燃油汽车的排放污染十分严重，既直接影响地球生命的            健康，又会恶化大气而破坏人类的生存环境。至于说燃氢汽车、电动汽车等，也都只正处于积极研究、开发过程中，到产业化生产及普及使用还有相当距离，而且，其价格因素也住往制约着人们的使用欲望。发明内容本实用新型的目的是提供一种机械能链动力汽车，使其不烧油气，而主要用机械能作动力源，这样，汽车就不愁没有油气，在行驶过程中也不会产生“三废”排放，使之成为一种在现有技术条件下容易实施、真正的“绿色能源汽车”。实现上述目的的本实用新型，包含有目前一般汽车不可或缺的控制操作部件，如变速器、离合器、差速器、调速控制器及操纵杆等，本实用新型汽车上作驱动动力使用的是一种机械能链驱动动力装置，该装置的结构中，包含有至少一对二只弹簧板式储能器、与储能器相应的起拨电动机、一蓄电池组、一具有一根输出轴的变速箱；弹簧板式储能器的壳体通过一轴承组装置在主轴上，则储能器壳体将与主轴间产生相对转动；设在壳体内的一盘形弹簧板其一端连接在主轴上，另一端连接在壳体上，并且，主轴一端设有一起拨            轮、与该起拨轮相对端的储能器壳体上设有一输出齿轮；变速箱内具有两组变速齿轮，该两组变速齿轮具有同一输出轴，该输出轴上设有一使两组变速齿轮轮换运转的拨盘；储能器输出齿轮通过一加速齿轮带动变速箱内一组变速齿轮转动。在本实用新型中，起拨电动机最好通过一蜗轮-蜗杆齿轮机构            与主轴上的起拨轮相啮合。如上结构的本实用新型，当启动起拨电动机拨动主轴上的起拨轮而使主轴转动时，即盘紧盘形弹簧板而储能。盘形弹簧板盘紧后，起拨电动机停止工作，盘紧的盘形弹簧将被锁定。当盘形弹簧板在            有控释放能量时，弹簧板使壳体转动，壳体上的齿轮盘则通过加速齿轮而使变速箱输出转动能。本实用新型中的该变速箱输出轴，是与汽车的变速器轴接的，该变速器又经离合器使驱动轮主轴转动。本实用新型具有积极的效果，主要是汽车行驶可以不用油因此既不受现有传统能源的限制，在行驶时也不再排放“三废”，现代人们所不可缺少的代步工具-汽车，将成为一种真正的“绿色能源汽车”，汽车工业将进入一个新的时期。此外，本实用新型容易实施，价格便宜，有利于推广使用。"
  },
  {
    "专利名": "一种新型电动四轮车及其操作方法",
    "申请号": "CN201810038723.9",
    "公开日": "20180619",
    "IPC 分类号": "B60L15/00;B60L11/18",
    "申请人": "胡涛",
    "关键词": "电动四轮车、燃油发电机、电池组、启动电源、档位选择、正常驾驶、模式选择、氢燃料电池汽车",
    "摘要": "本发明提供了一种新型电动四轮车及其操作方法，属于电动汽车领域。它解决了现有电动汽车续航里程不长、充电设施不配套等技术问题。本新型电动四轮车的车体上设置有燃油发电机，燃油发电机给电池组的充电；上述新型电动四轮车的操作方法包括：启动电源、档位选择、正常驾驶、模式选择和关闭电源等步骤。本电动四轮车同氢燃料电池汽车相比，不存在基础设施重新、重复建设问题，更经济实惠；将燃油转化为电力，在同等燃油下，燃油发电机的输出功率比汽车发动机要大得多，提高了燃油的经济性；并且使用电力驱动汽车不仅操纵性远超传统的燃油汽车，并且由于燃油发电机以及燃油发电机的生产工艺要远低于汽车发动机，有效的降低了整车的制造成本。",
    "说明书": "一种新型电动四轮车及其操作方法技术领域本发明属于电动汽车技术领域，特指一种新型电动四轮车及其操作方法。背景技术电动汽车在如今的生活当中给人们的生产生活带来了巨大的发展，现有技术中的电动汽车主要采用电能作为动力源以驱动电机以实现车辆的行走，使用电动汽车在当前的社会发展中即符合当前节能减排政策的要求，其也有具有使用方便、使用成本低等优点。但是电动汽车与常规的燃油汽车相比，在使用中存在续航里程短、充电时间长、充电不方便等缺点，为了解决电动汽车中存在的上述缺点；因此，本发明在结合传统燃油汽车、电动汽车及氢燃料汽车的基础上，推出了一种新型电动四轮车，该新型电动四轮车可有效地解决上述问题。发明内容本发明的目的是提供一种能够用燃油给电池充电、续航里程长的新型电动四轮车及其操作方法。本发明的目的是这样实现的：一种新型电动四轮车，包括车体、电池组、驱动车体运动的电动机，其特征在于：所述的车体上设置有燃油发电机，所述的燃油发电机给电池充电。本发明将燃油转化为电能，在同等燃油的情况下，燃油发电机的输出功率要比汽车发动机大得多，有效的提高了燃油的经济性；同时，使用电力驱动的汽车不仅操控性远超传统的燃油汽车，并且燃油发电机以及燃油发电机的生产工艺技术要远低于汽车发动机，有效的降低了整车制造及维护成本。与氢燃料汽车相比，不存在基础设施重新、重复建设问题，而且电动机驱动模式一样，不但更经济实惠，而且节约巨额的社会综合成本。进一步的，所述的燃油发电机与电池组之间设置有充电器，所述的充电器上设置有连接插头。充电器的设计能够将燃油发电机所产生的电能进行电源管理，为电池组充电，有利于提高电池组的稳定性和安全性以及使用寿命。同时，充电器上设置的连接插头，能够使本电动车通过家庭照明用电直接给电池组充电。有利于节约资源，不受充电桩充电限制。进一步的，所述的车体内包括设置有操作功能的开关，所述操作功能的开关为拨动式开关、或按钮式开关、或触屏式开关；所述开关的操作功能为控制燃油发电机处于工作或停止的状态。上述新型电动四轮车的操作方法包括如下步骤：A、启动电源：通过设置在车体内的电池组开关启动电池组，使电池组处于正常工作状态；此时可以对电池组进行充放电操作；B、档位选择：本电动四轮车的档位选择开关包括“高电压档”、“标准电压档”和“低电压档”，驾驶员通过设置在车体内的档位控制开关在所述三个档位之间切换；C、正常驾驶：与通常的汽车进行相同的操作，即可实现本电动四轮车的驾驶；E、模式选择：通过开关控制燃油发电机的开启或关闭；上述步骤E可以在步骤A-步骤D之间的任一时机进行。D、关闭电源：停车后，通过电池组开关关闭电池组，使电池组处于关闭状态。在上述的一种新型电动四轮车的操作方法中，所述车体内还设置有空档控制开关和倒档控制开关，当按下空档控制开关后，电动机与电池组的连接被切断，本电动四轮车的其他功能依旧能够正常实现；当按下倒档控制开关后，电动四轮车会在现有档位的前提下，控制电动机反转。本发明相比较现有技术突出且有益的技术效果是：本发明将燃油转化为电能，在同等燃油的情况下，燃油发电机输出的功率要比传统汽车发动机大得多，有效的提高了燃油的经济性。同时，野外作业时，燃油发电机可以直接为野外作业人员的照明、厨房电器提供电力供应。停电时，燃油发电机也可以直接给家庭照明及家用电器提供电力供应。同时，使用电能驱动汽车不仅操控性远超传统的燃油汽车，并且燃油发电机以及燃油发电机的生产工艺技术要远低于汽车发动机，有效的降低了整车的制造及售后成本。本范例中可以使用家用照明用电给电池充电的环境，是设计时参考的一个外部环境；主要所选择的原因是：成本最优，充电设施限制环境要求最小，以及售后服务最经济的原则考虑。相较氢燃料汽车有很大的成本及基础设施优势。定将掀起一股新的潮流趋势。"
  },
  {
    "专利名": "一种汽车飞轮盘发电机",
    "申请号": "CN201810014617.7",
    "公开日": "20180511",
    "IPC 分类号": "H02K7/18",
    "申请人": "马雪峰",
    "关键词": "汽车飞轮盘发电机、电机壳、定子、转子、传动轴、结构设计、功能集成、飞轮壳/盘、传动系统",
    "摘要": "本发明公开了一种汽车飞轮盘发电机，包括电机壳、定子、转子和传动轴；所述定子和所述转子位于所述电机壳内并套接在所述传动轴上；所述电机壳固定在发动机的机座上，所述定子固定在所述电机壳上，所述传动轴的左端穿过所述电机壳与曲轴后端连接，所述转子随所述传动轴一起转动。本发明除具有发动机原有飞轮壳/盘的功能外，还具有发电、发动机起动、电力驱动汽车行驶的功能；本发明取代现有技术中的汽车发动机的原有飞轮和单独设置的发电机，节省了空间，传动系统简单，减少了能量损失。",
    "说明书": "一种汽车飞轮盘发电机技术领域本发明涉及一种汽车发电机，特别涉及一种汽车飞轮盘发电机。背景技术汽车飞轮主要功用是将在发动机做功行程中传输给曲轴能量的一部分储存起来，用以在其他行程中克服阻力，带动曲柄杆机构越过上、下止点，保证曲轴的旋转角速度和输出转矩尽可能均匀，并使发动机有可能克服短时间的超载荷；此外，在结构上飞轮又往往用作汽车传动系统中摩擦离合器的驱动件。汽车发电机通过传动结构输入来自发动机输出的动能转换为电能输出，发出的电经过发电机自带的整流器将交流转化为直流；当发动机转速达到一定转速时，发电机的转速随着增加，发出电的电压高于蓄电池电压时，就向蓄电池充电，同时向车上所有电器件供电。发动机输出的动能传输到汽车发电机的输入轴，需要传动机构进行能量传递，目前，常见有两种动能传递方式，一种是发动机飞轮与曲轴连接后，通过齿圈来带动传动机构进行机械传递，将动能传递给发电机，此结构复杂，且齿圈成本较高，并且齿圈形状无法与发电机的输入轴进行连接；还有一种动能传递方式，是通过皮带与发动机的减震皮带轮进行连接，减震皮带轮与曲轴通过花键结合，发动机曲轴转动，减震皮带轮同时转动，进而通过皮带带动发电机的皮带轮转动，从而带动转子转动实现发电，此种结构也比较复杂，而且能量传输效率低。发明内容本发明为解决公知技术中存在的技术问题而提供一种结构简单、能量损失小的汽车飞轮盘发电机。本发明为解决公知技术中存在的技术问题所采取的技术方案是：一种汽车飞轮盘发电机，包括电机壳、定子、转子和传动轴；所述定子和所述转子位于所述电机壳内并套接在所述传动轴上；所述电机壳固定在发动机的机座上，所述定子固定在所述电机壳上，所述传动轴的左端穿过所述电机壳与曲轴后端连接，所述转子随所述传动轴一起转动。本发明还可以采用如下技术措施：所述定子套接在所述转子的外侧，或者，所述定子与所述转子同心且平行设置。所述电机壳与所述传动轴间设有轴承。所述传动轴的右端套接离合器压盘，所述转子右端面与离合器压盘相对。所述汽车飞轮盘发电机还包括连接盘；所述连接盘与所述转子固接；所述连接盘的右端面与离合器压盘相配合。所述转子右端面与所述连接盘之间设有间隙，所述连接盘上开有若干通风孔。所述通风孔沿周向均布。所述转子设有永磁体和/或励磁线圈。所述转子设有串激式复合励磁。所述传动轴前端设有花键轴，所述花键轴上套接滑动结合套，所述滑动结合套与曲轴后端连接。本发明具有的优点和积极效果：本发明除具有发动机原有飞轮壳/盘的功能外，还具有发电、发动机起动、电力驱动汽车行驶的功能；本发明取代现有技术中的汽车发动机的原有飞轮和单独设置的发电机，节省了空间，传动系统简单，减少了能量损失。"
  },
  {
    "专利名": "静压活塞发动机",
    "申请号": "CN201310171773.1",
    "公开日": "20131023",
    "IPC 分类号": "F16H47/04",
    "申请人": "李树森",
    "关键词": "静压活塞发动机、啮传动机构、传动机构、轴组件、随动盘、外齿圈、行星齿轮、过渡齿轮、活塞、油静压力、滚轮轴、滚轮顶、机械领域\n",
    "摘要": "本发明涉及一种利用油的静压力推动活塞与5齿6啮传动机构相互作用，驱动发电机发电，驱动汽车、火车、舰船行驶的静压活塞发动机，属机械领域。它是在外壳和内齿圈内，装配有轴组件和随动盘，在两个随动盘之间，依次装配有外齿圈、行星齿轮和过渡齿轮，构成5齿6啮传动机构，在轴组件的活塞孔内，装配有活塞，用油的静压力推动活塞和滚轮轴及滚轮顶向外齿圈的内壁，并以滚轮与外齿圈的内壁的接触点为支点，反推轴组件，使轴组件产生按顺时针方向的转动，使滚轮能产生按顺时针方向的滚动，二者配合，处成静压活塞发动机的运转，驱动相连接发电机运转发电，并用这一电力驱动汽车、火车、舰船等运输机械的行驶，减少了添加汽油和柴油这一环节，节约燃料、保护环境。",
    "说明书": "静压活塞发动机所属技术领域本发明涉及一种利用油的静压力推动活塞与5齿6啮传动机构相互作用，驱动发电机发电，驱动汽车、火车、舰船行驶的静压活塞发动机，属机械领域。背景技术目前，汽车、火车、舰船等运输机械的行驶，是用汽油机、柴油机或蒸汽机驱动的，这些发动机在运行时，存在着将燃料的热能转换为机械能，造成能源消耗量大和环境污染严重的问题，申请号是：201210327833.X的顶动机虽然在解决这一问题，但它没有配备配套的供油系统。发明内容为了克服现有发动机运行时存在的需将燃料的热能转换为机械能，造成能源消耗量大和环境污染严重的问题以及顶动机没有配备配套的供油系统的问题，本发明提供一种静压活塞发动机，它利用油的静压压力推动活塞与5齿6啮传动机构相互作用，驱动发电机发电，驱动汽车行驶，并且在运行时不添加化石燃料，无环境污染。本发明解决其技术问题所采取的技术方案是：在外壳和内齿圈内，通过两套调心轴承装配有轴组件和随动盘，在两个随动盘之间，依次装配有外齿圈、行星齿轮和过渡齿轮，构成5齿6啮传动机构，其特征在于：在轴组件的活塞孔内，装配有活塞，操作手压油泵产生的压力油经过补油管、配油盖、油道进入活塞孔内，推动活塞和滚轮轴及滚轮顶向外齿圈的内壁，并以滚轮与外齿圈的内壁的接触点为支点，反推轴组件，使轴组件产生按顺时针方向的转动，使滚轮能产生按顺时针方向的滚动，轴组件转动使装配在该轴上的凸轮往复推动喷油泵工作并排出压力油，经喷油管、配油盖、油道向活塞孔继续供入压力油，弥补活塞间隙处泄漏损失的静压压力油，使轴组件继续转动。本发明的有益效果是：装配在5齿6啮传动机构内的活塞，在油压力作用下向外顶压的过程中，活塞顶部的滚轮与外齿圈内壁的接触点与活塞的中心不在一条直线上，形成力臂，对滚轮产生按顺时针方向滚动的扭矩，同时，活塞的中心与轴组件的中心也不在一条直线上，对轴组件产生按顺时针方向转动的扭矩，二者配合，处成静压活塞发动机的运转，驱动相连接发电机运转发电，并用该发电机产生的电力驱动汽车、火车、舰船等运输机械的行驶，减少了添加汽油和柴油这一环节，节约燃料、保护环境。"
  },
  {
    "专利名": "汽车混合动力专用三合一电机",
    "申请号": "CN201220745094.1",
    "公开日": "20130626",
    "IPC 分类号": "B60K6/26",
    "申请人": "甘联芳",
    "关键词": "汽车混合动力、三合一电机、电力驱动、电池反充电、冷却水道、转子外壳",
    "摘要": "本实用新型公开一种汽车混合动力专用三合一电机，电机包括外壳、线圈、转子、离合器和中轴，线圈安装在外壳内，转子设置在线圈内，线圈驱动转子转动，中轴设置在转子中间，离合器设置在中轴和转子之间。本实用新型即可实现电力驱动汽车运行，又可在汽车滑行或下坡等时，给电池反充电，可大大节约能量和资源。",
    "说明书": "汽车混合动力专用三合一电机技术领域本实用新型公开一种电机，特别是一种汽车混合动力专用三合一电机。背景技术随着电子技术的逐渐发展，电在人们生活中的应用越来越广泛，电可谓是20世纪人们最伟大的发明。目前，电已经逐渐渗透到人们生活中的各个领域，尤其是电动车，越来越受到人们的关注，现有技术中的电动汽车以及混合动力汽车都是采用车载电子驱动电动机进行工作的，当车辆滑行或下坡等时，所产生的动能白白的被浪费掉了，造成资源的浪费。发明内容针对上述提到的现有技术中的电动汽车以及混合动力汽车在下坡或滑行时产生的动能白白浪费的缺点，本实用新型提供一种新的汽车混合动力专用三合一电机，其可在汽车下坡或滑行时，将动能转换成电能储存起来供汽车使用，可在汽车运行过程中节约能源。本实用新型解决其技术问题采用的技术方案是：一种汽车混合动力专用三合一电机，电机包括外壳、线圈、转子、离合器和中轴，线圈安装在外壳内，转子设置在线圈内，线圈驱动转子转动，中轴设置在转子中间，离合器设置在中轴和转子之间。本实用新型解决其技术问题采用的技术方案进一步还包括：所述的转子和离合器之间设有转子外壳。所述的外壳内设有冷却水道。所述的离合器采用自动单向离合器。本实用新型的有益效果是：本实用新型即可实现电力驱动汽车运行，又可在汽车滑行或下坡等时，给电池反充电，可大大节约能量和资源。下面将结合附图和具体实施方式对本实用新型做进一步说明。"
  },
  {
    "专利名": "内置双离合器的用于电力驱动汽车的牵引装置",
    "申请号": "CN201110441627.7",
    "公开日": "20130626",
    "IPC 分类号": "B60K6/44;B60K6/26;B60K6/38",
    "申请人": "上海大郡动力控制技术有限公司",
    "关键词": "同步电动机、内置双离合器、电力驱动汽车、牵引装置、同步电机、变速箱、蓄电池、工作模式选择、电力驱动",
    "摘要": "本发明涉及有永久磁体的同步电动机领域，具体为一种内置双离合器的用于电力驱动汽车的牵引装置。一种内置双离合器的用于电力驱动汽车的牵引装置，包括发动机(1)、同步电机(2)和变速箱(3)，其特征是：还包括一级离合器(41)、二级离合器(42)和蓄电池(5)，发动机(1)的输出轴和一级离合器(41)的输入轴连接，一级离合器(41)的输出轴和同步电机(2)的输入轴连接，同步电机(2)的输出轴和二级离合器(42)的输入轴连接，二级离合器(42)的输出轴和变速箱(3)的输入轴连接，同步电机(2)的电极分别用导线连接蓄电池(5)的正电极和负电极。本发明工作效率高，工作模式选择灵活，适应性强。",
    "说明书": "内置双离合器的用于电力驱动汽车的牵引装置技术领域本发明涉及有永久磁体的同步电动机领域，具体为一种内置双离合器的用于电力驱动汽车的牵引装置。背景技术目前新能源电机正得到日益广泛的应用，尤其在混合动力汽车领域应用更多。新能源电机为永磁同步电机，配备有电机控制器，既能由外部机械拖动作为发电机使用以输出电能，又能够作为电动机使用从外部输入电能以驱动其他机械。永磁同步电机使用于汽车，按照在汽车上的作用不同可分为混合动力型（即Integrated Started Generator，简称ISG）、驱动型（简称TM）等类型。ISG电机和发动机连接，由发动机驱动ISG电机用于生成驱动汽车所需要的电能；TM电机为驱动电机用于驱动汽车行驶，根据整车动力传动分配的需要不同，TM电机的输出端多与变速箱串联，或通过传动轴直接驱动后桥。ISG电机和TM电机各自独立，ISG功率功率较小，而TM电机功率较大。但是，目前混合动力汽车所使用的电机，大多还处于“各自为阵”的地步，不能很好的整合以发挥综合优势，这就限制了永磁同步电机优势的发挥，也限制了混合动力汽车的发展。对于新能源电机来说ISG与TM都能作为发电机和电动机来使用。ISG、TM串联起来后，可以有效的动力叠加，拆分开来使用又能独立发挥各自的功能。发明内容为了克服现有技术的缺陷，提供一种效率高、适应性强的混合动力车辆牵引装置，本发明公开了一种内置双离合器的用于电力驱动汽车的牵引装置。本发明通过如下技术方案达到发明目的：一种内置双离合器的用于电力驱动汽车的牵引装置，包括发动机、同步电机和变速箱，发动机的输出轴和同步电机的输入轴连接，同步电机的输出轴和变速箱的输入轴连接，其特征是：还包括一级离合器、二级离合器和蓄电池，发动机的输出轴和一级离合器的输入轴连接，一级离合器的输出轴和同步电机的输入轴连接，同步电机的输出轴和二级离合器的输入轴连接，二级离合器的输出轴和变速箱的输入轴连接，同步电机的电极分别用导线连接蓄电池的正电极和负电极。所述的内置双离合器的用于电力驱动汽车的牵引装置，其特征是：同步电机由花键输入轴、前端盖、机壳、后端盖、电枢和飞轮盘输出轴组成，前端盖和后端盖分别盖于机壳的前端面和后端面，电枢设于前端盖、机壳和后端盖构成的空腔内，花键输入轴的一端和电枢的转子刚性连接，花键输入轴的另一端和一级离合器中离合片的内孔配合，飞轮盘输出轴的一端和电枢的转子刚性连接，飞轮盘输出轴的另一端和二级离合器中离合片的内孔配合。所述的内置双离合器的用于电力驱动汽车的牵引装置，其特征是同步电机选用永磁同步电机。本发明使用时，首先启动发动机并使发动机运行在高效区，同时闭合一级离合器和同步电机，发动机带动同步电机运行，同步电机处于发电机状态，同步电机输出的电能向蓄电池充电。当蓄电池电能充满后，断开一级离合器和同步电机，发动机停机，由蓄电池向同步电机提供电能，同步电机处于电动机状态，闭合二级离合器和变速箱，此时汽车处于纯电动模式运行。当汽车需要大功率输出时，此时闭合一级离合器和同步电机，也闭合二级离合器和变速箱，发动机和同步电机串联向外输出功率，此时汽车处于混合模式运行。二级离合器的闭合和断开可以灵活地实现汽车换挡的功能需要。本发明的有益效果是：工作效率高，工作模式选择灵活，适应性强，能使汽车始终运行高效区，实现节能减排。"
  },
  {
    "专利名": "用于电力驱动汽车的插电式电池充电装置及其使用方法",
    "申请号": "CN201110441629.6",
    "公开日": "20130626",
    "IPC 分类号": "H02J7/02",
    "申请人": "上海大郡动力控制技术有限公司",
    "关键词": "二次电池、电动车辆、电力装备、动力装置、插电式电池充电装置、双向逆变器、充电控制开关、电感、三相交流电连接插件、电机控制器、行驶模式、充电模式、电力驱动汽车",
    "摘要": "本发明涉及使用二次电池供电的电动车辆的电力装备或动力装置领域，具体为一种用于电力驱动汽车的插电式电池充电装置及其使用方法。一种用于电力驱动汽车的插电式电池充电装置，包括电池组(1)和双向逆变器(2)，其特征是：还包括充电控制开关(3)、电感(4)、三相交流电连接插件(5)、电机控制器(7)通过信号线分别连接双向逆变器(2)、充电控制开关(3)和驱动电机(6)。一种用于电力驱动汽车的插电式电池充电装置的使用方法，其特征是：电机控制器(6)控制切换至行驶模式或充电模式。本发明系统结构简单，成本低，充电控制性好。",
    "说明书": "用于电力驱动汽车的插电式电池充电装置及其使用方法技术领域本发明涉及使用二次电池供电的电动车辆的电力装备或动力装置领域，具体为一种用于电力驱动汽车的插电式电池充电装置及其使用方法。背景技术插入式混合动力动车（即Plug-in Hybrid Electric Vehicle，简称PHEV）和纯电动汽车（即Battery only Electric Vehicle，简称BEV）是两项快速兴起的电力驱动汽车技术，它们都使用高电压电池组作为能量来源，使用功能电机作为动力来源，由于电池组储存的电量有限，PHEV和BEV必须定期再充电，通常配置车载充电器，使用时外接电网以实现对电池组的充电。同时，为了控制电机的运行，PHEV和BEV上都设有电机控制器。目前，PHEV和BEV上的电机控制器只负责在汽车行驶对电机驱动的控制，当车辆停止时，电机控制器即停止工作，这样在充电时电机控制器无法对电池充电实施控制，必须另行安装车载充电控制装置，使的结构负责，成本增加。发明内容为了克服现有技术的缺陷，提供一种结构简单、使用方便、控制精确的车载电池充电装置，本发明公开了一种用于电力驱动汽车的插电式电池充电装置及其使用方法。本发明通过如下技术方案达到发明目的：一种用于电力驱动汽车的插电式电池充电装置，包括电池组和双向逆变器，电池组的正极和负极分别连接双向逆变器的直流端，双向逆变器的另一端为三相交流端，其特征是：还包括充电控制开关、电感、三相交流电连接插件、驱动电机和电机控制器，双向逆变器的三相交流端分别连接充电控制开关的三个输入端和三相交流电连接插件，充电控制开关的三个输出端各自连接一个电感并连接外接交流电源，三相交流电连接插件连接驱动电机，电机控制器通过信号线分别连接双向逆变器、充电控制开关和驱动电机。所述的用于电力驱动汽车的插电式电池充电装置，其特征是：驱动电机选用永磁同步电机，电机控制器选用数字信号处理器或单片机。所述的用于电力驱动汽车的插电式电池充电装置的使用方法，其特征是：按如下步骤依次进行：当需要汽车正常行驶时，电机控制器切换至行驶模式，行驶模式的步骤是：用三相交流电连接插件连接双向逆变器的三相交流端和驱动电机，经电池组输入的直流电经双向逆变器逆变成三相交流电输出，电机控制器控制充电控制开关断开并使驱动电机投入运行；当汽车停止行驶需要充电时，电机控制器切换至充电模式，充电模式的步骤是：电机控制器控制驱动电机停机，断开三相交流电连接插件以解除双向逆变器的三相交流端和驱动电机的连接，电感的另一端连接外接交流电源，电机控制器控制充电控制开关闭合，双向逆变器和电感组成脉冲宽度调制整流（即pulse width modulation，简称PWM）电路，外接交流电源的交流电经脉冲宽度调制整流电路整流成直流电后向电池组充电。所述的用于电力驱动汽车的插电式电池充电装置的使用方法，其特征是：外接交流电源为单相交流电或三相交流电，选用单相交流电时，外接电源的频率为50Hz，电压有效值为220V，外接电源的两极分别连接三个电感中的任意两个；选用三相交流电时，外接电源的频率为50Hz，电压有效值为380V，外接电源的三极分别连接三个电感。本发明利用双向逆变器的特点，通过电机控制器切换工作模式，即可实现外接电网为电池充电，输出的直流电压和电流都可控，外接单相交流电时构成单相整流器，外接三相交流电时构成三相整流器，充电过程中电机控制器可根据电池组荷电状态（即state of charge，简称SOC）的变化选择不同的充电控制模式，如恒流充电或恒压充电，从而省去了车载电池充电装置。本发明的有益效果是：简化系统结构，降低成本，充电控制性好。"
  },
  {
    "专利名": "用于电力驱动汽车的数字型双向直流／直流转换器",
    "申请号": "CN201120551255.9",
    "公开日": "20120926",
    "IPC 分类号": "H02M3/335",
    "申请人": "上海大郡动力控制技术有限公司",
    "关键词": "数字型双向直流/直流转换器、功率管、电流传感器、电压传感器、电力驱动汽车、直流电源、电机控制器、电流传感器",
    "摘要": "本实用新型涉及带有中间变换为交流的直流功率输入变换为直流功率输出设备领域，具体为一种用于电力驱动汽车的数字型双向直流／直流转换器。一种用于电力驱动汽车的数字型双向直流／直流转换器，包括直流电源（１）和电机控制器（２），其特征是：还包括功率管、电感、电容（５）、电流传感器（６）和电压传感器（７），电感甲（４１）、电感乙（４２）和电感丙（４３）的一端都通过导线连接直流电源（１）的正极，电感甲（４１）的另一端通过串联一个电流传感器（６）和功率管甲（３１）的源极连接，功率管甲（３１）的源极还和功率管乙（３２）的漏极连接。本实用新型可调范围宽，运行稳定，结构紧凑。",
    "说明书": "用于电力驱动汽车的数字型双向直流/直流转换器技术领域本实用新型涉及带有中间变换为交流的直流功率输入变换为直流功率输出设备领域，具体为一种用于电力驱动汽车的数字型双向直流/直流转换器。背景技术新能源汽车正日益得到广泛应用，新能源汽车普遍采用电机驱动，由直流电源输出的直流电经逆变器逆变成三相交流电后输入电机，电机驱动汽车行驶，同时再配以电机控制器以控制同步电机的运行，控制回路中通常需设有直流/直流（即DC/DC）变换，直流电源可以采用高压电池组、燃料电池、超级电容等，尤其是超级电容正以其充电速度快、循环使用寿命长等优势获得青睐。但是，现有的电机在电压低时效率显著降低甚至无法运行，这就导致超级电容内的能量无法完全释放。现有的电机控制方案中，双向DC/DC变换多采用模拟电源控制，可调电压范围小，动态响应慢，单路或者双路降压-升压（即buck-boost）电路输出电流和输出电压纹波大，输出功率较小。实用新型内容为了克服现有技术的缺陷，提供一种的可调范围宽、动态响应迅速、电流和电压输出稳定、功率输出大的电机控制设备，本实用新型公开了一种用于电力驱动汽车的数字型双向直流/直流转换器。本实用新型通过如下技术方案达到发明目的：一种用于电力驱动汽车的数字型双向直流/直流转换器，包括直流电源和电机控制器，其特征是：还包括功率管、电感、电容、电流传感器和电压传感器，功率管共有六个，电感共有三个，电流传感器共有三个，电压传感器共有两个，电感甲、电感乙和电感丙的一端都通过导线连接直流电源的正极；电感甲的另一端通过串联一个电流传感器和功率管甲的源极连接，功率管甲的源极还和功率管乙的漏极连接，功率管甲的漏极通过导线连接电机控制器的正电平信号输入端；电感乙的另一端通过串联一个电流传感器和功率管丙的源极连接，功率管丙的源极还和功率管丁的漏极连接，功率管丙的漏极通过导线连接电机控制器的正电平信号输入端；电感丙的另一端通过串联一个电流传感器和功率管戊的源极连接，功率管戊的源极还和功率管己的漏极连接，功率管戊的漏极通过导线连接电机控制器的正电平信号输入端；功率管乙的源极、功率管丁的源极和功率管己的源极都通过导线连接电机控制器的负电平信号输入端，功率管乙的源极还连接直流电源的负极；直流电源的正极和负极之间并联一个电压传感器，电机控制器的正电平信号输入端和负电平信号输入端之间并联电容和一个电压传感器；电机控制器的信号输出端分别连接功率管甲的栅极、功率管乙的栅极、功率管丙的栅极、功率管丁的栅极、功率管戊的栅极和功率管己的栅极。所述的用于电力驱动汽车的数字型双向直流/直流转换器，其特征是：直流电源选用超级电容。所述的用于电力驱动汽车的数字型双向直流/直流转换器，其特征是：电机控制器选用数字信号处理器或单片机。本实用新型的主回路由三路相同的buck-boost电路并联而成，每一路都由两个功率管和一个电感组成，是三相交错式脉冲宽度调制（即pulse width modulation，简称PWM）的一种双向DC/DC控制器。本实用新型中在直流电源端和电机控制端都用电压传感器检测电压，在三相中的每一相上都串联电流传感器检测电流，检测到的电压值和电流值经电机控制器处理后向功率管输出PWM信号用于主回路的控制。本实用新型可以改善DC/DC输出性能，提高输出功率，使得电机的输入电压稳定，能够最大限度提升超级电容的电压使用范围和最大电流能力，加大超级电容的运行区间。本实用新型的有益效果是：可调范围宽，动态响应迅速，电流和电压输出稳定，功率输出大，运行稳定，故障率低，结构紧凑，安装方便。"
  },
  {
    "专利名": "一种电力驱动汽车",
    "申请号": "CN201120013718.6",
    "公开日": "20110803",
    "IPC 分类号": "B62D21/15;B60N2/42;B60R19/42;B60T1/04;B60R19/02",
    "申请人": "王超",
    "关键词": "蓄电池、电动机、发电机、风力发电机\n、电力驱动汽车、自动电池补充",
    "摘要": "本实用新型公开了一种电力驱动汽车，包括驾驶室、车厢、前轮和后轮，其特征在于：所述车厢的底部设有蓄电池，所述后轮的驱动轴连接有一个驱动用的电动机和发电机，所述电动机和发电机均与蓄电池相连接；所述车厢的底部还设有若干个风力发电机，所述风力发电机均与蓄电池相连。本实用新型取得的有益效果是：（１）以车载蓄电池中的电能为动力源，因而清洁干净，无尾气排放，不会污染环境；（２）后轮带动发电机运转发电，因而能在行进的过程中自动向蓄电池补充部分电能；（３）车厢的底部设有若干个风力发电机，风力发电机在汽车运行的过程中借助风力发电，因而能进一步补充部分电能。",
    "说明书": "一种电力驱动汽车技术领域本实用新型涉及一种汽车，特别是一种电力驱动汽车。背景技术目前现有的汽车，主要是以汽油或柴油为燃料，尾气排放较大，因而污染环境。为了减少污染，市场上也出现了电动汽车，现有的电动汽车，以蓄电池或其它类型的电池为动力源，虽然解决了环境污染的问题，但是由于电池的容量有限，续航能力差，因而大大制约了电动汽车的发展。发明内容本实用新型要解决的问题是：提供一种不会污染环境并能自动补充部分电能因而续航能力强的电力驱动汽车。为了解决上述技术问题，本实用新型的电力驱动汽车，包括驾驶室、车厢、前轮和后轮，其特征在于：所述车厢的底部设有蓄电池，所述后轮的驱动轴连接有一个驱动用的电动机和发电机，所述电动机和发电机均与蓄电池相连接。为了进一步提高汽车的续航能力，增加补充电能的途径，本实用新型的电力驱动汽车，所述车厢的底部还设有若干个风力发电机，所述风力发电机均与蓄电池相连。本实用新型取得的有益效果是：(1)以车载蓄电池中的电能为动力源，因而清洁干净，无尾气排放，不会污染环境；(2)后轮带动发电机运转发电，因而能在行进的过程中自动向蓄电池补充部分电能；(3)车厢的底部设有若干个风力发电机，风力发电机在汽车运行的过程中借助风力发电，因而能进一步补充部分电能。"
  },
  {
    "专利名": "ZFP36L2基因在治疗和/或预防辐射损伤中的应用",
    "申请号": "CN202411146999.0",
    "公开日": "20240917",
    "IPC 分类号": "C12N5/10;A61P39/00;A61K49/00;C12N15/867;C12N15/12;A01K67/0271;A61K48/00",
    "申请人": "核工业四一六医院",
    "关键词": "基因应用、药物制备、细胞实验、免疫炎症反应、生物医学、ZFP36L2基因、辐射损伤",
    "摘要": "本发明属于生物医学领域，特别涉及ZFP36L2基因在治疗和/或预防辐射损伤中的应用。该应用为ZFP36L2在如下（A1）或（A2）或（A3）中的应用：（A1）制备治疗和/或预防辐射损伤的药物；（A2）制备抵抗辐射引起的线粒体功能障碍的药物；（A3）制备治疗辐射引起的血管内皮损伤的药物。实验证明，通过调整巨噬细胞中ZFP36L2的表达水平可以抵抗辐射引起的线粒体功能障碍，体外实验验证ZFP36L2过表达的巨噬细胞上清液显著改善了HUVEC在辐照条件下的划痕愈合能力；进一步实验证明ZFP36L2过表达的巨噬细胞能够显著减轻接受移植的小鼠在辐射环境下腹腔组织的损伤，并具有抑制免疫炎症反应的能力，这为未来开发潜在的治疗策略提供了科学基础，具备广阔的临床应用前景。",
    "说明书": "ZFP36L2基因在治疗和/或预防辐射损伤中的应用技术领域本发明涉及生物医学领域，具体而言，涉及ZFP36L2基因在治疗和/或预防辐射损伤中的应用。背景技术辐射，作为一种强烈的环境应激因子，对生物体的细胞和组织结构能造成广泛的破坏。在机体面对辐射引发的应激反应中，巨噬细胞发挥着至关重要的双重角色：一方面促进受损组织的修复，另一方面在某些情况下可能加剧损害。值得注意的是，巨噬细胞的线粒体功能在其代谢状态和免疫功能调节中起着核心作用。此外，巨噬细胞与实质细胞的相互作用复杂而深刻，显著塑造了机体对辐射伤害的响应与恢复过程。在分子层面，ZFP36L2（Zinc finger protein 36, C3H type-like 2）属于ZFP36蛋白家族，承担着调节RNA后转录过程的关键任务。该蛋白通过其特有的锌指结构精准地维护基因表达的稳定性。免疫调控方面，已有研究表明ZFP36家族能显著影响T细胞的信使RNA的稳定性，从而抑制T细胞的增殖及活化。在维持线粒体功能方面，ZFP36L2能通过调控线粒体的融合与分裂过程，有效地缓解细胞在缺氧环境下的损伤。但ZFP36L2基因在治疗和/或预防辐射损伤方面的效果还未见报道。发明内容本发明的目的在于提供ZFP36L2基因在治疗或预防辐射损伤中的应用。发明人在研究中令人意外地发现，通过调整巨噬细胞中ZFP36L2的表达水平，可以抵抗辐射诱导的巨噬细胞线粒体功能障碍，减轻辐射引起的细胞损伤和系统性炎症反应。基于此，发明人完成了以下发明。本发明的第一方面在于提供ZFP36L2在如下（A1）或（A2）或（A3）中的应用：（A1）制备治疗和/或预防辐射损伤的药物；（A2）制备抵抗辐射引起的线粒体功能障碍的药物；（A3）制备治疗辐射引起的血管内皮损伤的药物。在该应用中，所述药物包含促进ZFP36L2表达的试剂；本发明人是通过ZFP36L2过表达慢病毒在实验中发现的结果，但本领域人员清楚地知道，其他促进ZFP36L2表达的试剂例如小分子化合物或生物活性分子，也可以容易地获得同样结果或近似的效果。基于此，采用其他可以促进ZFP36L2表达的试剂也是属于本发明的保护范围。在该应用中，所述试剂包括ZFP36L2过表达的生物材料；本发明人是通过ZFP36L2过表达慢病毒在实验中发现的结果，但本领域人员清楚地知道，除了ZFP36L2过表达慢病毒载体外，其他ZFP36L2过表达的生物材料，例如ZFP36L2过表达的重组质粒或腺相关病毒，也可以容易地获得同样结果或近似的效果。基于此，采用其他ZFP36L2过表达的生物材料也是属于本发明的保护范围。在该应用中，所述生物材料包括以下（1）～（4）任一项所述的物质：（1）ZFP36L2基因，其核苷酸序列如SEQ ID NO .1所示；（2）质粒，包括所述ZFP36L2基因；（3）慢病毒，包括所述质粒；（4）宿主细胞，包括所述质粒或慢病毒；根据本发明的实施例，所述质粒为pGPG-Lenti CMV Puro；所述慢病毒的包装质粒为psPAX和pMD2.G；所述宿主细胞为293T细胞或巨噬细胞时，可以取得较优的效果。在该应用中，所述药物治疗和/或预防辐射损伤是通过如下（B1）或（B2）或（B3）实现的：（B1）抵抗辐射引起的线粒体功能障碍；（B2）治疗辐射引起的血管内皮损伤；（B3）减轻辐射引起的细胞损伤和系统性炎症反应。进一步的，所述抵抗辐射引起的线粒体功能障碍是通过ZFP36L2过表达减轻辐射诱导的线粒体肿胀和空泡化，并降低线粒体活性氧的积累实现的。所述治疗辐射引起的血管内皮损伤是通过ZFP36L2过表达提高人脐静脉内皮细胞的划痕愈合能力和成血管能力，减少细胞凋亡实现的；本发明首次提出通过促进ZFP36L2表达实现治疗和/或预防辐射损伤。本发明的第二方面提供在于提供治疗和/或预防辐射损伤药物，所述药物包括ZFP36L2过表达的生物材料和药学上可接受的辅料；本领域人员可以理解的是，所述的辅料包括但不限于：稳定剂，用于维持ZFP36L2过表达的生物材料的结构完整性和稳定性，例如葡萄糖、甘油等；转染增强剂，用于增强ZFP36L2过表达的生物材料进入细胞的效率，例如聚乙烯亚胺；保护剂，用于保护ZFP36L2过表达的生物材料在制备和贮存过程中的稳定性和活性，例如低温稳定剂、缓冲剂；溶剂和调节剂，用于调节ZFP36L2过表达的生物材料的溶解性和药物制剂的制备过程，例如水、盐酸。在该药物中，所述生物材料包括以下（1）～（4）任一项所述的物质： (1)ZFP36L2基因，其核苷酸序列如SEQ ID NO.1所示；（2）质粒，包括所述ZFP36L2基因；（3）慢病毒，包括所述质粒；（4）宿主细胞，包括所述质粒或慢病毒；根据本发明的实施例，所述质粒为pGPG-Lenti CMV Puro；所述慢病毒的包装质粒为psPAX和pMD2.G；所述宿主细胞为293T细胞或巨噬细胞时，取得较优的效果。本发明的第三方面在于提供一种ZFP36L2过表达抵御辐射损伤的巨噬细胞移植小鼠模型在筛选治疗和/或预防辐射损伤药物中的应用。在机体面对辐射引发的应激反应中，巨噬细胞作为免疫的主要防线，在辐射损伤中扮演着复杂的角色，本发明首次提出了通过促进ZFP36L2表达构建抵御辐射损伤的巨噬细胞移植小鼠模型，该模型将有助于推动更多辐射损伤相关药物的研究，为治疗和/或预防辐射损伤药物的研发和靶点研究提供模型基础。在该应用中，所述巨噬细胞移植小鼠模型的构建包括以下步骤：S1、构建ZFP36L2过表达的质粒，ZFP36L2的基因序列片段如SEQ ID NO.1所述的，将基因序列通过5' XbaI和3'SalI克隆至载体pGPG-Lenti CMV Puro中，并对ZFP36L2过表达质粒进行慢病毒包装；S2、从供体小鼠中提取原代腹腔巨噬细胞培养，通过上述慢病毒感染ZFP36L2过表达，筛选ZFP36L2稳定表达的腹腔巨噬细胞，并给予辐照刺激；将辐照后的腹腔巨噬细胞回输到受体小鼠的腹腔中，获得巨噬细胞移植小鼠模型。本发明的显著优点在于：本发明首次揭示了ZFP36L2过表达在减缓辐射损伤中的作用。通过调整巨噬细胞中ZFP36L2的表达水平可以抵抗辐射引起的线粒体功能障碍，体外实验验证ZFP36L2过表达的巨噬细胞上清液显著改善了HUVEC在辐照条件下的划痕愈合能力；本发明进一步通过巨噬细胞移植小鼠实验，证明了ZFP36L2过表达的巨噬细胞能够显著减轻接受移植的小鼠在辐射环境下腹腔组织的损伤，并具有抑制免疫炎症反应的能力，为未来开发潜在的治疗策略提供了科学基础，具备广阔的临床应用前景。"
  },
  {
    "专利名": "一种具备配准和追踪功能的可穿戴柔性脑磁帽",
    "申请号": "CN202411090903.3",
    "公开日": "20240906",
    "IPC 分类号": "A61B5/386;A61B5/245;A61B5/256;A61B5/00;A61B5/369;A61B5/291",
    "申请人": "北京航空航天大学",
    "关键词": "可穿戴柔性脑磁帽、脑电10-10导联系统、三维定位标记球、磁强计配准、传感器布局、轻量化设计、佩戴舒适、定位准确、脑磁测量、头型适配",
    "摘要": "本发明提供一种具备配准和追踪功能的可穿戴柔性脑磁帽，属于生物医学领域，由柔性帽体、卡槽、支架和支座四部分组成；柔性帽体外表面按照国际通用脑电10-10导联系统设置标记点用作传感器布局，共64通道，完整覆盖各个脑功能区；卡槽设有3个三维的定位标记球，可以对三轴磁强计进行准确的配准和追踪；支架用于固定传感器、支座以及卡槽；支座按照柔性帽体外表面标记点进行布置，用于配合柔性帽体以及支架。本发明提出的测量人脑部磁信号的可穿戴式柔性帽，适用于各类人群的头型，且能为传感器的配准和追踪提供合作目标，具有轻量化、低成本、佩戴舒适、定位准确的优点，是一种高效可靠的脑磁测量工具。",
    "说明书": "一种具备配准和追踪功能的可穿戴柔性脑磁帽技术领域本发明属于生物医学工程领域，具体涉及一种具备配准和追踪功能的可穿戴柔性脑磁帽。背景技术脑磁图（Magnetoencephalography, MEG）是一种无创功能成像技术，通过检测大脑活动产生的微弱磁场，提供高时间和空间分辨率的脑功能信息，有助于临床诊断和基础神经科学，被广泛应用于大脑源定位、脑网络研究和神经疾病等研究。由于头皮处的磁场信号极其微弱，其强度在飞特斯拉（fT）量级，传统测量脑磁信号的设备采用超导量子干涉仪装置(Superconducting quantum interference devices,SQUIDs)，该装置的传感器需要浸泡在液氮中冷却到4K(-269℃)才能正常工作，这导致了高昂的维护成本，且低温限制了传感器与头皮的间距，降低了采集信号的信噪比；另外，SQUID使用刚性头盔，难以适配不同头型的测量需求。随着量子精密测量技术的发展，基于无自旋交换弛豫的光泵磁强计(OPM)取得了显著进展。相较于“笨重”的SQUID，OPM具有无需低温操作、操作简单、便携性强和成本低等优势，能够靠近头皮测量，从而获得更大的信噪比，其灵敏度接近SQUID，正逐渐在神经科学研究和临床应用中取代传统的SQUID设备。由于OPM满足可穿戴设计要求，目前现有的装配OPM的脑磁帽分为刚性头盔和柔性帽两种。刚性头盔为固定式设计，难以适配多种头型，因而传感器距离头皮的距离较大，测量信号的幅值较低且更易受到干扰；柔性帽则可以适应不同头型，保证传感器与头皮的紧密接触，提高测量的准确性和可靠性，同时提供更舒适的佩戴体验，但往往需要人工完成配准工作，流程繁琐且误差较大。配准和追踪在脑磁图技术中至关重要。准确的配准是实现精确源定位的前提条件，而在实验过程中，传感器和头部的位置可能会发生相对位移，实时追踪可以进一步提高配准精度；此外，运动伪影校正需要传感器的空间信息，追踪能够有效去除运动伪影，提高信号的信噪比。如果能够提高柔性帽上传感器的定位精度，并实现传感器的实时追踪与自动配准，将会显著提高其实用性，进一步推动脑磁图技术的发展。发明内容目前用于测量脑磁信号的刚性头盔或柔性帽只能满足配准的要求，没有解决线缆遮挡问题，且配准过程非常繁琐，为解决这一难题，本发明提供了一种具备配准和追踪功能的可穿戴柔性脑磁帽，适用于各类人群的头型，能实现传感器的实时配准与追踪，具有轻量化、低成本、佩戴舒适、定位准确的优点，是一种高效可靠的脑磁测量工具。为达到上述目的，本发明采用的技术方案是：一种具备配准和追踪功能的可穿戴柔性脑磁帽，包括柔性帽体、卡槽、支架和支座；根据国际通用脑电10-10导联系统在帽体外表面作标记点，进行若干个传感器的布局，覆盖各个脑功能区，共64通道，实验人员可在标记处按需进行传感器的布置和安装；柔性帽体上设有粘扣带，用于收紧帽体，与被试头部固定，可以根据需要调整松紧，确保佩戴的舒适性和稳定性；卡槽用于固定和容纳传感器，其包括三角平台、标记小球、收纳槽、卡槽主体和卡扣；三角平台与卡槽主体之间用圆柱连接，用于放置标记小球；三个标记小球分别放置于三角平台的3个顶点处，用于传感器的配准与追踪；收纳槽位于卡槽主体的侧面，用于收纳传感器线缆，避免其在实际测量脑磁信号的过程中遮挡标记小球；卡槽主体与传感器主体配合固定，且卡槽主体一侧边开口，使传感器线缆能从中穿过，避免在实际使用时因传感器线缆过长导致装配不便；卡扣位于卡槽主体的另一侧面，用于因打印误差导致的卡槽与传感器之间间隙过大时将二者扣紧，保证传感器不发生位移；支架由圆弧形外壁、夹板和支架底座组成；圆弧形外壁根据传感器的外形开有沉头孔，与支架底座共同与传感器配合使其固定；夹板与卡槽的开槽配合使其固定；支座整体呈圆柱形，由缝制部分和旋转卡槽组成；缝制部分对称布置于圆柱形外围，以缝制的方式连接柔性帽体；旋转卡槽与支架底座外壁的旋转卡扣配合，用于连接支架。进一步地，参考不同年龄段的儿童和成人的头围(定义为从眉间点为起点，经枕后点至起点的围长)，柔性帽体根据不同的头部尺寸分为S、M和L三个型号，分别适用于头围48-52厘米，52-56厘米，56-60厘米的佩戴者，满足年满6周岁及以上的儿童和成人的测量需求。进一步地，卡槽使用3个三维的标记小球用于配准，其分别处于三角平台的顶点上；标记小球表面上涂有反光漆，配准时布置多台工业相机捕捉其反射而来的光线从而确定标记小球的位置，由于标记小球所处的平面平行于传感器的平面，故定位三角平台长边的两个标记小球即可确定传感器的X轴，定位短边的两个标记小球可确定传感器的Y轴，X轴方向的向量叉乘Y轴方向的向量可得到Z轴方向的向量，从而确定传感器的Z轴，然后根据标记小球与传感器之间、传感器与传感器气室已知的数学关系即可得到传感器与其气室所在的位置，为后续与核磁影像的配准与运动伪影的矫正工作提供传感器的空间信息。进一步地，卡槽设有收纳槽用于传感器线缆的收纳，传感器线缆从收纳槽中穿过，并自然向下垂落，避免遮挡标记小球，其与卡槽主体的连接处设有加强筋以提高强度，增加使用寿命；卡槽主体与传感器主体配合，用于固定传感器，二者之间过渡配合，保证紧密结合且避免松动和位移，同时方便传感器的安装和拆卸。进一步地，支架与卡槽、传感器和支座均有配合，由圆弧形外壁、夹板和支架底座组成；圆弧形外壁内部根据传感器外形开孔与传感器配合以限制其X和Y方向上的平动和转动4个自由度，支架底座用于支撑传感器，限制其Z方向上的平动和转动2个自由度，从而限制其6个方向上的自由度使其完全固定；夹板上设有钩状突起，与卡槽上的开槽配合使其固定；支架底座外壁设有旋转卡扣与支座配合，使其能连接支座，同时在标记小球因角度偏差导致无法被相机捕捉时能调节自身的方向，提高配准的准确性。进一步地，支座用于连接支架与柔性帽体，由缝制部分和旋转卡槽组成；缝制部分呈纽扣形，其中心处开有4个对称分布的直径为1mm的圆孔，使用高强线以缝制的方法穿过该圆孔与柔性帽体进行连接；旋转卡槽用于连接支架，该结构使其能旋转自身的位置，以最佳的角度进行配合，从而增加了连接的灵活性。进一步地，柔性帽体选用弹性布为原料进行制作，保障其具有良好的收缩性以贴合头部，使传感器离被试头皮距离最小；卡槽和支架选择耐温隔热特性较好且具有一定柔韧性的材料进行3D打印，实现与传感器的良好配合的同时避免烫伤被试者；支座选择弹性适中的软胶材料进行制作，使其与柔性帽体之间配合度更高，同时能稳定地固定支架。进一步地，在实际测量过程中，首先根据被试头围挑选合适型号的柔性帽体，选择感兴趣的大脑待测区域，在该区域的标记点处依次连接支座、支架、传感器、卡槽，将传感器线缆置入收纳槽，在场地内架起多台相机用于识别标记小球的位置，调节卡槽和相机的位置，使标记小球能被最大程度地捕捉，实现传感器与核磁影像的配准与传感器空间位置的追踪，随后进行脑磁信号的测量。本发明的有益效果在于：采用普适性更强的柔性帽进行设计，能最大程度地缩小传感器与头皮之间地距离，提高测量数据的准确性和可靠性；设计了三种不同型号的柔性帽，可以适应不同头型，能满足各类人群的测量需求；使用三维标记小球与工业相机实现传感器与核磁影像的自动配准与传感器空间位置的追踪，简化实验流程的同时降低了测量误差；设置了收纳槽放置传感器线缆，避免线缆遮挡和干扰，增强了实验的可操作性；本发明提供的能实现自动配准与追踪的多型号柔性脑磁帽方案，能做到传感器与头皮的紧密接触，无需人工标记传感器位置，能满足轻量化、低成本、佩戴舒适、定位准确的实际需求。"
  },
  {
    "专利名": "一种可自组装的重组胶原蛋白及其制备方法与应用",
    "申请号": "CN202411045813.2",
    "公开日": "20240830",
    "IPC 分类号": "C12N15/53;C07K14/78;C12R1/84;C12N15/81;A61L27/58;A61L27/24;A61K47/42;C12N9/02;C12N15/12",
    "申请人": "英特菲尔（成都）生物制品有限责任公司",
    "关键词": "可自组装、重组胶原蛋白、基因工程技术、核苷酸序列优化、GAP启动子设计、共表达、毕赤酵母表达系统、稳定性、自组装特性、人源化胶原蛋白产品、异源性过敏反应风险、工业化生产、生物医学、胶原蛋白",
    "摘要": "本申请公开了一种可自组装的重组胶原蛋白及其制备方法与应用，涉及基因工程技术领域。一种可自组装的重组胶原蛋白，所述重组胶原蛋白的氨基酸序列是以人源Ⅲ型胶原蛋白片段为基础单元重复串联14次后所得，所述重组胶原蛋白的氨基酸序列如Seq ID NO.1所示。通过优化核苷酸序列、设计GAP启动子以及与羟脯氨酸酶基因的共表达，本申请利用毕赤酵母表达系统生产出了稳定的、具有自组装特性的重组人源化胶原蛋白产品，避免了异源性过敏反应风险。该重组胶原蛋白可稳定工业化生产，在生物医学领域具有广泛的应用前景。",
    "说明书": "一种可自组装的重组胶原蛋白及其制备方法与应用技术领域本申请涉及基因工程技术领域，特别涉及一种可自组装的重组胶原蛋白及其制备方法与应用。背景技术胶原蛋白是人体内多种组织的重要成分，普遍存在于细胞外基质中，发挥着组织连接、细胞支持、信息传递等重要作用。具有自组装特性的胶原蛋白成膜性、黏附性均优于无自组装特性的胶原蛋白，且具有自组装特性的胶原蛋白所制备的膜、支架、凝胶等材料具有机械强度高的优点，是理想的组织替代材料，可用于人造骨骼、人造关节、人造牙齿、人工瓣膜、人造血管以及人造皮肤等。胶原蛋白的本质是三螺旋结构，其是胶原分子自组装发生的必要条件。胶原蛋白的自组装过程复杂，受多种因素影响，如溶液条件、温度、pH值等。而重组胶原蛋白的大规模生产需要高效的生产工艺和质量控制措施。目前的表达系统可能存在产量低、成本高的问题，且在保持胶原蛋白天然结构和功能方面存在挑战。因此，合成生物学重组蛋白对自组装过程的精确控制和调节仍然有限，很难实现重组胶原蛋白的自组装，导致目前组织工程材料依然采用天然动物提取胶原蛋白，存在异源性过敏反应风险。基于此，本申请提出一种可自组装的重组胶原蛋白及其制备方法与应用。发明内容本申请的主要目的是提供一种可自组装的重组胶原蛋白及其制备方法与应用，旨在解决现有的重组胶原蛋白难以实现自组装的技术问题。为实现上述目的，本申请提出了一种可自组装的重组胶原蛋白，所述重组胶原蛋白的氨基酸序列是以人源Ⅲ型胶原蛋白片段为基础单元重复串联14次后所得，所述重组胶原蛋白的氨基酸序列如Seq ID NO.1所示。可选地，所述重组胶原蛋白的基因序列如Seq ID NO.2所示。本申请还提出了一种可自组装的重组胶原蛋白的制备方法，包括以下步骤：根据毕赤酵母宿主密码子偏好性，对编码所述重组胶原蛋白的基因序列进行优化设计，获得如Seq ID NO.2所示的重组胶原蛋白的基因序列；根据所述重组胶原蛋白的基因序列和毕赤酵母表达质粒pGAPZαA，构建重组质粒pGAPZαA-C3014；以拟病毒P4H作为脯氨酸羟化酶的氨基酸序列，根据毕赤酵母宿主密码子偏好性优化设计后，获得如Seq ID NO.5所示的脯氨酸羟化酶的基因序列；根据所述脯氨酸羟化酶的基因序列和毕赤酵母表达质粒pPIC3.5K，构建重组质粒pPIC3.5K-P4H；设计GAP启动子引物，并通过酶切位点插入所述重组质粒pPIC3.5K-P4H，获得重组质粒pGAP3.5K-P4H；对所述重组质粒pGAPZαA-C3014进行酶切线性化，获得线性化质粒pGAPZαA-C3014；将所述线性化质粒pGAPZαA-C3014电转化至毕赤酵母GS115感受态细胞，经过培养和阳性转化子筛选，获得重组人源化胶原蛋白酵母工程菌；对所述重组质粒pGAP3.5K-P4H进行酶切线性化，获得线性化质粒pGAP3.5K-P4H；以所述重组人源化胶原蛋白酵母工程菌制备重组工程菌感受态细胞，将所述线性化质粒pGAP3.5K-P4H电转化至所述重组工程菌感受态细胞，经过培养和共表达阳性转化子筛选，获得重组胶原蛋白酵母工程菌GS115/pGAP9K-C3014_P4H；对所述重组胶原蛋白酵母工程菌GS115/pGAP9K-C3014_P4H进行诱导表达，获得蛋白表达量最高的工程菌，再进行高密度发酵，离心收集发酵上清；将所述发酵上清纯化处理后，获得重组胶原蛋白原液。可选地，所述根据所述重组胶原蛋白的基因序列和毕赤酵母表达质粒pGAPZαA，构建重组质粒pGAPZαA-C3014的步骤，包括：根据所述重组胶原蛋白的基因序列进行基因片段合成，并将合成的基因片段插入毕赤酵母表达质粒pGAPZαA上的酶切位点Xho Ⅰ和Not Ⅰ之间，获得重组质粒pGAPZαA-C3014。可选地，所述根据所述脯氨酸羟化酶的基因序列和毕赤酵母表达质粒pPIC3.5K，构建重组质粒pPIC3.5K-P4H的步骤，包括：根据所述脯氨酸羟化酶的基因序列进行基因片段合成，并将合成的基因片段插入毕赤酵母表达质粒pPIC3.5K上的酶切位点EcoR Ⅰ和Not Ⅰ之间，获得重组质粒pPIC3.5K-P4H。可选地，所述设计GAP启动子引物，并通过酶切位点插入所述重组质粒pPIC3.5K-P4H，获得重组质粒pGAP3.5K-P4H的步骤，包括：设计GAP启动子引物并进行合成，合成条件包括：上游引物GAP-F；下游引物GAP-R；PCR条件：98℃预变性，5min，98℃热变性50s，58℃退火30s，72℃延伸60s，35个循环；72℃复性10min；对合成的PCR基因片段进行测序，验证通过后插入所述重组质粒pPIC3.5K-P4H上的酶切位点SacⅠ和BamHⅠ之间，获得重组质粒pGAP3.5K-P4H。可选地，所述对所述重组质粒pGAPZαA-C3014进行酶切线性化，获得线性化质粒pGAPZαA-C3014的步骤，包括：采用QuickCut BglⅡ对所述重组质粒pGAPZαA-C3014进行酶切线性化处理，酶切温度为37℃，酶切时间为5h，再加入3M NaAc和无水乙醇，在-20℃下放置过夜后，在4℃、13000rpm的条件下离心20min，弃上清液，收集得到沉淀物并采用75%乙醇漂洗，再次进行离心并弃上清液，将所收集的沉淀物中的水分和残留乙醇去除后，采用ddH2可选地，所述将所述线性化质粒pGAPZαA-C3014电转化至毕赤酵母GS115感受态细胞，经过培养和阳性转化子筛选，获得重组人源化胶原蛋白酵母工程菌的步骤，包括：将所述线性化质粒pGAPZαA-C3014与毕赤酵母GS115感受态细胞混合，冰浴后，进行电击，再加入山梨醇溶液，混匀后，转移至无菌EP管中，经30°C静置孵育1h-2h后，涂布于含有Zeocin的YPD平板上，室温静置10min，再经30℃倒置培养2d-5d，直至长出单菌落；挑取所述YPD平板上的单菌落，转移至含有Zeocin的YPD培养基的96孔培养板中，于30℃继续培养，以筛选获得重组人源化胶原蛋白酵母工程菌。可选地，所述对所述重组质粒pGAP3.5K-P4H进行酶切线性化，获得线性化质粒pGAP3.5K-P4H的步骤，包括：采用SacⅠ对所述重组质粒pGAP3.5K-P4H进行酶切线性化处理，酶切温度为37℃，酶切时间为5h，再加入3MNaAc和无水乙醇，在-20℃下放置过夜后，在4℃、13000rpm的条件下离心20min，弃上清液，收集得到沉淀物并采用75%乙醇漂洗，再次进行离心并弃上清液，将所收集的沉淀物中的水分和残留乙醇去除后，采用ddH2可选地，所述以所述重组人源化胶原蛋白酵母工程菌制备重组工程菌感受态细胞的步骤，包括：将所述重组人源化胶原蛋白酵母工程菌平板划线后挑取单菌落接种于YPD固体培养基，在30℃、225rpm的条件下培养24h；再以1：1000的接种比例转接于YPD液体培养基，并在30℃、225rpm的条件下培养至OD600nm用50mL无菌超纯水重新悬浮菌体，并在4℃、1500rpm的条件下离心5min，弃上清后，再用50mL无菌超纯水重新悬浮菌体，并在4℃、1500rpm的条件下离心5min，弃上清后，再用40mL无菌1M山梨醇重新悬浮细胞沉淀；再在4℃、1500rpm的条件下离心5min，弃上清后，用100μL-150μL无菌1M山梨醇重新悬浮细胞沉淀，旋转混匀后，置于冰上，获得重组工程菌感受态细胞。可选地，所述将所述线性化质粒pGAP3.5K-P4H电转化至所述重组工程菌感受态细胞，经过培养和共表达阳性转化子筛选，获得重组胶原蛋白酵母工程菌GS115/pGAP9K-C3014_P4H的步骤，包括：将所述线性化质粒pGAP3.5K-P4H与所述重组工程菌感受态细胞混合，冰浴后，进行电击，再加入山梨醇溶液，混匀后，转移至无菌EP管中，经30°C静置孵育1h-2h后，涂布于MD固体平板，室温静置10min，再经30℃倒置培养2d-5d，直至长出单菌落；刮下所述MD固体平板上的His+可选地，所述对所述重组胶原蛋白酵母工程菌GS115/pGAP9K-C3014_P4H进行诱导表达，获得蛋白表达量最高的工程菌的步骤，包括：挑取在含4mg/mL的G418的平板上生长的单菌落接种于YPD培养基，在30℃、250rpm的条件下培养至OD600nm可选地，所述进行高密度发酵，离心收集发酵上清的步骤，包括：将发酵培养基加入发酵罐中，将所述发酵罐置于蒸汽灭菌锅中并于121℃下灭菌15 min，冷却后标定电极，等待接种；将所述蛋白表达量最高的工程菌接种于YPD液体培养基中，于30℃、220rpm的条件下培养过夜，获得初级种子液；将所述初级种子液按照1%（v/v）的接种量接种至YPD液体培养基中，放大培养至OD600nm将所述次级种子液按照10%（v/v）的接种量接种至所述发酵罐中，同时加入PTM4微量元素，进行发酵培养；培养温度为30℃，搅拌速度为400rpm-500rpm，通气量为2L/min-6L/min，控制补加50%（w/w）氨水维持所述发酵罐内pH为5.0；所述发酵罐内溶氧DO值不断上升时，补加补料培养基，并控制补料速率使溶氧DO值维持在20%-50%之间，72h后，停止发酵，通过固液分离系统分离得到发酵上清。可选地，所述将所述发酵上清纯化处理后，获得重组胶原蛋白原液的步骤，包括：采用阳离子交换介质，以磷酸盐缓冲液平衡层析柱至电导率值及A280吸光值不变，将所述发酵上清上样，设置上样流速20cm/h，检测紫外A280吸光值；待上样结束后，再以磷酸盐缓冲液再平衡层析柱，直至电导和紫外A280吸光值最低且不再变化，停止接样；再以含NaCl的磷酸盐缓冲液洗脱并收集对应的蛋白，得到重组胶原蛋白原液。本申请还提出了一种可自组装的重组胶原蛋白的应用，将所述可自组装的重组胶原蛋白应用于制备生物材料、组织材料或者药物载体。本申请将人源Ⅲ型胶原蛋白功能区片段重复后，获得如Seq ID NO.1所示的氨基酸序列，经过蛋白预测分析，表明其具有明显的三螺旋结构，再经过核苷酸优化筛选，使其包含更频繁使用的密码子，以提高蛋白质的翻译效率，减少翻译过程中的错误，提高正确折叠蛋白质的比例，获得如Seq ID NO.2所示的基因序列，并与羟脯氨酸酶基因在毕赤酵母系统中共表达，同时开发利用GAP启动子替代AOX启动子来稳定生产重组胶原蛋白，以克服甲醇诱导系统的不安全性，GAP启动子调控的表达更为稳定，其在不需要甲醇的情况下驱动基因表达，提供了一个更加安全的表达系统，降低了生产过程的安全风险。通过优化核苷酸序列、设计GAP启动子以及与羟脯氨酸酶基因的共表达，本申请利用毕赤酵母表达系统生产出了稳定的、具有自组装特性的重组人源化胶原蛋白产品，避免了异源性过敏反应风险。该重组胶原蛋白可稳定工业化生产，生产成本更低，产品质量更稳定，经过验证，其在高蛋白浓度、低温条件下呈现出明显的自组装特性，从而在生物医学领域具有广泛的应用前景，如利用重组胶原蛋白纳米纤维制备生物支架，其具有良好的生物相容性和生物降解性；利用重组胶原蛋白制备组织替代材料；将药物与重组胶原蛋白结合，利用其纳米纤维作为药物载体，实现药物的靶向递送；将重组胶原蛋白纳米纤维用于生物材料表面改性，以提高生物材料的生物活性。"
  },
  {
    "专利名": "一种线粒体定位信号肽及应用",
    "申请号": "CN202411036884.6",
    "公开日": "20240906",
    "IPC 分类号": "A61P33/00;C12N15/85;G01N33/533;A61P31/12;C12N5/10;A61P35/00;C12N9/64;C07K19/00;A61P7/00;A61K47/42;A61P31/04;G01N21/64",
    "申请人": "中国科学院昆明动物研究所",
    "关键词": "线粒体定位信号肽、基因克隆、化学合成、荧光蛋白融合、示踪、氨基酸序、融合蛋白、定向给药",
    "摘要": "本发明属于生物医学领域，公开一种线粒体定位信号肽及应用。本发明提供的线粒体定位信号肽，由SEQ ID NO.6、14、18、20任一所示的氨基酸序列组成的多肽。本发明提供的线粒体定位信号肽将目标蛋白靶向定位于线粒体上。该定位信号肽可通过基因克隆或直接化学合成方式获得，与荧光蛋白融合后，可以实现对线粒体进行示踪，显示线粒体探针共定位现象，指示线粒体形态和位置。本发明提供的定位信号肽和适宜的目标蛋白形成融合蛋白，实现高效定向给药，对于生物技术领域和医药领域具有重大价值。",
    "说明书": "一种线粒体定位信号肽及应用技术领域本发明属于生物医学领域，涉及一种线粒体定位信号肽及应用。背景技术细胞器组成了细胞的基本结构，使真核细胞能正常的工作、运转。细胞器是一类通过生物膜，将细胞中的其他部分分隔开来的、功能上独立的亚细胞结构。细胞器可按各自所拥有的膜层数大致分为三类：双层膜细胞器主要包括线粒体和叶绿体等；单层膜细胞器主要包括内质网、高尔基体和溶酶体等；无膜细胞器主要包括核糖体和中心体等。线粒体（mitochondrion）是一种两层膜包被的细胞器，存在于绝大多数细胞中，是细胞进行有氧呼吸的主要场所，也被称为能量工厂。线粒体直径在0.5到1.0微米左右。大多数真核细胞或多或少都拥有线粒体，但它们各自拥有的线粒体在大小、数量及外观等方面上都有所不同，如肝脏细胞中有1000-2000个线粒体。线粒体拥有自身的遗传物质和遗传体系，但其基因组大小有限，是一种半自主细胞器，线粒体基因组属于母系遗传。据统计，人体中共有1136个定位线粒体的蛋白，这些蛋白绝大多数由细胞核DNA编码，然后在核糖体上进行合成，随后被运输至线粒体中；剩余部分蛋白则由线粒体自身遗传物质进行编码。除了为细胞供能外，线粒体还参与诸如细胞分化、细胞信息传递和细胞凋亡等过程，并拥有调控细胞生长和细胞周期的能力。线粒体功能异常与多种疾病密切相关，例如神经疾病、心脑血管疾病、母系遗传Leigh综合征、线粒体肌病、Leer遗传性视神经病等线粒体病等；另外，线粒体与其他细胞器也保持着密切互作关系，一旦线粒体受损，将会影响细胞器间的互作。研究还发现线粒体功能改变能促进肿瘤转移。线粒体拥有着一套十分精细且复杂的蛋白运输系统，包括线粒体蛋白中的分选定位信号肽和转运复合物等等。在这些定位序列和转运复合物的共同作用下，众多线粒体蛋白通过各类分选途径被精准运输至线粒体不同部位。故通过对这些定位序列进行研究，能够较好地对线粒体进行示踪。研究蛋白质的转运和亚细胞定位具有很大的应用价值，因为蛋白质的功能通常和其亚细胞定位息息相关，比如病原的分泌蛋白往往是重要的毒力因子，与其致病性紧密相关。此外，信号肽在药物靶向运送及疾病治疗中也具有广泛的应用，比如可以利用核定位信号，可以将治疗基因转移到细胞核中，从而进行疾病的细胞定向基因治疗。由于线粒体与多种疾病有关，特别是一些由于线粒体基因突变而引起的疾病，线粒体定位的信号肽能够将治疗基因靶定位到线粒体上、进行线粒体定向基因治疗，为基因治疗提供一个好的前景。研究线粒体定位信号肽，不仅可以揭示线粒体定位蛋白质的生物学功能和机制，同时还能为特异的线粒体靶向生物技术药物开发提供技术支持。溶酶体组织蛋白酶H（Cathepsin H，CTSH）是一类主要分布在胞质和溶酶体的组织蛋白酶。溶酶体蛋白同样具备一套精细且复杂的蛋白分选系统。正确的CTSH蛋白信号肽序列能够确保CTSH最终被运输到溶酶体中被加工，最终形成具有酶活的蛋白酶。前期发明人所在团队通过对我国阿尔茨海默病（Alzheimer's disease，AD）患者进行全外显子组测序，分析发现CTSHCTSHCTSHCTSHCTSH经检索，现有技术中没有检索到有关CTSH信号肽突变后的多肽具有引导目的蛋白定位到线粒体的报道。发明内容针对以上技术问题，本发明目的在于提供一种具备线粒体定位功能的信号肽序列，该信号肽序列能够引导目的蛋白定位到线粒体。本发明第一方面提供了一种定位线粒体的信号肽，所述信号肽包括下列一种或几种： (a)、由SEQ ID NO .6、14、l8、20任一所示的氨基酸序列组成的多肽； (b)、包含(a)中所示的氨基酸序列经过一个或几个氨基酸的取代、缺失、插入中一种或多种的氨基酸序列的多肽。本发明还保护一种融合蛋白，所述融合蛋白包括上述所述的线粒体定位信号肽和目标蛋白。进一步地，所述目标蛋白是荧光蛋白。进一步地，所述线粒体定位信号肽位于所述目标蛋白的N端。本发明还保护一种重组表达载体，所述重组表达载体含有编码上述所述的线粒体定位信号肽的基因序列，编码所述线粒体定位信号肽的DNA序列选自SEQ ID NO.7、15、19、21任一序列。本发明还保护一种宿主细胞，所述宿主细胞含有如上述所述的重组表达载体。本发明还保护线粒体定位信号肽、融合蛋白、重组表达载体或宿主细胞的应用，包括以下几个方面：1）制备定位线粒体或指示线粒体具体位置或形态的产品；2）制备将目的蛋白定位或导入线粒体的产品；3）制备在线粒体中过表达目的蛋白的产品；4）制备治疗与线粒体相关疾病的药物；制备与线粒体相关疾病的疫苗；5）制备研究目的蛋白与线粒体的相互作用的产品。进一步地，所述的与线粒体相关疾病包括遗传病、恶性肿瘤、血液病，病毒、寄生虫、细菌感染。与现有技术相比，本发明存在以下有益技术效果：本发明首次发现鼠源或人源CTSH信号肽第11位氨基酸由甘氨酸突变成精氨酸时（CTSH c.31G＆gt;A/p.G11R）具有引导目的蛋白定位到线粒体的作用。鼠源CTSH或人源CTSHp.G11R突变信号肽前15位氨基酸截短体也具有将目的蛋白引导到线粒体的功能。本发明的线粒体定位信号肽可以通过基因克隆或直接化学合成方式获得，然后与荧光蛋白进行融合，可以实现对线粒体进行示踪，指示线粒体形态和位置，为线粒体示踪提供新的策略。将本发明提供的线粒体定位信号肽和适宜的目标蛋白形成融合蛋白，可以得到用于治疗遗传病、恶性肿瘤、血液病，病毒、寄生虫、细菌感染等疾病的疫苗和药物，并实现高效定向给药，对于生物技术领域和医药领域具有重大价值。"
  },
  {
    "专利名": "一种用于肿瘤血管生成研究的类器官的培养方法",
    "申请号": "CN202410964815.5",
    "公开日": "20240913",
    "IPC 分类号": "C12N5/071;C12Q1/02;C12N5/077;C12N5/09",
    "申请人": "中国医科大学附属盛京医院",
    "关键词": "类器官培养方法、3D共培养模型、水凝胶培养基、体外模型、肿瘤血管生成研究、肿瘤血管生成、肿瘤微环境、抗肿瘤药物",
    "摘要": "本发明公开了一种用于肿瘤血管生成研究的类器官的培养方法，属于生物医学领域。本发明公开的方法是基于肿瘤细胞、肿瘤相关成纤维细胞与血管内皮细胞的3D共培养模型。用人肿瘤细胞，人原代肿瘤相关成纤维细胞群CAFs，与人血管内皮细胞，通过使用水凝胶培养基构建了3D共培养模型，提供了一种包含肿瘤立体结构与肿瘤微环境的含有新生肿瘤血管的体外模型，可以在模拟体内肿瘤情况的条件下进行对于肿瘤血管生成与正常化与肿瘤及肿瘤微环境的研究，并可作为抗肿瘤及抗肿瘤血管生成药物的临床前研究平台。该方法具有生物相容性好、避免异源组份污染、培养成本低廉的优点。",
    "说明书": "一种用于肿瘤血管生成研究的类器官的培养方法技术领域本发明所属生物医学领域，具体涉及一种用于肿瘤血管生成研究的类器官的培养方法。背景技术恶性肿瘤是全球重要的公共卫生问题，其发病率和病死率持续增加，已成为全球仅次于心血管疾病的第二大死亡原因。尽管过往在治疗恶性肿瘤方面取得了巨大进步，但仍有许多患者依然不能从目前疗法中获益。目前已经公认，肿瘤细胞在发生发展中不仅需要自身通过基因突变和表观修饰获得恶性转化的能力，肿瘤的生长还必须有一个适合其生长的环境，肿瘤细胞与机体自身的细胞，包括免疫细胞、血管内皮细胞、成纤维细胞等等互相作用，共同构成肿瘤微环境。肿瘤微环境是一个高度结构化的生态系统，包含由不同非恶性细胞类型包围着癌细胞，共同嵌入在一个变化的、血管化的细胞外基质中。肿瘤微环境在癌症的发生发展中起到了重要的作用同时也参与肿瘤血管新生等过程。在多种恶性肿瘤的发展过程中肿瘤微环境产生了巨大变化，最显著的特征是致密的纤维结缔组织增生，以及继发和伴随的炎症反应与免疫相关细胞大量浸润。肿瘤相关成纤维细胞（cancer-associated fibroblasts，CAFs）及其分泌的胞外基质是肿瘤微环境的重要组成，而大量的体外实验和小鼠荷瘤模型研究证实CAF不仅可以促进肿瘤的生长、浸润转移和免疫逃逸等，也是多种恶性肿瘤对现有治疗方法不敏感的重要原因。随着原代CAFs的提取与培养技术的发展，对于CAFs的研究成为当前热点，使其成为我们对细胞外基质与肿瘤微环境进行探索的重要环节。肿瘤的生长离不开血管生成及血管结构变化，恶性肿瘤的抗血管生成治疗发挥着越来越重要的作用。当肿瘤直径超过2～3mm时，肿瘤中心因缺乏氧气和营养物质会刺激天然促血管生成因子生成，促血管生成因子的过度表达使促血管生成因子和抗血管生成因子之间失衡，导致新生血管形成。肿瘤新生血管生长迅猛、杂乱无章并构成庞大的供给系统，使得肿瘤组织迅速增长，变得更具侵袭性。在血管内皮细胞进行迁移形成新生血管的过程中，细胞外基质的粘附对于激活细胞内信号至关重要，这些信号会使细胞骨架重塑、细胞形状和极性发生偏移。因此，揭示调控在肿瘤微环境下的内皮细胞血管生成的机制有助于更好地理解生理性和病理性血管生成，对于肿瘤微环境下肿瘤血管生成与血管正常化的研究对我们了解癌症的病理生理过程尤为重要。在目前的很多对于调控血管生成尤其是关于血管正常化的研究中，发现很多现象在基础研究的实验结果与动物模型中甚至是临床实际情况相违背，无法解释很多与血管新生、血管结构、与血管正常化相关的问题。究其原因多是由于肿瘤血管体外模型的技术空白，传统的二维体外血管模型与体内肿瘤微环境相差甚远，既由于缺少CAFs参与构建的肿瘤微环境而不能使肿瘤细胞与周围的非肿瘤细胞进行直接或间接接触进行信号转导或通过众多复杂的细胞因子进行交流，也无法模拟体内肿瘤的立体结构而满足更高效完整的肿瘤模型形成需要的必要空间条件，而目前现有的3D肿瘤模型与肿瘤类器官又无法满足新生血管的条件，无法对肿瘤血管生成与正常化进行研究，对基础研究的发展与转化造成较大阻碍。发明内容针对现有技术存在的问题，本发明提供了一种用于肿瘤血管生成研究的类器官的培养方法。本发明所述方法是一种包含肿瘤立体结构与肿瘤微环境的含有新生肿瘤血管的体外模型，可以在模拟体内肿瘤情况的条件下进行对于肿瘤血管生成与正常化与肿瘤及肿瘤微环境的研究。并可作为抗肿瘤及抗肿瘤血管生成药物的临床前研究平台。为了实现上述发明目的，本发明提供以下技术方案。本发明提供了一种用于肿瘤血管生成研究的类器官的培养方法，包括如下步骤：步骤一，肿瘤相关成纤维细胞的提取；步骤二，肿瘤细胞提取和培养；步骤三，内皮细胞提取和培养；步骤四，将步骤一至步骤三所得三类细胞群消化后与水凝胶混合，接种于细胞培养皿内，迅速将培养系统转移至培养箱以维持水凝胶单元的立体形态，后将系统置于培养箱中培养。进一步地，步骤二和步骤三中的肿瘤细胞和内皮细胞还可以是肿瘤细胞系和人脐静脉内皮细胞HUVEC系。进一步地，步骤二、三和四中的培养条件为：将细胞于含10%胎牛血清的DMEM培养基置于37℃、5%CO2进一步地，步骤四中所述的内皮细胞与（或）CAFs为肿瘤细胞的0.2~2倍。进一步地，步骤四中所述的水凝胶培养系统中的总细胞密度在1×1067进一步地，所述肿瘤为胰腺癌、胆囊癌、肝癌、肺癌、乳腺癌或卵巢癌。进一步地，根据上述任一所述的方法制备得到的类器官在作为调控肿瘤血管生成及血管正常化的机制研究和抗肿瘤血管生成药物筛选方面的应用。本发明还提供了一种用于肿瘤血管生成研究的类器官3D培养模型，其特征在于，通过如上述中任一项所述的用于肿瘤血管生成研究的类器官方法构建得到。进一步地，根据上述所述的模型在作为调控肿瘤血管生成及血管正常化的机制研究和抗肿瘤血管生成药物筛选方面的应用。本发明还提供了用于肿瘤血管生成研究的类器官3D培养的产品，其特征在于，所述产品的使用方法如上述任一项所述的用于肿瘤血管生成研究的类器官方法。在调控肿瘤血管生成与血管正常化及抗肿瘤血管药物的研究中，血管化肿瘤体外模型的缺乏一直是限制基础科研与药物转化的重要限制因素。目前大部分研究的形式多为传统二维体外血管模型结合动物移植瘤模型，而这两种模型在构造原理上就存在着对于血管研究的缺陷。传统的二维体外血管模型无法构建血管生成所需要的立体空间结构，也无法对肿瘤微环境进行模拟，即使是目前新兴的结合了肿瘤细胞培养或肿瘤类器官进行优化的模型，目前的研究也局限在“3D肿瘤模型结合2D血管内皮细胞培养”与“肿瘤细胞与内皮细胞共培养”两种模式，其中肿瘤类器官模型为从患者组织中提取到的具有组织干性的复杂细胞群体，虽然包含多种肿瘤与非肿瘤细胞群体，可以较好地模拟肿瘤微环境，但受于培养环境的制约无法将新的细胞群体植入到成熟的本不含血管系统的类器官模型中，只能将贴壁的血管内皮细胞与悬浮的肿瘤类器官进行“同时培养”，不满足在三维肿瘤系统中肿瘤血管生长的条件，且无法实现血管内皮细胞与肿瘤类器官的直接接触，无法在肿瘤类器官内进行对肿瘤血管生成及机制与结构的研究。又如“肿瘤细胞与内皮细胞共培养”这一模式将肿瘤细胞与内皮细胞混合后进行立体空间培养，虽然解决了肿瘤细胞与血管内皮细胞直接接触并构建了三维肿瘤血管生长环境的问题，但由于其细胞种类较为单一，3D模型构成过于简单，所营造的模型环境与真实情况下的肿瘤组织微环境相差甚远，而多种细胞外基质中非肿瘤细胞分泌的细胞因子及与非肿瘤细胞与血管内皮细胞的直接接触对于血管生成及构型至关重要，该类模型所复现的血管生长环境仍然与真实肿瘤血管生长环境存在较大差距。同时，虽然动物移植瘤模型可以较好地模拟新生血管在肿瘤组织中生长的环境，即使抛开其成本高、操作复杂、培养时间长的问题，其仍然存在着培养环境无法做到完全人源性，培养过程的观察不透明不连续，不同个体间差异较大，不能保持肿瘤组织异质性遗传等先天性缺陷，作为肿瘤血管研究模型与临床前研究平台仍存在较大的困难，往往由于其实验结果无法在体外实验中复现与解释而不能有效地进行临床转化。本发明所公开的方案是在含原代人源性肿瘤相关成纤维细胞的肿瘤体外3D共培养模型中加入血管内皮细胞，一方面通过人源性CAFs帮助构建更真实的肿瘤微环境，另一方面实现对肿瘤血管生成的体外实时观察追踪。在作为调控肿瘤血管生成及血管正常化的基础研究平台和抗肿瘤血管生成药物的临床前研究平台中应用。与现有技术比，本发明的有益效果如下。本发明首次将肿瘤细胞，原代肿瘤相关成纤维细胞，与血管内皮细胞相结合进行3D立体培养，所构建的血管化肿瘤3D模型既通过肿瘤相关成纤维细胞CAFs的加入实现了对肿瘤组织中重要非肿瘤成分的有效复现，构建肿瘤细胞与肿瘤组织中非肿瘤成分通过直接相互作用与间接相互作用如旁分泌机制所营造的特殊肿瘤微环境，使模型中的肿瘤微环境与真实肿瘤更加接近，且异质性遗传保持度较好，同时100%人源性的细胞与组织环境与透明连续地全观察过程也使其在低时间与资源成本的条件下拥有优于动物在体模型的性能。同时实现了类器官级别的肿瘤微环境复现下3D共培养形式的血管植入，使研究者可以从肿瘤方向、非肿瘤成分方向与血管生成与结构方向多种角度更加立体全面地对肿瘤血管生成及结构化进行研究与探索，同时作为临床前研究平台解决更多的问题。"
  },
  {
    "专利名": "一种Huh-7-ATP7BKO-MRE-Luc细胞株的构建方法和应用",
    "申请号": "CN202410933583.7",
    "公开日": "20240816",
    "IPC 分类号": "C12N15/53;C12N15/85;C12N5/10;C12Q1/66;C12N15/55",
    "申请人": "凌意（杭州）生物科技有限公司",
    "关键词": "Huh-7-ATP7BKO-MRE-Luc、基因敲除质粒、基因插入质粒转染、体外生物学活性评价、细胞模型",
    "摘要": "本申请公开了一种Huh 7 ATP7BKO MRE Luc细胞株的构建方法和应用，其属于生物医学领域。构建Huh 7 ATP7BKO MRE Luc细胞株通过基因敲除质粒和基因插入质粒转染实现。因此，该细胞株是一种可用于威尔逊病AAV治疗载体体外生物学活性评价的作用机制相同、可定量的细胞模型。",
    "说明书": "一种Huh-7-ATP7BKO-MRE-Luc细胞株的构建方法和应用技术领域本申请涉及生物医学领域，具体而言，涉及一种Huh-7-ATP7BKO-MRE-Luc细胞株的构建方法和应用。背景技术威尔逊病（Wilsondisease，WD）是一种罕见的常染色体隐性遗传性疾病，主要影响肝脏、神经系统和其他组织。该疾病的根本原因是位于第13号染色体上的ATP7B基因突变，导致ATP7B蛋白功能异常。ATP7B基因编码一种P型铜转运ATP酶，主要在肝细胞中表达，用于铜的跨膜转运。ATP7B蛋白功能异常导致肝细胞减少铜排泄到胆汁中，导致肝脏和其他组织中铜积累，进而导致肝脏、神经以及相关的系统性临床症状。基因治疗作为一项前沿的生物医学领域，旨在通过调整、修复或替代患者体内的缺陷基因来治疗一系列遗传性疾病和慢性疾病。腺相关病毒（adeno-associatedvirus，AAV）载体因其理化性质稳定、致病性弱、整合风险低、外源基因表达持久等结构和生物学方面的优势，已成为体内基因治疗领域研究、应用最为广泛的载体之一。使用AAV载体携带ATP7B基因，导入患者体内表达功能正常的ATP7B蛋白，有望实现一次给药、终身受益的威尔逊病治疗方式。法规要求需建立与产品体内作用机制相同或相关的生物学活性分析方法，用于基因治疗产品的质量评价。然而目前尚缺乏可有效评价威尔逊病基因治疗载体生物学活性的细胞模型。构建ATP7B基因敲除或沉默表达的细胞模型，对研究ATP7B基因与威尔逊病基因治疗载体生物学活性的细胞模型的发展机制、靶向用药治疗机制等具有重要的应用价值。发明内容本申请的内容部分用于以简要的形式介绍构思，这些构思将在后面的具体实施方式部分被详细描述。本申请的内容部分并不旨在标识要求保护的技术方案的关键特征或必要特征，也不旨在用于限制所要求的保护的技术方案的范围。为了解决以上背景技术部分提到的技术问题，本申请的一些实施例提供了一种Huh-7-ATP7BKO-MRE-Luc细胞株的构建方法，所述的细胞株来源于人Huh-7细胞株；该细胞通过对Huh-7细胞株进行敲除ATP7B基因、并插入金属响应元件（MRE）-荧光素酶报告系统的方式构建。进一步地，ATP7B基因敲除通过基因敲除质粒转染实现，该敲除质粒携带元件包括：特异性靶向ATP7B基因的sgRNA转录序列、Cas9蛋白-嘌呤霉素抗性表达元件；金属响应元件（MRE）-荧光素酶报告系统插入通过基因插入质粒转染实现，该基因插入质粒携带元件包括：PiggyBac5’反向末端重复序列（ITR）、4×MRE、E1b极小启动子、荧光素酶编码序列和PiggyBac3’ITR序列的顺序组合，以及嘌呤霉素抗性表达元件。进一步地，所述特异性靶向ATP7B基因的sgRNA序列是SEQ ID NO.1、SEQ ID NO.2或SEQ ID NO.3。进一步地，PiggyBac5’反向末端重复序列是SEQ ID NO.4；4×MRE序列是SEQ IDNO.5；E1b极小启动子序列是SEQ ID NO.6；荧光素酶编码序列是SEQ  ID NO.7；PiggyBac3’ITR序列是SEQ ID NO.8。一种Huh-7-ATP7BKO-MRE-Luc细胞株在评估基因治疗载体功能的应用，其特征在于：Huh-7-ATP7BKO-MRE-Luc细胞可以在基因治疗载体感染后，通过受金属离子浓度调控表达的荧光素酶的变化，反应载体的功能。一种Huh-7-ATP7BKO-MRE-Luc细胞株在评估威尔逊病治疗药物功能的应用，其特征在于：Huh-7-ATP7BKO-MRE-Luc细胞可以通过受金属离子浓度调控表达的荧光素酶的变化，反应威尔逊病治疗药物的效用。一种Huh-7-ATP7BKO-MRE-Luc细胞株在铜离子异常相关疾病的药物评价的应用。一种Huh-7-ATP7BKO-MRE-Luc细胞株在铜离子浓度检测中的应用；包括临床样品铜离子检测或诊断和环境铜离子检测。本申请的有益效果在于：Huh-7-ATP7BKO-MRE-Luc细胞株敲除了ATP7B基因，无法表达正常的ATP7B蛋白，与患者表型相似。另外，该细胞株含有受胞内铜离子浓度调控（metalresponseelement,MRE）的荧光素酶（Luciferase）报告系统，可以定量评价ATP7B蛋白的铜转运生物学功能。因此，该细胞株是一种可用于威尔逊病AAV治疗载体体外生物学活性评价的作用机制相同、可定量的细胞模型。"
  },
  {
    "专利名": "倭蛙皮肤抗氧化肽antioxidin-NV在制备皮肤抗炎、抗过敏的药物中的应用",
    "申请号": "CN202410932457.X",
    "公开日": "20240809",
    "IPC 分类号": "A61K8/64;A61P37/08;A61K38/17;A61Q19/00;A61P17/00;A61P17/04;A61P29/00",
    "申请人": "昆明医科大学第一附属医院（云南省皮肤病医院）",
    "关键词": "皮肤抗氧化肽、抗炎药物、抗过敏药物、炎症性皮肤病、过敏性皮肤病、特应性皮炎、湿疹、接触性皮炎、神经性皮炎、脂溢性皮炎、银屑病、药疹、荨麻疹",
    "摘要": "本发明公开了倭蛙皮肤抗氧化肽antioxidin NV在制备皮肤抗炎、抗过敏的药物中的应用，属于生物医学领域。本发明通过实验证实：倭蛙皮肤抗氧化肽antioxidin NV具有减轻皮肤局部炎症、改善过敏的作用，可应用于制备皮肤抗炎、抗过敏药物，用于治疗炎症性和过敏性皮肤病，如特应性皮炎、湿疹、接触性皮炎、神经性皮炎、脂溢性皮炎、银屑病、药疹、荨麻疹等，与现有药物相比，该倭蛙皮肤抗氧化肽antioxidin NV的制剂治疗效果较好，安全性高。",
    "说明书": "倭蛙皮肤抗氧化肽antioxidin-NV在制备皮肤抗炎、抗过敏的药物中的应用技术领域本发明涉及生物医学领域，特别是涉及倭蛙皮肤抗氧化肽antioxidin-NV在制备皮肤抗炎、抗过敏的药物中的应用。背景技术炎症性、过敏性皮肤病是一类常见的皮肤病，以特应性皮炎为例，特应性皮炎(atopic dermatitis，AD）曾被称为“遗传过敏性皮炎”，是一种慢性、复发性、炎症性皮肤病，以严重瘙痒和复发性皮损为特征，严重影响患者的生存质量。研究认为食物过敏、空气传播过敏原、遗传易感性、皮肤屏障功能障碍、皮肤微生物群落改变、免疫平衡失调等因素导致AD的发病。其中机体免疫调节功能失调可使IL-4、IL-5和IL-13等细胞因子的产生增加，其可刺激外周血和组织中的IgE抗体和嗜酸性粒细胞，其中IgE与过敏反应的发生密切相关，可通过其Fc段与肥大细胞或嗜碱性粒细胞表面的高亲和力IgE Fc受体结合，使肥大细胞和嗜碱性粒细胞活化可释放组胺、白三烯等生物活性物质，使机体处于致敏状态。目前特应性皮炎外用药物治疗主要使用糖皮质激素、钙调磷酸酶抑制剂，由于AD是一种需要长期治疗的疾病，而长期使用糖皮质激素会产生毛细血管扩张、皮肤变薄、痤疮、萎缩纹，甚至诱发感染等不良反应，长期使用钙调磷酸酶抑制剂则可增加感染、淋巴瘤以及皮肤恶性肿瘤的风险，且价格昂贵，另外还会减少皮肤抗菌肽的产生，这些副作用使得原有疾病的治疗变得更加困难，给患者及家庭、社会带来严重的经济、医疗等负担，因此开发新型药物，对特应性皮炎的治疗具有重要意义。两栖动物是生物活性多肽资源发掘中最重要的一类资源，其皮肤裸露，为抵御环境中各种恶劣环境，它们能够分泌多种分子结构新颖、功能复杂多样的生物活性多肽。这些活性多肽广泛参与机体的各种生理活动，具有各种药理活性，如抗微生物、抗肿瘤、抗氧化、免疫调节、创伤修复、镇痛等作用。因此，对从两栖动物皮肤中提取分离出的活性多肽物质的探索已经成为国内外学者的研究热点。目前已经从两栖动物皮肤提取物中分离出的生物活性肽包括抗菌肽、抗氧化肽、缓激肽等，而且有些已进入临床阶段。腹斑倭蛙相比较其它蛙科动物其生活环境极为严酷，有长时间持续的日光照射，强烈的紫外线辐射以及昼夜温差大的气候特点，容易导致皮肤屏障破损。生物体与其生存环境之间的相互作用和适应，都能够在生物体内找到对应的化学物质基础。因此，特殊的高原环境必然促使这个物种会产生特殊的一些物质来适应这种恶劣的环境。不足之处在于其合成价格相对昂贵，但我们发现来自腹斑倭蛙的抗氧化肽antioxidin-NV在重量百分比为0.01%下即可发挥较好的作用，生产成本较低。中国专利CN12125968A《倭蛙皮肤抗氧化肽antioxidin-NV及其基因和应用》公开了一种倭蛙皮肤抗氧化肽antioxidin-NV及其在制备抗皮肤光老化治疗药物中的应用。有益效果在于：对皮肤有较强的抗皮肤光老化作用，能显著抑制皮肤光老化的发生。涉及皮肤抗炎、抗过敏的作用还未有报道。发明内容本发明的目的是提供倭蛙皮肤抗氧化肽antioxidin-NV在制备皮肤抗炎、抗过敏的药物中的应用，以解决上述现有技术存在的问题，倭蛙皮肤抗氧化肽antioxidin-NV可以用于炎症性、过敏性皮肤病的治疗。为实现上述目的，本发明提供了如下方案：本发明提供了倭蛙皮肤抗氧化肽antioxidin-NV在制备治疗皮肤抗炎、抗过敏的药物中的应用，所述倭蛙皮肤抗氧化肽antioxidin-NV的氨基酸序列如SEQ ID NO：1所示。优选的是，所述治疗皮肤抗炎、抗过敏的药物包括治疗特应性皮炎的药物。本发明还提供倭蛙皮肤抗氧化肽antioxidin-NV在制备用于皮肤抗炎、抗过敏的护肤品中的应用，所述倭蛙皮肤抗氧化肽antioxidin-NV的氨基酸序列如SEQ ID NO：1所示。优选的是，所述用于皮肤抗炎、抗过敏的护肤品包括用于特应性皮炎的护肤品。本发明还提供一种皮肤抗炎、抗过敏的药物，其特征在于，所述药物以倭蛙皮肤抗氧化肽antioxidin-NV为主要活性成分，所述药物中所述倭蛙皮肤抗氧化肽antioxidin-NV的重量百分比为0.01%-1%。优选的是，所述药物还包括药学上可接受的辅料，所述辅料包括卡波姆、透明质酸、甘油、尿囊素、凡士林和石蜡中的至少一种。优选的是，所述药物的剂型包括半固体制剂、膏剂、喷雾剂、溶液或凝胶剂。本发明还提供一种皮肤抗炎、抗过敏的护肤品，所述护肤品以倭蛙皮肤抗氧化肽antioxidin-NV为主要活性成分，所述护肤品中所述倭蛙皮肤抗氧化肽antioxidin-NV的重量百分比为0.01%-1%。优选的是，所述护肤品还包括化妆品中可接受的辅料，所述辅料包括卡波姆、透明质酸、甘油、尿囊素、凡士林和石蜡中的至少一种。优选的是，所述护肤品的剂型包括膏剂、喷雾剂或凝胶剂。本发明公开了以下技术效果：本发明提供了倭蛙皮肤抗氧化肽antioxidin-NV的一种新的具有抗炎、抗过敏作用方面的新用途。经实验验证发现，该倭蛙皮肤抗氧化肽antioxidin-NV具有良好的抗炎、抗过敏作用，可应用于制备皮肤抗炎、抗过敏治疗药物以及护肤品中，以用于治疗炎症性和过敏性皮肤病，如：特应性皮炎、湿疹、接触性皮炎、神经性皮炎、脂溢性皮炎、银屑病、药疹、荨麻疹等等。该倭蛙皮肤抗氧化肽antioxidin-NV由于其具有序列简单、合成方便、稳定性好、安全有效的优点，且可在较小的浓度及重量百分比下发挥作用，价格相对便宜，为应用于制备皮肤抗抗炎、抗过敏药物以及护肤品提供了较好的应用前景，可以有效改善炎症、过敏性皮肤病的问题。"
  },
  {
    "专利名": "一种受激辐射损耗超分辨荧光寿命成像方法",
    "申请号": "CN202410917692.X",
    "公开日": "20240809",
    "IPC 分类号": "G02B27/28;G02B26/10;G01N21/01;G01N21/64",
    "申请人": "深圳大学",
    "关键词": "受激辐射损耗、超分辨荧光寿命成像、光学显微镜成像、损耗激光脉冲、荧光寿命数据分析、超分辨率图像、荧光染料、微环境信息",
    "摘要": "本发明公开了一种受激辐射损耗超分辨荧光寿命成像方法，应用在光学显微镜成像技术领域，本发明提出的方法结合了受激辐射损耗和荧光寿命成像原理，采用的损耗激光脉冲频率为激发光脉冲频率的一半，并调整两个脉冲序列之间的时间间隔，使损耗激光脉冲位于相邻激发光脉冲之后，通过对采集到的荧光寿命数据进行分析处理，得到超分辨率的荧光寿命图像，解决受激辐射损耗荧光寿命成像显微镜在高能量损耗激光作用下荧光寿命显著缩短的问题，进而准确反映荧光染料和微环境的真实信息，这一创新技术将为生命科学研究提供重要的技术支撑，显著提升研究的精准性和有效性，推动生物医学领域的进一步发展。",
    "说明书": "一种受激辐射损耗超分辨荧光寿命成像方法技术领域本发明属于光学显微镜成像技术领域，特别涉及一种利用受激辐射损耗原理来突破光学衍射极限，结合荧光寿命探测实现空间超分辨率的荧光寿命显微成像新方法。背景技术超分辨荧光显微成像技术的发展极大地推动了生物医学研究的进步，传统的光学显微镜受限于阿贝衍射极限，分辨率无法突破激发波长一半的限制，因此在一定程度上阻碍了其对细胞内部精细结构及其动态过程的深入研究，近年来，几种超分辨显微成像技术如受激辐射损耗显微镜、结构光照明显微镜、单分子定位显微镜和最小光通量显微镜相继问世，这些技术突破了光学衍射极限，显著提高了成像分辨率，扩展了显微成像的应用领域。受激辐射损耗显微镜是由德国科学家斯蒂芬·赫尔提出的，它是第一个远场超分辨显微成像技术，利用受激辐射损耗效应实现对荧光分子激发区域的精确控制，从而突破光学衍射极限，提高空间分辨率，在受激辐射损耗显微镜中，首先使用激发激光照射使处于基态的荧光分子进入激发态，然后引入一个波前呈环状的损耗激光，使该激光照射区域内的荧光分子通过受激辐射的方式返回基态，仅保留激发光斑中心区域的自发荧光信号，通过调节受激辐射损耗激光的强度和空间分布，可以将成像分辨率提高到几十纳米甚至更高。荧光寿命成像显微镜是一种基于发光材料自身荧光寿命特性的成像技术，它通过测量荧光分子从激发态回到基态所需的时间，提供有关分子环境、相互作用及微观动力学的丰富信息，与传统的强度成像不同，荧光寿命成像显微镜技术不受荧光强度变化的影响，因而在生物医学研究，特别是定量分析和生物系统等研究中具有重要的应用价值，然而，荧光寿命成像显微镜技术的空间分辨率受限于传统显微镜的衍射极限，无法满足对细胞内部复杂结构及其动态过程的高分辨率研究需求。为了克服传统荧光寿命成像显微镜技术在空间分辨率方面的限制，研究人员将受激辐射损耗显微镜与荧光寿命成像显微镜技术相结合，提出了受激辐射损耗荧光寿命成像方法，该方法通过在受激辐射损耗显微镜的基础上引入荧光寿命成像技术，实现了亚衍射分辨率下的荧光寿命测量，然而，由于高能量损耗激光的受激辐射作用，荧光寿命成像显微镜测量得到的荧光寿命显著缩短，其数值明显低于荧光材料的正常荧光寿命，无法准确反映荧光染料和微环境的真实信息，这对生物医学领域研究造成了极大障碍，因此，开发一种能够保持正常荧光寿命信息的受激辐射损耗超分辨荧光寿命成像技术，可以为生命科学的精准化研究提供重要的技术支撑。发明内容本发明的目的在于提出一种受激辐射损耗超分辨荧光寿命成像方法，其优点是可以克服传统荧光寿命成像显微镜在空间分辨率方面的限制。本发明的上述技术目的是通过以下技术方案得以实现的：一种受激辐射损耗超分辨荧光寿命成像方法，包括结合受激辐射损耗和荧光寿命成像的激光扫描共聚焦成像系统，该结合受激辐射损耗和荧光寿命成像的激光扫描共聚焦成像系统包括：激发激光，由皮秒激光器产生脉冲型激光；损耗激光，由皮秒激光器产生脉冲型激光，波长长于激发激光，脉冲频率为激发激光的一半，且通过激发激光的控制系统触发后发出同步的脉冲激光；半波片，用于调节激光的偏振方向；偏振分光镜，用于激光分束，与半波片配合使用可以控制反射和透射激光的能量比例；挡板，用于阻挡激光束；反射镜，用于改变激光的传输方向；涡旋相位板，用于对损耗激光进行波前调制，将高斯光转换成环形光；角反射器，用于调节激发激光和损耗激光之间的脉冲间隔，即移动角反射器的位置延长或缩短环型损耗激光光斑的光程，在时间上控制损耗激光脉冲到达样品的时间；双色镜1，用于反射激发激光，透射荧光信号；双色镜2，用于反射损耗激光，透射激发激光和荧光信号；振镜x，用于对两束激光束进行横向同步扫描；振镜y，用于对两束激光束进行纵向同步扫描，与振镜x搭配实现对样品的面阵成像；扫描透镜，放置于振镜之后，用于收集面阵扫描的激光光束；管镜，与物镜搭配构成显微镜系统；物镜，用于将激光聚焦到样品，同时收集样品反射回来的荧光信号；载物台，用于放置和固定待测样品，并对样品进行三维移动控制；透镜，用于对光束进行聚焦；滤光片，用于透射荧光，去除荧光以外的杂散光，提高图像信噪比；探测器1，使用光电倍增管或雪崩光电二极管，用于收集信号并对荧光信号进行放大；探测器2，用于探测激发光路中偏振分光镜反射后的激光，作为荧光寿命成像中的参考信号；时间相关单光子计数器，用于记录荧光信号的时空信息；电脑，用于控制软件采集图像，存储数据和图像数据处理。本发明进一步设置为：激发激光（黑色实线）从激光器出射后经过偏振分光镜分为两束，其中反射光被探测器2收集，用作荧光寿命成像时的参考信号，透射光被双色镜1反射，损耗激光（黑色虚线）经涡旋相位板的波前调制生成环形激光光斑；上述两束激发激光和损耗激光在双色镜2处相遇，且空间上精准重合，样品被激发后发出荧光信号（黑色点线），将探测器1和探测器2采集的信号传输至时间相关单光子计数器，并将数据保存至电脑。本发明进一步设置为：通过开启激发激光和损耗激光，利用激发激光的控制系统来同步触发损耗激光，使两束激光的脉冲序列保持同步，通过移动角反射器可以改变损耗激光的光程，调节两束激光之间的脉冲间隔。本发明进一步设置为：激发激光的脉冲频率是损耗激光脉冲频率的两倍，损耗激光的波长长于激发激光，激发激光输出高斯型脉冲激光，激光出射后经偏振分光镜一分为二，反射光作为荧光寿命成像的参考信号，透射光经双色镜1反射、双色镜2透射、振镜x和y扫描后，依次通过扫描透镜、管镜和物镜后聚焦于样品。本发明进一步设置为：损耗激光由激发激光的控制系统触发后出射高斯型脉冲激光，通过半波片和偏振分光镜的组合控制光路中的损耗激光能量，利用角反射器调节损耗激光脉冲到达样品的时间，透过涡旋相位板由高斯型转换为环形激光，被双色镜2反射后经振镜x和y扫描，依次通过扫描透镜、管镜和物镜聚焦于样品。本发明进一步设置为：激发激光和损耗激光的光斑经物镜聚焦后在空间上精准重合，时间相关单光子计数器同时收集探测器1采集的荧光信号和探测器2采集的参考信号，将数据传输至电脑进行存储和处理。本发明进一步设置为：开启激发激光时，仅有激发光脉冲序列构成共聚焦荧光寿命成像，荧光发射呈单指数衰减，当激发激光和损耗激光都开启时，由于激发激光的脉冲频率是损耗激光脉冲频率的两倍，通过调节角反射器使损耗激光脉冲位于相邻激发激光脉冲之后，确保和相邻激发激光脉冲之间的脉冲间隔与荧光染料的激发态振动弛豫时间相匹配，该时间为百皮秒量级，此时，荧光发射同时包含共聚焦荧光衰减曲线和受激辐射损耗超分辨荧光衰减曲线，在受激辐射效应的作用下，荧光光子数显著降低，荧光发射呈多指数衰减趋势。本发明进一步设置为：将损耗激光的脉冲频率作为荧光信号的探测周期（T），因此在一个探测周期内包含两个激发光脉冲和一个损耗激光脉冲，根据荧光衰减曲线可以将探测周期分为两个部分，即区域1和区域2；在区域1中，分子仅受到激发激光的作用，由此产生的荧光光子构成了标准的共聚焦荧光成像信号；在区域2中，分子则受到激发激光与损耗激光的共同作用，其荧光光子表现为受激辐射损耗显微镜荧光成像信号，因此，通过荧光寿命成像探测可以在每个像素中一次性同时得到共聚焦荧光成像的荧光强度信息ICCSS本发明进一步设置为：获取上述信息之后，利用图像处理算法分别得到共聚焦荧光成像中的荧光寿命信息τCSCSSC本发明进一步设置为：将该HSV图像转成RGB图像即可获得强度加权的荧光寿命图像，即同时包含了正常荧光寿命信息和超分辨结构信息的受激辐射损耗超分辨荧光寿命图像。综上所述，本发明具有以下有益效果：该方法通过结合受激辐射损耗和荧光寿命成像原理，采用的损耗激光脉冲频率为激发光脉冲频率的一半，并调整两个脉冲序列之间的时间间隔，使损耗激光脉冲位于相邻激发光脉冲之后，通过对采集到的荧光寿命数据进行分析处理，得到超分辨率的荧光寿命图像，解决受激辐射损耗荧光寿命成像显微镜在高能量损耗激光作用下荧光寿命显著缩短的问题，进而准确反映荧光染料和微环境的真实信息，这一创新技术将为生命科学研究提供重要的技术支撑，显著提升研究的精准性和有效性，推动生物医学领域的进一步发展。"
  },
  {
    "专利名": "一种发酵粘液乳杆菌IOBRA9848及其分离方法和应用",
    "申请号": "CN202410910610.9",
    "公开日": "20240816",
    "IPC 分类号": "C12N1/20;A61P39/06;C12R1/225;A61P3/06",
    "申请人": "云南大学",
    "关键词": "发酵粘液乳杆菌、分离方法、胆盐水解酶、胆固醇、BSH活性、抗氧化特性、益生菌、发酵乳制品、健康补充剂、新型益生菌产品、肠道微生态平衡",
    "摘要": "本发明属于微生物技术领域，提供了一种发酵粘液乳杆菌IOBRA9848及其分离方法和应用，所述菌株已在2024年3月29日依照规定程序成功保藏于中国微生物菌种保藏管理委员会普通微生物中心，并被赋予保藏编号CGMCC No.30202；该菌株源自健康人体肠道，具有分泌胆盐水解酶的能力，能够有效降低胆固醇；本发明的菌株因其BSH活性和抗氧化特性，在降低胆固醇水平和抗衰老方面具有潜在的应用价值，此外，该菌株还可作为益生菌的候选菌株，用于开发新型的益生菌产品，如发酵乳制品、健康补充剂等，有助于促进人体健康和改善肠道微生态平衡；本发明的发酵粘液乳杆菌不仅在生物医学领域具有潜在的应用价值，而且在开发新型益生菌产品方面展现了广阔的应用前景。",
    "说明书": "一种发酵粘液乳杆菌IOBRA9848及其分离方法和应用技术领域本发明属于微生物技术领域，具体地说是一种发酵粘液乳杆菌IOBRA9848及其分离方法和应用。背景技术发酵粘液乳杆菌（Limosilactobacillus fermentum）是一类归属于乳酸菌（Lactic acid bacteria，LAB）的益生菌，广泛存在于酸奶、乳酪等发酵食品中。在人体口腔、肠道等部位中也可分离到该类群，研究表明该类群在人体中起到重要作用，如抑制病原菌从而维持菌群平衡等，其代谢产物也影响人体中多种代谢。胆固醇是人体内一种重要的脂质成分，是维持人体正常生理功能所必需的，但其过量的摄入可能导致多种心血管疾病。在当今社会中，心血管疾病等慢性疾病的发病率不断上升，而胆固醇的代谢水平异常是这些疾病的主要危险因素之一。传统药物依赖型的降胆固醇方法的长期使用，导致其可能会伴随一系列的副作用。因此，寻找天然、安全的降胆固醇益生菌为当前健康研究的焦点之一。研究表明，乳酸菌降低胆固醇的作用机制主要包括共沉淀作用、同化作用及胆盐水解酶作用。本专利所述的发酵粘液乳杆菌可通过分泌胆盐水解酶（Bile salthydrolytic activity，BSH）的方式降低胆固醇水平，其产生的BSH对6种胆盐均有较好的降解作用。该菌株不仅在降胆固醇方面表现出色，还展现出了抗氧化活性，主要表现在其具有较强的DPPH（2,2-Diphenyl-1-picrylhydrazyl）及羟清除能力。研究表明，氧化应激与多种慢性疾病的发生密切相关，而抗氧化作用则能够中和自由基，减缓细胞老化，降低患病风险。因此，抗氧化作用也是评价食品和保健品品质的重要标准之一。为此，本领域技术人员提出了一种发酵粘液乳杆菌IOBRA9848及其分离方法和应用，提供的发酵粘液乳杆菌菌株因其降胆固醇及抗氧化作用，其相关制品在食品、药品方面具有广泛的应用前景。发明内容为了解决上述技术问题，本发明提供一种发酵粘液乳杆菌IOBRA9848及其分离方法和应用，旨在至少一定程度上解决现有技术中存在的技术问题中的至少之一。一种发酵粘液乳杆菌，包括菌株，为一种微生物，所述菌株被鉴定为发酵粘液乳杆菌IOBRA9848，保藏于中国微生物菌种保藏管理委员会普通微生物中心，保藏编号为CGMCCNo.30202，保藏日期为2024年3月29日。优选的，所述微生物具有如SEQ ID No:1所示的16S rRNA基因序列。优选的，所述菌株能够分泌胆盐水解酶（BSH），且对于多种胆盐均有较强的水解活力。优选的，所述菌株对自由基DPPH有较强的清除能力。优选的，一种发酵液或菌悬液，由微生物制备而来。优选的，本发明筛选出一株具有BSH活性、可降解胆固醇、具有一定肠胃耐受性的非溶血发酵粘液乳杆菌IOBRA9848。本发明第一方面涉及的发酵粘液乳杆菌分离自健康人肠道样品，对其进行了16SrRNA基因比对，鉴定结果表明其属于发酵粘液乳杆菌。保藏信息：菌株名称：发酵粘液乳杆菌Limosilactobacillus fermentum IOBRA9848保藏日期：2024年3月29日保藏单位：中国微生物菌种保藏管理委员会普通微生物中心保藏地址：北京市朝阳区北辰西路1号院3号保藏编号：CGMCC No.30202；本发明所分离得到的微生物发酵粘液乳杆菌IOBRA9848的16SrRNA基因核苷酸序列为SEQ ID No:1所示。本发明涉及一种从健康人肠道中分离得到的发酵粘液乳杆菌IOBRA9848，该菌株具有显著的胆盐水解酶（BSH）产生能力和抗氧化特性，适用于生物医学研究及益生菌产品的开发。本发明第一方面涉及的发酵粘液乳杆菌的分离；本发明的菌株通过精心设计的分离程序从健康成年人的肠道样本中分离得到；分离中采用了MRS培养基，该培养基适于乳酸菌的生长，能够为菌株提供最佳的生长条件；分离得到的菌株经过16S rRNA基因序列分析，确认为发酵粘液乳杆菌，确保了菌株的准确性和纯度。本发明所分离得到的微生物发酵粘液乳杆菌IOBRA9848的16SrRNA基因核苷酸为SEQ ID No:1所示，该菌株已提交中国微生物菌种保藏管理委员会普通微生物中心，保藏编号为CGMCC No.30202。本发明第二方面涉及发酵粘液乳杆菌IOBRA9848的BSH活性验证。将该菌株在与不同种类胆盐共同孵育，并通过测定胆盐的降解产物来评估BSH活性。结果显示，该菌株能够对包括牛磺酸胆盐、甘氨酸胆盐等在内的六种胆盐表现出显著的降解作用，证实了其BSH活性。本发明第三方面涉及发酵粘液乳杆菌IOBRA9848的抗氧化能力评估。将该菌株与DPPH在室温温度下遮光反应30min，并通过紫外-可见光谱光度计测定DPPH的吸光度变化。实验结果表明，该菌株培养液能够显著降低DPPH的吸光度，表明其具有强大的自由基清除能力。与现有技术相比，本发明具有如下有益效果：该菌株源自健康人体肠道，具有分泌胆盐水解酶的能力，能够有效降低胆固醇；本发明的菌株因其BSH活性和抗氧化特性，在降低胆固醇水平和抗衰老方面具有潜在的应用价值，此外，该菌株还可作为益生菌的候选菌株，用于开发新型的益生菌产品，如发酵乳制品、健康补充剂等，有助于促进人体健康和改善肠道微生态平衡；本发明的发酵粘液乳杆菌不仅在生物医学领域具有潜在的应用价值，而且在开发新型益生菌产品方面展现了广阔的应用前景。"
  },
  {
    "专利名": "反复妊娠丢失早期预测诊断试剂盒用标志物和干预药物",
    "申请号": "CN202410775044.5",
    "公开日": "20240712",
    "IPC 分类号": "A61P15/00;C12Q1/6883;A61K31/7105",
    "申请人": "山东大学",
    "关键词": "反复妊娠丢失、预测诊断试剂盒、标志物、干预药物、RNA-circSTK40、SETD1B、生育健康",
    "摘要": "本发明涉及生物医学领域，公开了一种反复妊娠丢失早期预测诊断试剂盒用标志物和干预药物，该标志物包括RNA circSTK40和SETD1B，所述RNA circSTK40为环状，所述RNA circSTK40的核苷酸序列如SEQ ID NO.1所示。本发明采用RNA circSTK40联合SETD1B可作为反复妊娠丢失早期诊断标志物制备试剂盒和药物，可用于反复妊娠丢失患者再次发生自然流产的风险预测并尽早进行干预，保障适龄女性的生育健康。",
    "说明书": "反复妊娠丢失早期预测诊断试剂盒用标志物和干预药物技术领域本发明涉及生物医学领域，具体地，涉及一种反复妊娠丢失早期预测诊断试剂盒用标志物和干预药物。背景技术反复妊娠丢失（recurrent pregnancy loss, RPL）是导致生育失败的重要原因，其临床表现多样，病因机制不清，缺乏有效早期筛查干预手段，是目前辅助生殖领域中亟需解决的一大难题。因此，深入阐明发病机制并筛查有效的诊疗潜在靶点对于反复妊娠丢失的诊断和干预尤为必要。表观遗传学调控对于基因的正确表达、细胞和组织的稳态至关重要。表观遗传机制的修饰在许多疾病的生物学调控中发挥着重要作用，包括uRPL，因为妊娠期间表观遗传标记的关键变化是胚胎着床、组织重塑和妊娠维持所必需的。circRNA是一类广泛分布、呈共价闭合的环状RNA分子，可以抵抗核糖核酸外切酶-RNase R的降解，比线性RNA更稳定，在不同物种间具有高度保守性，在表达上具有明显的时间特异性和组织特异性，具有作为诊疗生物学标志物的良好特性。既往研究表明，circ-ZUFSP、circFOXP1可通过吸附微小RNA调控STOX1、S100A11基因的表达，影响滋养层细胞的功能，从而影响反复妊娠丢失的发生发展。但是目前尚无针对反复妊娠丢失早期诊疗的有效靶标，缺乏有效早期预测和干预手段。发明内容针对目前尚无针对反复妊娠丢失早期诊断治疗的有效靶标，缺乏有效早期筛查干预手段的问题，本发明提供了一种反复妊娠丢失早期预测诊断试剂盒用标志物和干预药物，提高现有诊疗标记物对反复妊娠丢失诊断和干预效果。为了实现上述目的，本发明一方面提供一种反复妊娠丢失早期预测诊断试剂盒用标志物，具体是RNA-circSTK40在制备反复妊娠丢失早期预测诊断试剂盒中的应用，该标志物包括RNA-circSTK40和SETD1B。进一步地，所述标志物还包括组蛋白H3。本发明第二方面提供一种反复妊娠丢失早期干预药物，具体表现为RNA-circSTK40在制备反复妊娠丢失早期干预药物中的应用。该药物包括RNA-circSTK40，所述RNA-circSTK40为环状，所述RNA-circSTK40的核苷酸序列如SEQ ID NO.1所示。通过上述技术方案，本发明实现了以下有益效果：1、本发明采用RNA-circSTK40联合SETD1B2、采用环状RNA-circSTK40用于降低自然流产风险，以进一步用于药物开发，促进临床转化。"
  },
  {
    "专利名": "棕榈油酸在制备调节造血干细胞移植后肠道菌群改善急性移植物抗宿主病的药物中的应用",
    "申请号": "CN202410724314.X",
    "公开日": "20240906",
    "IPC 分类号": "A61K31/201;A61P37/06;A61P1/00",
    "申请人": "福建医科大学附属第一医院",
    "关键词": "棕榈油酸、造血干细胞移植、肠道菌群改善、急性移植物抗宿主病、aGVHD、肠道微生态重塑、代谢调节、免疫通路、肠道稳态",
    "摘要": "本发明涉及棕榈油酸在制备调节造血干细胞移植后肠道菌群改善急性移植物抗宿主病的药物中的应用，涉及生物医学领域。POA在治疗aGVHD小鼠中的积极作用包括改善生存情况、临床症状，促进靶器官损伤修复。其潜在机制是POA通过促进肠道微生态重塑、调节代谢和免疫通路，保护肠道稳态，降低靶器官损伤。",
    "说明书": "棕榈油酸在制备调节造血干细胞移植后肠道菌群改善急性移植物抗宿主病的药物中的应用技术领域本发明涉及生物医学领域，具体涉及棕榈油酸在制备调节造血干细胞移植后肠道菌群改善急性移植物抗宿主病的药物中的应用。背景技术异基因造血干细胞移植(allo-HSCT)是治愈白血病等恶性血液病、重症再生障碍性贫血和遗传性血液病的有效方法。目前，急性移植物抗宿主病(aGVHD)是allo-HSCT后的常见并发症和主要死亡原因，它严重制约了allo-HSCT的临床应用。按照目前allo-HSCT病例数增加的趋势，aGVHD患者的数量也将大大增加。糖皮质激素仍是治疗aGVHD的标准一线药物，治愈率仅不到1/2。aGVHD的临床症状主要是供体T细胞攻击宿主靶器官造成，如皮疹、腹泻和黄疸。原发病、感染和放化疗预处理损伤导致皮肤、肠道粘膜屏障破坏是诱发aGVHD发病的导火线。对粘膜屏障的破坏使细菌异位穿过粘膜，异位的细菌和组织损伤的分子模式激发了供体T细胞的应答，当供体T细胞对宿主细胞上人类白细胞抗原(HLA)作出反应时，就会出现aGVHD。在这个过程中肠道微生物起着至关重要的作用。人类肠黏膜面积在250～400m21314已有报道的多种机制解释肠道微生物群如何影响aGVHD的发展。由于预处理放化疗破坏了肠上皮屏障，微生物的细菌或微生物相关分子模式(MAMP)得以穿过屏障刺激宿主细胞产生炎症。MAMP与人类细胞上的模式识别受体相互作用，招募在GVHD中起作用的炎症细胞。此外，肠道微生物群可通过产生代谢物如短链脂肪酸(SCFA)丁酸盐影响宿主细胞生理学。丁酸盐是肠上皮细胞的主要能量来源，影响炎症信号通路，在高浓度下还能够促进肠内伤口愈合。在小鼠模型中，由肠道微生物群产生的SCFA能够减弱GVHD，肠道组织中丁酸水平下降与GVHD相关，而经过丁酸盐或梭菌混合物灌胃可降低GVHD不依赖于Treg细胞数。丁酸盐还起到组蛋白脱乙酰酶抑制剂的作用，抑制激活的T细胞。另一方面，HSCT患者胃肠道的变化也可能反过来影响肠道微生物群。例如，小肠中产生抗菌肽的潘氏细胞缺失导致致病生物的过度生长。因此潘氏细胞缺失也是人GVHD风险的标志。同样，大肠中杯状细胞及其分泌的相关粘液屏障缺失也与GVHD有关。粘液分隔了微生物群与上皮细胞，黏液屏障缺失增加了微生物刺激免疫细胞的机会。这些数据表明，肠道细菌、代谢物和GVHD之间并非仅仅是统计学上的联系，而是存在机制上的相互作用。针对微生物群改善GVHD的策略主要为通过各种方式补充益生菌，其余策略还有调整抗生素、补充益生元和代谢物。另外，微生物群还具有潜在的诊断与预测作用。益生菌策略包括直接补充益生菌。这可以通过粪菌移植(FMT)实现，包括鼻十二指肠、经结肠镜或灌肠应用，甚至口服微生物胶囊。最近的一项临床研究表明，FMT治疗激素耐药或激素依赖性肠道GVHD患者的安全性和有效性。其中，四分之三接受配偶或亲属FMT治疗的患者在治疗后获得完全反应，与外周血中Treg细胞的增加有关。如何选择最佳粪便供体的数据尚有限，目前，不确定使用干细胞供体或健康随机志愿者或兄弟姐妹的FMT是否更好，需要进一步的研究。在小鼠GVHD模型中，用乳酸杆菌也可改善GVHD。在不久的将来，益生菌可能会通过基因工程产生某些代谢物或抗菌肽(AMP)，从而对宿主有利。抗生素策略包括选择更多的窄谱药物，这些药物可能避免伤害有益的厌氧菌在allo-HSCT后促进抗炎环境的形成；尽量减少可能导致某些细菌生长的抗生素的使用时间(如粘液降解细菌中的粘杆菌)。有报道几种预防抗生素引起菌群失调的策略来防止艰难梭菌相关腹泻，如口服β-内酰胺酶或活性炭。益生元是不易消化的化合物，通常是低聚糖，共生细菌通过对益生元的代谢产生有益的代谢物，如菊糖型果聚糖和阿拉伯木聚糖。也有策略通过直接补充细菌代谢产物，完全绕过细菌。对于免疫功能严重受损的allo-HSCT受者，这种方法可能比益生菌策略更安全。包括使用SCFA(例如丁酸酯)及其类似物、能抑制艰难梭菌的次级胆汁酸、无菌粪便滤液能够恢复微生物多样性。另外吲哚及其衍生物可以抑制革兰氏阴性菌和念珠菌的生长，诱导免疫耐受，调节aGVHD。但微生物群的组成具有明显的个体差异和地理差异，开展多中心研究至关重要。需要进一步研究，以期前瞻性多中心方式能够更好地描aGVHD与微生物群的变化，FMT的供体选择、补充剂的计量、用法，影响肠道微生物群变化的因素，以及细菌配体及其代谢物对宿主表型的影响。这些新发现极大可能改变目前HSCT受者的标准治疗。鉴于此，本发明提供棕榈油酸在制备调节造血干细胞移植后肠道菌群改善急性移植物抗宿主病的药物中的应用。发明内容本发明所要解决的技术问题是提供棕榈油酸(POA)在制备调节造血干细胞移植后肠道菌群改善急性移植物抗宿主病的药物中的应用。目的是探讨POA通过调节肠道稳态，保护aGVHD靶器官进而改善aGVHD的作用及机制，为治疗aGVHD提供新策略。本发明解决上述技术问题的技术方案如下：第一方面，棕榈油酸在制备调节造血干细胞移植后肠道菌群改善急性移植物抗宿主病的药物中的应用。进一步，棕榈油酸通过促进肠道微生态重塑、调节代谢和免疫通路，来保护肠道稳态，降低靶器官损伤，从而改善急性移植物抗宿主病。进一步，所述棕榈油酸抑制T细胞增殖，抑制T细胞产生IFN-γ。进一步，所述棕榈油酸提高肠道的短链脂肪酸含量，减少小鼠肠道的柠檬酸、苏氨酸和亮氨酸。进一步，所述棕榈油酸提高结肠内容物中Pseudahrensia、B2M28、Rikenella、拟杆菌属、乳酸菌丰度。第二方面，一种改善急性移植物抗宿主病的产品，包括所述的棕榈油酸。进一步，上述的改善急性移植物抗宿主病的产品包括药物和功能食品。进一步，所述药物还包括药物学上可接受的载体和/或辅料。优选地，所述药学上可接受的载体和/或辅料包括药学上可接受的载体、稀释剂、填充剂、结合剂及其它赋形剂，这依赖于给药方式及所设计的剂量形式。进一步，所述药物的剂型为口服剂型或注射剂型。另外，所述的药物中的活性成分(本发明的POA)的实际剂量应根据多种相关因素来确定，包括待治疗的疾病严重程度、施用途径、患者年龄、性别、体重，因此，上述剂量不应以任何方式限制本发明的保护范围。所述的抑制剂的适合给药剂量，根据制剂化方法、给药方式、患者的年龄、体重、性别、病态、饮食、给药时间、给药途径、排泄速度及反应灵敏性之类的因素而可以进行多种处方，熟练的医生通常能够容易地决定处方及处方对所希望的治疗有效的给药剂量。本发明构建aGVHD小鼠模型，评价POA对小鼠结局、临床症状的干预作用，使用血细胞计数仪检测造血重建、流式细胞术检测免疫状态、HE及免疫荧光染色检测靶器官损伤程度。构建白血病HSCT小鼠模型及荧光素酶细胞株，使用活体成像仪评价POA对GVL效应的影响。在体外实验中通过流式细胞术检测POA对T细胞增殖、活化、分泌的作用。通过FITC-葡聚糖方法检测肠道通透性、蛋白免疫印迹检查肠道紧密连接蛋白表达、气相色谱质谱联用检测丁酸盐浓度，评价POA对aGVHD小鼠肠道损伤的干预作用。使用16srDNA测序检测肠道内容物中的菌群分布、液相色谱质谱联用检测中短链脂肪酸浓度和非靶向代谢物差异，探讨POA调节aGVHD的作用机制。通过上述的研究发现了:(1)POA对aGVHD模型小鼠造血重建没有显著影响，不影响aGVHD小鼠CD4+及CD8+T细胞重建，但CD4+Foxp3+Treg细胞较同系移植组显著升高。POA组各组织破坏减轻，淋巴细胞浸润较少。肠道隐窝细胞受损减轻。肝脏T细胞性血管炎症及血窦中T细胞浸润减少。与溶剂对照组相比，POA对GVL效应无显著影响。体外实验中，POA抑制T细胞增殖，抑制T细胞产生IFN-γ，作用呈浓度依赖性。但是对IL-4的影响不随着浓度增加，对TGF-β、Foxp3无抑制。(2)POA组小鼠肠道通透性较溶剂对照组有所恢复，丁酸盐含量显著提高，紧密连接蛋白Occludin的表达升高。POA组结肠内容物中Pseudahrensia、B2M28、Rikenella、拟杆菌属、乳酸菌丰度升高。通过16SSilva数据库推测POA导致差异菌群的功能，主要与能量代谢、脂质代谢及PPAR信号通路有关。同时，POA还提高了丙酸、异丁酸、戊酸、己酸等短链脂肪酸含量，各短链脂肪酸浓度及代谢物丰度与各菌群物种丰度具有相关性，丁酸浓度与肠杆菌属负相关，丙酸、异丁酸浓度与拟杆菌正相关，戊酸浓度与Rikenella正相关。POA还导致肠道中柠檬酸减少，苏氨酸、亮氨酸减少。本发明的有益效果是：POA在治疗aGVHD小鼠中的积极作用包括改善生存情况、临床症状，促进靶器官损伤修复。其潜在机制是POA通过促进肠道微生态重塑、调节代谢和免疫通路，保护肠道稳态，降低靶器官损伤。"
  },
  {
    "专利名": "一种具有超氧化物歧化酶活性的碳点的制备方法",
    "申请号": "CN202410702713.6",
    "公开日": "20240913",
    "IPC 分类号": "B82Y20/00;A61K33/44;A61P43/00;C09K11/65;B82Y30/00;B82Y5/00;C01B32/15",
    "申请人": "吉林大学第一医院",
    "关键词": "超氧化物歧化酶活性、碳点制备方法、超声溶解、聚四氟乙烯内衬反应釜、烘箱加热、滤膜过滤、透析、冻干、白藜芦醇、氧化应激水平、活性氧损伤",
    "摘要": "本发明适用于生物医学领域，提供了一种具有超氧化物歧化酶活性的碳点的制备方法，所述方法包括：向氢氧化钠水溶液中加入氨基酸和白藜芦醇，超声溶解后将溶液转移至聚四氟乙烯内衬反应釜中，置于烘箱内加热，一段时间后取出反应釜。待反应釜冷却至室温后，以0.22μm的滤膜过滤产物水溶液并透析得到提纯的碳点溶液，冻干得到碳点固体。本发明以来源广泛、价格低廉、官能团丰富、生物安全性高的氨基酸和能够降低氧化应激水平、对抗活性氧损伤的白藜芦醇为原料，成功制备出具有超氧化物歧化酶活性的碳点。该制备方法简便，对多种氨基酸均适用，具有普适性，在生物医学领域具有良好的应用价值。",
    "说明书": "一种具有超氧化物歧化酶活性的碳点的制备方法技术领域本发明属于生物医学领域，尤其涉及一种具有超氧化物歧化酶活性的碳点的制备方法。背景技术活性氧是化学性质活泼、具有较高氧化活性的分子或离子的总称，主要包括超氧阴离子、羟基自由基等类型。活性氧含量的升高会导致生物大分子的损伤，与多种疾病的发生发展密切相关，如炎症、阿尔兹海默症等。因此，研究者们尝试通过降低活性氧水平治疗相关疾病，并已经取得了一定的进展。其中，超氧化物歧化酶能够催化超氧阴离子的歧化反应，生成氧气和过氧化氢，降低生物体内的氧化应激水平，受到了研究者们的广泛关注。超氧化物歧化酶是一种广泛存在于生物体内的酶，其催化活性高、生物安全性良好。然而，超氧化物歧化酶的分离和纯化成本高、稳定性差、储存困难等缺点极大地限制了其应用。自2007年首次报道了氧化铈纳米粒子具有类超氧化物歧化酶活性以来，越来越多具有超氧化物歧化酶活性的纳米材料被开发出来。研究者们不断尝试制备低成本、高稳定性和易储存的纳米材料作为超氧化物歧化酶模拟物，其中主要包括贵金属纳米材料(金、铂等)、金属氧化物纳米材料(氧化铈、氧化锰等)、金属-有机框架材料(ZIF-8等)等几类。但是，上述纳米材料普遍面临着潜在的生物安全性问题，在体内的降解十分困难，并且酶活性也相对较低，无法满足应用于生物医学领域的要求。因此，开发低毒性、高活性的超氧化物歧化酶模拟物具有重要的意义。当前存在的贵金属纳米材料、金属氧化物纳米材料和金属-有机框架材料等，作为超氧化物歧化酶模拟物，普遍存在酶活性不高的问题，而且可能面临潜在的生物毒性，无法满足在生物医学领域中的应用要求。现阶段，需要寻找新的解决方案来克服这些问题。发明内容本发明的目的在于提供一种具有超氧化物歧化酶活性的碳点的制备方法，旨在解决背景技术中确定的现有技术存在的问题。本发明是这样实现的，一种具有超氧化物歧化酶活性的碳点的制备方法，所述方法包括：S1、配制30mL的氢氧化钠溶液；S2、向所配制的氢氧化钠溶液中依次加入1.5-2.5g的氨基酸和1.3694g的白藜芦醇，并进行超声溶解；S3、将超声溶解后的溶液转移至50mL的聚四氟乙烯内衬反应釜中，并在150-200℃的温度下加热反应6-10小时；S4、待反应釜冷却至室温后，取出釜衬内水溶液，并去除水溶液中的固体杂质；S5、使用截留分子量为3500kDa的透析袋对过滤后的水溶液进行透析，去除水溶液中未反应的原料，得到提纯后的碳点溶液；S6、对碳点溶液进行冻干操作，得到碳点固体。作为本发明更进一步的方案，S1中所述的氢氧化钠溶液的pH值在12.0-12.5之间。作为本发明更进一步的方案，S2中所述的氨基酸为酪氨酸、色氨酸、精氨酸和天门冬氨酸中的一种。作为本发明更进一步的方案，S2中所述的氨基酸和白藜芦醇的加入顺序为先加氨基酸，后加白藜芦醇。作为本发明更进一步的方案，S4中所述的去除水溶液中的固体杂质，是使用0.22μm滤膜对水溶液进行固体杂质过滤。本发明的有益效果是：本发明以来源广泛、价格低廉、官能团丰富、生物安全性高的氨基酸和能够降低氧化应激水平、对抗活性氧损伤的白藜芦醇为原料，成功制备出具有超氧化物歧化酶活性的碳点。该制备方法简便，对多种氨基酸均适用，具有普适性，在生物医学领域具有良好的应用价值。"
  },
  {
    "专利名": "一种腹斑倭蛙抗氧化肽Atonp2及其基因和应用",
    "申请号": "CN202410694482.9",
    "公开日": "20240820",
    "IPC 分类号": "C07K14/46;A61K38/17;A61P17/16;A61P17/18;C12N15/12",
    "申请人": "昆明医科大学",
    "关键词": "基因编码、多肽、氨基酸序列、核苷酸序列、腹斑倭蛙、抗氧化肽",
    "摘要": "本发明涉及一种腹斑倭蛙抗氧化肽Atonp2及其基因和应用，属于生物医学领域。该抗氧化肽Atonp2是中国两栖类特有高原物种腹斑倭蛙皮肤防御肽基因编码的一种多肽，分子量为3127.58道尔顿，等电点为9.45，其氨基酸序列如SEQ ID NO:1所示。编码腹斑倭蛙Atonp2前体的基因(GenBank Accession No.OR797629)由666个核苷酸序列组成，其核苷酸序列如SEQ ID NO:2所示，其中第367–450位核苷酸为成熟腹斑倭蛙抗氧化肽Atonp2的编码基因。腹斑倭蛙抗氧化肽Atonp2在制备防治皮肤光损伤治疗药物中的应用。本发明的有益效果在于：提供一种新的具有强效防治皮肤光损伤作用的抗氧化活性多肽Atonp2。",
    "说明书": "一种腹斑倭蛙抗氧化肽Atonp2及其基因和应用技术领域本发明涉及一种腹斑倭蛙(Nanorana ventripunctata)抗氧化肽Atonp2及其基因和应用，属于生物医学领域。背景技术光损伤性皮肤病是指由紫外线直接或间接引起的一类皮肤病，是一类较常见，临床表现多样性的复杂疾病。光损伤性皮肤病，具有易反复、难治愈、严重影响容貌，对患者的心理影响超过任何其他疾病，且容易发生癌变，甚至导致死亡。近年来，由于大气臭氧层的破坏,辐射到地球表面的紫外线逐渐增多,由此引起的皮肤光损伤发病率急剧升高。近年来，全球治疗严重皮肤光损伤及由此诱发的皮肤癌每年带来的巨额医疗花费总计超过400多亿美元。故光损伤性皮肤病的预防和治疗已成为了全球关注的热点，更是当今医学领域关乎民生、亟待解决的重要问题。因此如何有效地预防及治疗紫外线引起的皮肤光损伤，在皮肤光损伤的防治过程中寻找到安全、低毒且成本低廉的新型高效抗氧化药物成为亟待解决的问题。两栖动物皮肤中含有大量结构新颖和功能复杂多样的药理活性多肽，是潜在药用分子开发利用的天然资源宝库。已有研究发现，两栖动物皮肤组织主要通过腺体分泌具有特定生物活性的分泌物来抵御紫外辐射，其中含大量天然多肽分子，特别是抗氧化活性多肽。腹斑倭蛙(Nanorana ventripunctata)是中国云南高海拔地区特有物种，生存环境具有较强和持久的紫外线辐射。随着生存进化，腹斑倭蛙皮肤中必然已进化出抵御持久强紫外线照射的防御分子。我们从腹斑倭蛙皮肤中分离鉴定出一条全新序列的cathelicidin抗氧化活性多肽，命名为Atonp2。Atonp2展现出较强的抗氧化活性，能有效保护紫外线辐射导致的小鼠皮肤光损伤，这可为光老化等光损伤性皮肤病的防治药物研发提供潜在新型候选分子。发明内容本发明的目的在于提供一种新的具有强效防治皮肤光损伤活性的腹斑倭蛙抗氧化肽Atonp2及其基因和应用。本发明的抗氧化肽Atonp2是中国两栖类高原地域特有物种腹斑倭蛙防御肽基因编码的一种cathelicidin家族多肽，分子量3127.58道尔顿，等电点9.45，多肽全序列一级结构(氨基酸序列SEQ ID NO:1)为：该抗氧化肽Atonp2前体的编码基因由666个核苷酸(SEQ ID NO:2)组成，其自5’端至3’端序列为:其中，第367–450位核苷酸为腹斑倭蛙抗氧化肽Atonp2成熟序列的编码基因。本发明旨在腹斑倭蛙抗氧化肽Atonp2对紫外线导致皮肤光损伤防治药物中的应用。本发明的有益效果在于：提供一种新的具有强效防治紫外线诱导的皮肤光损伤作用的抗氧化肽Atonp2，本发明中Atonp2具有显著的抗皮肤光损伤作用，能显著抑制皮肤光损伤的发生，能够在制备防治皮肤光损伤药物中应用。"
  },
  {
    "专利名": "一种免疫调节肽Ha-CATH1及其应用",
    "申请号": "CN202410664870.2",
    "公开日": "20240910",
    "IPC 分类号": "C07K14/46;A61K38/17;A61P17/02;A61P31/04;C12N15/12",
    "申请人": "昆明医科大学",
    "关键词": "免疫调节肽、Ha-CATH1、华西雨蛙防御肽、基因编码、基因核苷酸序列、促感染皮肤修复治疗药物",
    "摘要": "本发明公开了一种免疫调节肽Ha CATH1及其应用。属于生物医学领域。该免疫调节肽Ha CATH1是中国两栖类华西雨蛙防御肽基因编码的一种第六位半胱氨酸和第十一位半胱氨酸组成一对分子内二硫键的环状多肽，分子量3687.13道尔顿，等电点12，其氨基酸序列为SEQ ID NO:1所示。编码免疫调节肽Ha CATH1前体的基因(GenBank accession:PP706157)由660个核苷酸序列组成，其核苷酸序列为SEQ ID NO:2所示；其中第376–468位核苷酸为免疫调节肽Ha CATH1的编码基因。免疫调节肽Ha CATH1在制备促感染皮肤修复治疗药物中的应用。",
    "说明书": "一种免疫调节肽Ha-CATH1及其应用技术领域本发明属于生物医学技术领域，具体涉及一种免疫调节肽Ha-CATH1及其应用。背景技术两栖动物出现于两亿年前，是最原始的陆生脊椎动物。两栖动物既有从鱼类继承下来适于水生的性状，如卵和幼体的形态及产卵方式等；又有新生的适应于陆栖的性状，如感觉器、运动装置及呼吸循环系统等。两栖动物的皮肤是一种复杂的黏膜器官，具有特殊的适应能力，以执行各种关键的生理功能（如离子运输、呼吸、吸水等），同时仍然保持对外部环境的选择性屏障。它与水生和/或陆地环境中微生物种类多样和负载丰富的直接和连续接触。因此，两栖动物的皮肤是一个重要的先天免疫器官，是抵御环境中病原体的第一道防线。两栖动物的皮肤比其他动物更易受到生物或非生物伤害，已经进化出应对环境挑战的能力。除了存在复杂的腺系统外，两栖动物皮肤有一个神奇特征，那就是它们能够迅速愈合穿透真皮层的深层伤口，而不形成疤痕，包括任何腺体的完全再生，这使其能够在广泛的栖息地探索和生存。华西雨蛙（Hyla annectans发明内容本发明的第一目的在于提供一种免疫调节肽Ha-CATH1；第二目的在于提供所述的免疫调节肽Ha-CATH1的应用。本发明的第一目的是这样实现的，所述的免疫调节肽Ha-CATH1的核苷酸序列如序列表SEQ ID NO：1所示。本发明所述的免疫调节肽前体的编码基因由660个核苷酸组成，其核苷酸序列为SEQ ID NO:1所示，其自5’端至3’端序列为：其中，第376–468位核苷酸为免疫调节肽Ha-CATH1的编码基因。本发明的免疫调节肽Ha-CATH1是中国两栖动物华西雨蛙防御肽基因编码的一种第六位半胱氨酸和第十一位半胱氨酸组成一对分子内二硫键的环状多肽，由31个氨基酸残基构成，分子量3687.13道尔顿，等电点12，其氨基酸序列为SEQ ID NO:2。本发明的第二目的是这样实现的，所述的免疫调节肽Ha-CATH1在制备促皮肤感染修复治疗药物中的应用。本发明的有益效果在于：提供一种新的免疫调节肽Ha-CATH1，该免疫调节肽具有显著的促进感染皮肤修复的功能，能够在制备促感染皮肤修复治疗药物中应用。"
  },
  {
    "专利名": "BMP9在提高间充质干细胞分泌的小细胞外囊泡中miR-874-3p含量中的应用",
    "申请号": "CN202410660804.8",
    "公开日": "20240827",
    "IPC 分类号": "C12N5/0775",
    "申请人": "天津市天津医院",
    "关键词": "BMP9应用、间充质干细胞、小细胞外囊泡、miR-874-3p含量、治疗骨缺损",
    "摘要": "本发明属于生物医学领域，公开了BMP9在提高间充质干细胞分泌的小细胞外囊泡中miR 874 3p含量中的应用。通过本发明的方法可以获得高表达miR 874 3p含量的间充质干细胞分泌的小细胞外囊泡以用于治疗骨缺损。",
    "说明书": "BMP9在提高间充质干细胞分泌的小细胞外囊泡中miR-874-3p含量中的应用技术领域本发明属于生物医学领域，涉及BMP9在提高间充质干细胞分泌的小细胞外囊泡中miR-874-3p含量中的应用。背景技术间充质干细胞(MSCs)在体内广泛分布,并被广泛用作组织形成和再生的重要来源。间充质干细胞向成骨谱系的分化是一个复杂的多阶段过程，受多种激素、转录因子和细胞信号通路的调节。通常，使用骨形态发生蛋白、地塞米松、β-甘油磷酸钠和抗坏血酸等激素组合来刺激成骨细胞的体外分化和成熟。然而，人们发现这样诱导的MSC成骨分化的效率不充分且不一致。骨形态发生蛋白9(BMP9)，也称为生长分化因子2(GDF2)，之前被认为是BMP家族中最有效的成骨生长因子之一。BMP9属于转化生长因子-β(TGF-β)超家族，参与成骨、血管生成和肝脏发育。最近的研究发现，BMP9参与结直肠癌、非酒精性脂肪肝、肝纤维化和肝细胞癌以及关节再。BMP9已被证明是最有效的BMP之一，在体内和体外均可促进MC3T3-E1和间充质干细胞(MSC)的成骨分化。最近，BMP-9具有诱导MSC或成骨细胞谱系(例如MC3T3-E1细胞)分化为成骨细胞的独特能力。随着间充质干细胞研究的深入，近年来研究越来越关注干细胞小细胞外囊泡(sEV)的释。sEV包含各种直径为30-200nm的膜结合小颗粒，通常包含一系列生物分子，例如mRNA、microRNA、蛋白质和脂质。越来越多的研究表明，间充质干细胞衍生的sEV是再生医学和组织工程细胞治疗中非常有吸引力的候选者。MSC衍生的sEV的有益作用已在多种组织再生中得到证实，例如软骨、骨、肌肉、肌腱和皮肤。既往研究还揭示了MSC衍生的sEV在骨缺损中的促成骨和促血管生成作用据源细胞的状态或外部刺激，sEV的含量概况动态变化并决定sEV的功能特性。例如，外部二甲双胍可以刺激间充质干细胞衍生的sEV释放并优化椎间盘退变的治疗效果。因此，我们推测，用BMP9进行适当的预处理可能会诱导MSC释放sEV，从而上调与成骨相关的因子的产生并增强骨再生潜力。发明内容根据本发明的一个方面，本发明提供了BMP9在提高间充质干细胞分泌的小细胞外囊泡中miR-874-3p含量中的应用。进一步，间充质干细胞可以选自人脐带间充质干细胞、脐带血间充质干细胞、骨髓间充质干细胞、脂肪间充质干细胞、滑膜间充质干细胞、胎盘间充质干细胞、肝脏间充质干细胞、肌肉间充质干细胞、肺间充质干细胞、胰腺间充质干细胞和牙髓间充质干细胞中的任意一种。进一步，所述间充质干细胞是骨髓间充质干细胞。根据本发明的第二个方面，本发明提供了BMP9在制备提高间充质干细胞分泌的小细胞外囊泡中miR-874-3p含量的试剂中的应用。进一步，间充质干细胞可以选自人脐带间充质干细胞、脐带血间充质干细胞、骨髓间充质干细胞、脂肪间充质干细胞、滑膜间充质干细胞、胎盘间充质干细胞、肝脏间充质干细胞、肌肉间充质干细胞、肺间充质干细胞、胰腺间充质干细胞和牙髓间充质干细胞中的任意一种。进一步，所述间充质干细胞是骨髓间充质干细胞。根据本发明的第三个方面，本发明提供了一种提高间充质干细胞分泌的小细胞外囊泡中miR-874-3p含量的方法，所述方法包括将BMP9与间充质干细胞孵育。进一步，间充质干细胞可以选自人脐带间充质干细胞、脐带血间充质干细胞、骨髓间充质干细胞、脂肪间充质干细胞、滑膜间充质干细胞、胎盘间充质干细胞、肝脏间充质干细胞、肌肉间充质干细胞、肺间充质干细胞、胰腺间充质干细胞和牙髓间充质干细胞中的任意一种。进一步，所述间充质干细胞是骨髓间充质干细胞。进一步，所述方法包括如下步骤：1.5×10^6BMSCs被种植在培养皿中以达到70-80％的融合度；12小时后，细胞与含有100ng/mL BMP9的生长介质；BMP9预处理后，移除介质，多次冲洗细胞以消除残留的BMP9；加入新鲜的无血清α-MEM，再孵化2天；使用密度梯度超速离心法从BMSCs培养上清液中提取sEV；其中，所述生长介质包含α-MEM100U/mL青霉素、100μg/mL链霉素。所述骨髓间充质干细胞的制备方法如下：将骨髓悬浮于含有15％胎牛血清的α-MEM中，加入100U/ml青霉素和100μg/ml链霉素，在37℃、湿度5％CO2根据本发明的第四个方面，本发明提供了一种制备高表达miR-874-3p的间充质干细胞分泌的小细胞外囊泡的方法，所述方法包括将BMP9与间充质干细胞孵育。进一步，所述间充质干细胞是骨髓间充质干细胞。进一步，所述方法包括如下步骤：1.5×10^6BMSCs被种植在培养皿中以达到70-80％的融合度；12小时后，细胞与含有100ng/mL BMP9的生长介质；BMP9预处理后，移除介质，多次冲洗细胞以消除残留的BMP9；加入新鲜的无血清α-MEM，再孵化2天；使用密度梯度超速离心法从BMSCs培养上清液中提取sEV；其中，所述生长介质包含α-MEM 100U/mL青霉素、100μg/mL链霉素。进一步，所述骨髓间充质干细胞的制备方法如下：将骨髓悬浮于含有15％胎牛血清的α-MEM中，加入100U/ml青霉素和100μg/ml链霉素，在37℃、湿度5％ CO2根据本发明的第五个方面，本发明提供了利用前面所述的方法获得的高表达miR-874-3p的间充质干细胞分泌的小细胞外囊泡。本文中所用，“细胞外囊泡”或“EV”是指任何脂质层分隔的囊泡，其自然地从细胞中释放出来，并且与细胞不同，其不能复制。细胞外囊泡的直径范围从接近最小的物理上可能的单层脂质体的尺寸(约20-30纳米)到大至10微米或更大。EV携带来自母体细胞的有机分子载物(cargo)。本文所提及的裂解EV包含裂解脂质层和载物。已经提出了多种多样的EV亚型，根据尺寸、生物发生(biogenesis)路径、载物、细胞来源和功能进行了不同定义，从而产生了异源命名。已经提出了多种多样的EV亚型，其中名称为例如外泌体、核外粒体(ectosome)、微囊泡、微颗粒、癌小体(oncosome)、凋亡小体、外泌颗粒(exomere)等。这些EV亚型通过各种、通常重叠的定义进行定义，主要基于生物发生(细胞路径、细胞或组织同一性、起源条件)。然而，EV亚型还可以通过尺寸、组成分子、功能或分离方法来定义。细胞外囊泡可以从条件培养物中分离，以便可以进一步分析和/或纯化EV和EV载物。可以使用各种分离方法，包括差示超速离心、密度梯度超速离心、切向流过滤(TFF)、尺寸排阻色谱(SEC)、超滤、毛细管电泳、不对称流场-流分馏法、微流控法、聚合法、抗体包被微流控芯片以及亲和/免疫亲和捕获法。在一些实施方案中，使用切向流过滤和尺寸排阻色谱。在一些实施方案中，收集条件培养基，并使用TFF分离出小细胞外囊泡。然后使用SEC浓缩和纯化TFF分离的小细胞外囊泡。然后任选地可将SEC纯化的小细胞外囊泡在5℃下冻干以长期储存。小细胞外囊泡可以在溶液中，例如在去离子水中重组。在一些实施方案中，SEC在TFF之前进行。一些实施方案不包括浓缩步骤。在一些实施方案中，收集条件培养基，并使用TFF分离出大细胞外囊泡。然后可将TFF分离的大细胞外囊泡浓缩。然后任选地可将大细胞外囊泡在5℃下冻干以长期储存。大细胞外囊泡可以在溶液中，例如在去离子水中重组。一些实施方案不包括浓缩步骤。因此，如本文中所用，术语“小细胞外囊泡”和“大细胞外囊泡”是指使用SEC和TFF从上述小EV和大EV级分中分离出哪个细胞外囊泡级分。在一个实施方案中，大细胞外囊泡的直径大于150nm，而小细胞外囊泡的直径为150nm或更小，并且它们使用200nm过滤器彼此分离，然而，大EV和小EV不一定限于具有任何特定直径，并且可以存在于任一级分中。本发明的优点和有益效果：本发明首次发现BMP9增加BMSCs分泌的sEV中miR-874-3p的含量，增加的miR-874-3p含量可促进缺损修复。"
  },
  {
    "专利名": "一种免疫调节肽ButuCATH及其应用",
    "申请号": "CN202410664627.0",
    "公开日": "20240723",
    "IPC 分类号": "C07K14/46;A61K38/17;A61P17/02;A61P31/04;C12N15/12",
    "申请人": "昆明医科大学",
    "关键词": "免疫调节肽、ButuCATH、生物医学、两栖类圆疣蟾蜍、防御肽基因、环状多肽、氨基酸序列、基因编码、核苷酸序列、治疗皮肤感染、创伤药物",
    "摘要": "本发明公开了一种免疫调节肽ButuCATH及其应用。属于生物医学领域。免疫调节肽ButuCATH是来源于中国两栖类圆疣蟾蜍防御肽基因编码的一种第十二位半胱氨酸和第十五位半胱氨酸组成一对分子内二硫键的环状多肽，分子量3578.21道尔顿，等电点8.77，其氨基酸序列为SEQ ID NO:2所示。编码ButuCATH前体的基因（GenBank accession:PP579746）由696个核苷酸序列组成，其核苷酸序列为SEQ ID NO:1所示；其中第432–525位核苷酸为免疫调节肽ButuCATH的编码基因。免疫调节肽ButuCATH作为治疗皮肤感染和创伤药物的应用。",
    "说明书": "一种免疫调节肽ButuCATH及其应用技术领域本发明属于生物医学技术领域，具体涉及一种免疫调节肽ButuCATH及其应用。背景技术皮肤作为人体免疫系统的第一道防线，在保护身体免受外界侵害方面扮演着至关重要的角色。一旦皮肤受损，就容易引发伤口感染。伤口愈合的基本过程包括止血、炎症、增殖和组织重塑，这四个阶段在正常情况下是有条不紊地进行。然而当伤口出现感染，就会影响创伤愈合过程，导致伤口愈合延缓。通常治疗伤口感染的首选药物是抗生素，然而广泛使用抗生素会对患者产生副作用以及出现细菌耐药性，因此迫切需要寻找更加安全有效的治疗药物。在新的治疗药物中，抗菌肽（Antimicrobial peptides，AMPs）被认为是替代抗生素的首选药物，其具有更广泛的应用潜力和更少的耐药性问题。而除了广谱而高效的直接杀菌能力，有些AMPs还可以通过诱导巨噬细胞和中性粒细胞趋化到感染部位来间接抵抗微生物入侵，这些具有免疫调节功能的活性多肽也称为免疫调节肽。两栖动物是发掘AMPs的资源宝库。两栖动物是早期进化的陆生脊椎动物之一，幼体在水中生活并且用鳃呼吸，有尾巴，没有四肢，成体有四肢，能适应于水中和陆地上的不同环境，可以用肺和皮肤呼吸。两栖类动物皮肤裸露，其栖息环境潮湿，紫外线照射，因此非常适合病原微生物生长繁殖，这些因素都会导致其皮肤屏障受损。但经历了漫长的自然进化后，两栖动物裸露的皮肤仍能适应多种生活环境，这一适应性与其皮肤中的特殊结构和含有多种生物活性物质密切相关。圆疣蟾蜍（Bufo tuberculatus发明内容本发明的第一目的在于提供一种免疫调节肽ButuCATH；第二目的在于提供所述的免疫调节肽ButuCATH的应用。本发明的第一目的是这样实现的，所述的免疫调节肽ButuCATH的核苷酸序列如序列表SEQ ID NO：1所示。本发明所述的免疫调节肽该免疫调节肽前体的编码基因由696个核苷酸组成，其核苷酸序列为SEQ ID NO:1所示，其自5’端至3’端序列为，其中，第432–525位核苷酸为免疫调节肽Butu本发明的的第二目的是这样实现的，所述免疫调节肽Butu本发明的有益效果在于：提供一种新的免疫调节肽Butu"
  },
  {
    "专利名": "一种亚微米级球状超顺磁性四氧化三铁粒子及其制备方法、应用",
    "申请号": "CN202410624015.9",
    "公开日": "20240813",
    "IPC 分类号": "C01G49/08;G01N21/76",
    "申请人": "郑州伊美诺生物技术有限公司",
    "关键词": "亚微米级球状四氧化三铁粒子、溶剂热法、单分散超顺磁性、磁核表面修饰、饱和磁化强度、超顺磁性、包裹修饰、微球表面",
    "摘要": "本发明提供了一种亚微米级球状四氧化三铁粒子。本发明采用简单的溶剂热法一步制备得到，制备的单分散超顺磁性球状四氧化三铁粒子的尺寸在400～800nm范围内可任意调节，单分散性良好、粒径均一，粒径分布范围窄，磁核表面含有大量羧基，利于表面修饰或者包裹，饱和磁化强度达到88.09emu/g；同时具有超顺磁性，可直接作为模板，进行包裹修饰，微球表面更加致密、光滑，无缺陷。本发明提供的方法工艺简单、操作简便、重复性好、单批次产能可到达百克级，是一种简单、高效、可规模化制备大粒径磁核的方法，在生物医学领域具有良好的应用前景。",
    "说明书": "一种亚微米级球状超顺磁性四氧化三铁粒子及其制备方法、应用技术领域本发明属于生物纳米材料技术领域，涉及一种亚微米级球状四氧化三铁粒子及其制备方法、应用，尤其涉及一种亚微米级球状超顺磁性四氧化三铁粒子及其制备方法、应用。背景技术磁性微球由于其具有超顺磁性、大表面积、低毒且生物相容性好等优点，可作为体外诊断的固相载体，起到识别、捕获、控制与运输目标待检分子的载体作用，在生物分离工程中具有广泛的应用。以磁性微球为载体，通过修饰功能基团或者包被抗原、抗体等生物分子，在外加磁场下，可以从复杂的生物样本中获得目标生物分子，中间不需要过滤和离心等步骤，具有操作简单、效率高等优点。但是现有技术制备的磁珠往往磁含量较低，磁响应较弱，无法快速富集；同时，现有的方案很难一步制备出大粒径的磁核。因此，如何提供一种更为适宜的简单、高效、可规模化制备大粒径磁核的方法，也是诸多研发型生产厂商以及一线研究人员亟待解决的问题之一。发明内容有鉴于此，本发明要解决的技术问题在于提供一种亚微米级球状四氧化三铁粒子及其制备方法、应用，特别是一种亚微米级球状超顺磁性四氧化三铁粒子的制备方法，本发明制备的亚微米级球状四氧化三铁粒子的尺寸在400～800nm的范围内可任意调节，单分散性良好、粒径均一、粒径分布范围窄、表面含有大量羧基官能团，饱和磁化强度达到88.09emu/g，同时具有超顺磁性；而且生产工艺简单、操作简便、重复性好、单批次产能可到达百克级，更加适于工业化生产的推广和应用，在生物医学领域具有良好的应用前景。本发明提供了一种亚微米级球状四氧化三铁粒子，所述亚微米级球状四氧化三铁粒子的粒径为400～800nm；所述亚微米级球状四氧化三铁粒子具有超顺磁性。优选的，所述四氧化三铁粒子表面含有羧基官能团；所述四氧化三铁粒子具有致密且光滑的粒子表面；所述四氧化三铁粒子的粒径分布区间≤150nm。优选的，所述四氧化三铁粒子为实心四氧化三铁微球；所述四氧化三铁粒子具有介孔结构。本发明还提供了一种亚微米级球状四氧化三铁粒子的制备方法，包括以下步骤：1)将水滴加到无水氯化铁粉末上，得到块状固体；2)将上述步骤得到的块状固体与乙二醇混合后，得到混合溶液；3)将上述步骤得到的混合溶液、柠檬酸钠和无水乙酸钠再次混合后，进行溶剂热反应，得到亚微米级球状四氧化三铁粒子。优选的，所述滴加具体为均匀滴加，且无水氯化铁粉末均吸收了水；所述水和无水氯化铁的质量比为(1～2):(7～10)。优选的，所述无水氯化铁与乙二醇的质量体积比为(1～2)g:(10～15)mL；所述混合的方式包括超声和搅拌。优选的，所述柠檬酸钠与无水乙酸钠的质量比为(1～3):(6～26)；所述柠檬酸钠与无水氯化铁的质量比为(1～2):(8～10)。优选的，所述再次混合的具体步骤为，先将混合溶液与柠檬酸钠进行初混后，再加入无水乙酸钠，升温进行再次混合；所述升温的温度为40～80℃。优选的，所述溶剂热反应的温度为190～240℃；所述溶剂热反应的时间为6～12h；所述溶剂热反应的转速为30～100rpm。本发明还提供了上述技术方案任意一项所述的亚微米级球状四氧化三铁粒子或上述技术方案任意一项所述的制备方法所制备的亚微米级球状四氧化三铁粒子作为化学发光磁珠的内核的应用。本发明提供了一种亚微米级球状四氧化三铁粒子，所述亚微米级球状四氧化三铁粒子的粒径为400～800nm的范围内可任意调节；所述亚微米级球状四氧化三铁粒子具有超顺磁性。与现有技术相比，本发明采用简单的溶剂热法一步制备得到，制备的亚微米级球状四氧化三铁粒子的尺寸在400nm到800nm的范围内可任意调节，单分散性良好、粒径均一、粒径分布范围窄、表面含有大量羧基官能团，饱和磁化强度达到88.09emu/g，同时具有超顺磁性。本发明提供的制备方法工艺简单、操作简便、重复性好、单批次产能可到达百克级，在生物医学领域具有良好的应用前景。本发明还提供了一种单分散亚微米级球状超顺磁性四氧化三铁粒子的制备方法，特别采用无水氯化铁作为铁源，然后加入一定量的去离子水，一方面增加无水氯化铁在乙二醇中的溶解度，并改变了Fe3+--3+2+343434本发明提供的制备方法，制备的单分散超顺磁性球状四氧化三铁粒子磁核粒径更大，可达到400～800nm，且范围内可任意调节，粒径分布范围窄，具有超顺磁性，可直接作为模板，进行包裹修饰；而且该方法更加简单，且可实现单批次百克级以上规模生产；同时磁核表面含有大量羧基，利于表面修饰或者包裹，制备得到的磁颗粒粒径更加均一，且表面更加致密、光滑，无缺陷，是一种简单、高效、可规模化制备大粒径磁核的方法。"
  },
  {
    "专利名": "一种结合PHGDH蛋白的核酸分子及其应用",
    "申请号": "CN202410608661.6",
    "公开日": "20240802",
    "IPC 分类号": "A61K31/7088;C12N15/113;A61P35/00",
    "申请人": "重庆医科大学",
    "关键词": "核酸分子、寡RNA分子、PHGDH蛋白、靶mRNA、肝癌细胞增殖、肝细胞癌、药物开发",
    "摘要": "本发明属于生物医学领域，公开了一种结合PHGDH蛋白的核酸分子，是一种寡RNA分子，所述核酸分子每个核苷酸的核糖上都有2' O甲基修饰。本发明公开的结合PHGDH蛋白的核酸分子，能够阻断PHGDH对靶mRNA结合能力，限制PHGDH促进肝癌细胞增殖的能力，可应用于治疗肝细胞癌，开发抑制PHGDH蛋白功能的药物。",
    "说明书": "一种结合PHGDH蛋白的核酸分子及其应用技术领域本发明属于生物医学领域，具体涉及一种结合PHGDH蛋白的核酸分子及其应用。背景技术肝癌是全球第六大常见的肿瘤，也是导致肿瘤相关死亡的第三大常见原因，其中肝细胞癌(Hepatocellular carcinoma，HCC)(以下简称肝癌)占原发性肝癌的80％以上。近年来流行病学数据还表明，HCC的病因危险因素从病毒相关肝病转变为非病毒性肝病，这对HCC预防(包括HCC监测)和治疗具有重要意义。尽管在肝癌早期阶段发现疾病并进行适当治疗可以极大改善患者的预后，但由于当前肝癌诊断技术的限制，大多数患者被诊断出肝癌时已经发展至中晚期。因此进一步探索肝癌潜在治疗靶点及制定临床治疗新策略具有重要意义。RBP通常被认为是通过一个或多个球状RNA结合域(RNAbinding domain，RBD)结合RNA并调控RNA命运或功能的蛋白质。目前在哺乳动物细胞中已经发现数以千计的RBP。RBPs作为转录后调控的关键分子，在转录后基因表达调节中起着重要作用。真核生物编码的RBP极为多样，通过特异的RNA识别和结合机制，调控RNA代谢的全过程。在RNA加工成熟的不同阶段，会与不同类型的RBP结合形成核糖核蛋白复合体，介导其成熟、转运、定位和翻译过程的调控。利用RNA结合蛋白能够特异地、高度亲和地识别不同RNA基序这一特点，设计并合成带有RNA结合蛋白的RNA结合基序的诱饵寡核苷酸，竞争结合RNA结合蛋白，封闭其RNA结合活性，从而干扰它在细胞中的功能发挥。磷酸甘油酸脱氢酶(phosphoglycerate dehydrogenase，PHGDH)是丝氨酸生物合成途径中的关键限速酶，在乳腺癌、黑色素瘤、肺癌、结肠癌和胰腺癌等多种肿瘤中高表达，导致细胞增殖和迁移能力增强，与肿瘤患者的不良预后密切相关，并且与肿瘤细胞的耐药也密切相关。已有研究表明，PHGDH不仅可以通过丝氨酸代谢酶的经典代谢功能促进肿瘤进展，还可以通过兼职功能(moonlight function)参与肿瘤的恶性进程。通过研究证实PHGDH可以作为RNA结合蛋白促进肝癌进展，表明靶向PHGDH的RBP功能可能是一种潜在的治疗策略。发明内容有鉴于此，本发明的目的在于提供一种结合PHGDH蛋白的核酸分子及其应用。本发明旨在找到PHGDH蛋白的RNA结合基序，以便开发抑制PHGDH蛋白功能的药物。本发明公开了一种结合PHGDH蛋白的核酸分子，所述核酸分子是一种寡RNA分子。进一步，所述核酸分子为单链RNA分子，所述核酸分子每个核苷酸的核糖上都有2'-O-甲基修饰。本发明还公开了结合PHGDH蛋白的核酸分子在制备治疗肿瘤的药物中的应用，所述肿瘤为乳腺癌、黑色素瘤、肺癌、结肠癌、胰腺癌。本发明还公开了一种治疗肿瘤的药用组合物，其活性成包括上述结合PHGDH蛋白的核酸分子，所述肿瘤为乳腺癌、黑色素瘤、肺癌、结肠癌、胰腺癌。有益效果：本发明提供了一种结合PHGDH蛋白的核酸分子，能够阻断PHGDH对靶mRNA结合能力，限制PHGDH促进肝癌细胞增殖的能力，可应用于治疗肝细胞癌。本发明考察了靶向阻断PHGDH对其识别的mRNA结合能力在肝癌转移和预后判断中的应用价值，结果表明：在将带有PHGDH蛋白RNA结合基序的寡核苷酸转染至人肝癌细胞，能够显著抑制肝癌细胞的增殖能力。此外，PHGDH蛋白RNA结合基序的寡核苷酸能抑制裸鼠体内移植细胞成瘤大小，提示带有PHGDH蛋白RNA结合基序的寡核苷酸具有通过特异性靶向PHGDH蛋白来抑制肝癌细胞增殖功能，具有推向临床治疗的潜力。本发明的其他优点、目标和特征在某种程度上将在随后的说明书中进行阐述，并且在某种程度上，基于对下文的考察研究，对本领域技术人员而言将是显而易见的，或者可以从本发明的实践中得到教导。本发明的目标和其他优点可以通过下面的说明书来实现和获得。"
  },
  {
    "专利名": "一种介孔二氧化硅纳米颗粒表面修饰用的重组双接头蛋白",
    "申请号": "CN202410592275.2",
    "公开日": "20240705",
    "IPC 分类号": "C12N15/62;C07K1/22;C12N1/21;C07K1/107;C12N15/70;C07K19/00;C12R1/19",
    "申请人": "北京师范大学",
    "关键词": "介孔二氧化硅纳米颗粒、表面修饰、重组双接头蛋白、氨基酸序列、非共价键、链霉亲和素、生物素化、功能蛋白、药物载体、靶向性、药物载荷能力、多功能纳米医药材料、纳米医药材料",
    "摘要": "本发明提供一种介孔二氧化硅纳米颗粒表面修饰用的重组双接头蛋白，涉及生物技术领域。该重组双接头蛋白氨基酸序列为。该蛋白能通过非共价键与MSN表面稳定结合，并通过单体链霉亲和素与生物素化的功能蛋白相连，实现功能蛋白在MSN表面的高效修饰。与传统修饰策略相比，本发明所提供的重组双接头蛋白展现出卓越的稳定性、显著的修饰效果、简化的操作步骤以及良好的安全性。本发明不仅提高了MSN作为药物载体的靶向性和药物载荷能力，而且为制备具有优异生物学特性的MSN药物载体提供了一种高效方法，从而促进多功能纳米医药材料在生物医学领域的进一步应用。",
    "说明书": "一种介孔二氧化硅纳米颗粒表面修饰用的重组双接头蛋白技术领域本申请涉及生物技术领域，具体涉及一种重组双接头蛋白及其制备方法。背景技术介孔二氧化硅纳米颗粒(MSN)是一种新兴的纳米医药材料，具有载药量大、物理稳定性高、粒径和形状可调等优点，适合多种给药需求，在生物医学领域具有重要的应用潜力。传统药物给药存在水溶性差、脱靶效应高、生物利用度低、疗效欠佳、毒性高等缺点。相比之下，以MSN为载体具有多种优势，例如增加物理稳定性，改善药物特性，扩大载药量，降低给药频率和最小的副作用。纳米材料的表面功能化在其物理和化学性质及其应用中起着关键作用。因此，颗粒表面的修饰或功能化在制造MSN作为多功能化平台十分关键。MSN通过表面功能化，可以与不同抗体结合，用于肿瘤靶向治疗。探索纳米载体的功能化有望提高各种疾病的治疗效果，提高患者的耐受性以及降低社会经济负担。但现阶段的二氧化硅的修饰方法复杂、耗时、成本高。发明内容本发明旨在提供一种模块化、正交化、普适性高的双接头蛋白，并提供该蛋白质结合试剂盒。本发明利用合成生物学的方法结合蛋白质工程提供一种模块化、正交化、普适性高的双接头蛋白，通过该双接头蛋白可以将功能蛋白修饰在二氧化硅表面，有效优化了介孔二氧化硅的蛋白质修饰方法。为了实现上述目的，本发明实施例提供如下技术方案：第一方面，本发明提供一种重组双接头蛋白，其特征在于，所述蛋白基于SBP标签，可以非共价键连接在二氧化硅表面；通过单体链霉亲和素与生物素化蛋白质连接；该重组双接头蛋白氨基酸序列为。优选的，所述蛋白具有较强的化学稳定性，并与二氧化硅具有较强的结合效果。第二方面，本发明提供一种重组双接头蛋白结合剂盒，其特征在于，包括一管重组双接头蛋白、一瓶重组双接头蛋白缓冲液、一瓶双接头蛋白洗脱液；其中的重组双接头蛋白具有以上所述的氨基酸序列。优选的，所述结合试剂盒中重组双接头蛋白溶于缓冲液中即可与生物素化蛋白连接，使用洗脱液即可减弱连接作用，将重组双接头蛋白与生物素化蛋白分开。第三方面，本发明提供一种制备重组双接头蛋白的方法，其特征在于步骤为：(1)通过PCR方法扩增出所述的重组双接头蛋白的编码基因后构建到pET-Duet1表达载体上；(2)将步骤(1)中鉴定正确的表达载体转化到BL21(DE3)感受态细胞上，进行培养表达；(3)将步骤(2)中表达的目的蛋白利用镍离子亲和层析纯化蛋白；(4)将步骤(3)中纯化蛋白使用凝血酶除His标签暴露单体链霉亲和素结构域。第三方面，本发明提供一种重组双接头蛋白进行介孔二氧化硅纳米颗粒(MSN)表面修饰的方法，其特征在于步骤为：(1)将重组双接头蛋白与生物素化蛋白在缓冲液中共孵育，使得重组双接头蛋白基于链霉亲和素与生物素相互作用与目的蛋白连接；(2)将重组双接头蛋白与生物素化蛋白混合孵育物与介孔二氧化硅纳米颗粒(MSN)混合，使重组双接头蛋白非共价连接在MSN表面；(3)利用缓冲液进行洗杂，去除未修饰的杂蛋白。第四方面，本发明提供一种生物材料，该生物材料为下述(a1)或(a2)中任一种：(a1)含有权利要求1所述编码基因的重组载体；(a2)含有权利要求1所述编码基因的重组菌。本发明的技术效果是：本发明利用基于SBP(Silica Binding Peptide)标签的重组双接头蛋白，该蛋白能通过非共价键与MSN表面稳定结合，并通过单体链霉亲和素与生物素化的功能蛋白相连，实现功能蛋白在MSN表面的高效修饰。与传统修饰策略相比，本发明所提供的重组双接头蛋白展现出卓越的稳定性、显著的修饰效果、简化的操作步骤以及良好的安全性。本发明不仅提高了MSN作为药物载体的靶向性和药物载荷能力，而且为制备具有优异生物学特性的MSN药物载体提供了一种高效方法，从而促进多功能纳米医药材料在生物医学领域的进一步应用。"
  },
  {
    "专利名": "IL-1RL1刺激剂在制备上调动物细胞中FAM134B表达水平的试剂中的应用",
    "申请号": "CN202410589810.9",
    "公开日": "20240827",
    "IPC 分类号": "A61P35/00;A61P31/00;A61P1/00;A61K38/20;A61P25/28;A61P9/04;A61P25/16;A61P25/14;A61P9/10;A61P25/00;A61P9/00;C12N5/0784;A61P31/04",
    "申请人": "中国人民解放军总医院",
    "关键词": "IL-1RL1刺激剂、上调动物细胞、FAM134B表达水平、试剂制备、白细胞介素33、树突状细",
    "摘要": "本发明公开了IL-1RL1刺激剂在制备上调动物细胞中FAM134B表达水平的试剂中的应用，属于生物医学领域。本发明通过研究IL-1RL1刺激剂白细胞介素33(IL-33)对动物细胞中FAM134B表达水平的影响，发现IL-33能够上调动物细胞中FAM134B表达水平。IL-1RL1刺激剂可用于制备上调动物细胞中FAM134B表达水平的试剂。",
    "说明书": "IL-1RL1刺激剂在制备上调动物细胞中FAM134B表达水平的试剂中的应用技术领域本发明是属于生物医学领域，特别是关于IL-1RL1刺激剂在制备上调动物细胞中FAM134B表达水平的试剂中的应用。背景技术序列相似性家族134成员B(family with sequence similarity 134,member B，FAM134B)，又名RETREG1(reticulophagy regulator 1)，2001年作为癌基因在食管鳞状细胞癌中被发现，2015年被证实为一种非常重要的内质网选择性自噬受体。该蛋白主要定位于内质网的片状结构，有两个重要的结构域：微管相关蛋白1轻链3(LC3)结合结构域(LIR)和网织体同源结构域(RHD)。LIR负责与自噬体结合，而RHD则感知并诱导内质网膜弯曲。FAM134B介导的内质网自噬在许多疾病中发挥着极其关键的作用，包括神经系统疾病、消化系统疾病、心血管疾病、感染性疾病和肿瘤等。FAM134B强大的生物学效应正逐渐得以揭示，研究FAM134B的调控机制和策略，无论在理论研究层面，还是在实际应用层面，均具有重要意义。公开于该背景技术部分的信息仅仅旨在增加对本发明的总体背景的理解，而不应当被视为承认或以任何形式暗示该信息构成已为本领域一般技术人员所公知的现有技术。发明内容本发明通过研究IL-1RL1刺激剂白细胞介素33(IL-33)对动物细胞中FAM134B表达水平的影响，发现IL-1RL1刺激剂能够通过其特异性受体IL-1RL1上调动物细胞中FAM134B表达水平。本发明第一方面提供IL-1RL1刺激剂在制备上调动物细胞中FAM134B表达水平的试剂中的应用。在本发明的一实施方式中，所述动物为哺乳动物。在本发明的一实施方式中，所述细胞为树突状细胞(DCs)。本发明第二方面提供一种上调动物细胞中FAM134B表达水平的方法，包括向动物细胞施用含有IL-1RL1刺激剂的试剂。本发明第三方面提供IL-1RL1刺激剂在制备治疗FAM134B相关疾病的药物中的应用。在本发明的一实施方式中，所述IL-1RL1刺激剂为白细胞介素33(IL-33)。在本发明的一实施方式中，IL-33的浓度优选为1～10ng/ml。在本发明的一实施方式中，所述FAM134B相关疾病选自神经系统疾病、消化系统疾病、心血管疾病、感染性疾病和肿瘤。在本发明的一实施方式中，所述神经系统疾病为阿尔茨海默病、帕金森病或亨廷顿病。在本发明的一实施方式中，所述心血管疾病为心肌梗死或心力衰竭。在本发明的一实施方式中，所述感染性疾病为脓毒症。本发明提及的哺乳动物可为任何哺乳动物，包括但不限于啮齿目动物、兔形目动物、偶蹄目动物、奇蹄目动物、灵长目动物、食肉目动物。啮齿目动物包括但不限于鼠科动物(小鼠、大鼠)和仓鼠科动物(仓鼠)。兔形目动物包括但不限于兔科动物(兔)。偶蹄目动物包括但不限于牛科动物(牛、羊)和猪科动物(猪)。奇蹄目动物包括但不限于马科动物(马)。灵长目动物包括但不限于猴科(猕猴)、长臂猿科(长臂猿)、人科(人、黑猩猩)。优选的，哺乳动物为啮齿目动物或灵长目动物。特别优选的哺乳动物为人。本发明的药物可以通过本领域任何已知的方式配制药物组合物来使用。这种组合物包含活性成分，加上一种或多种药物可接受的载体、稀释剂、填充剂、结合剂及其它赋形剂，这依赖于给药方式及所设计的剂量形式。本领域枝术人员已知的治疗惰性的无机或有机的载体包括(但不限于)乳糖、玉米淀粉或其衍生物、滑石、植物油、蜡、脂肪、多羟基化合物例如聚乙二醇、水、蔗糖、乙醇、甘油，诸如此类，各种防腐剂、润滑剂、分散剂、矫味剂。保湿剐、抗氧化剂、甜味剂、着色剂、稳定剂、盐、缓冲液诸如此类也可加入其中，这些物质根据需要用于帮助配方的稳定性或有助于提高活性或它的生物有效性或在口服的情况下产生可接受的口感或气味，在这种组合物中可以使用的制剂可是其原始化合物本身的形式，或任选地使用其药物学可接受的盐的形式，本发明的药物可以单独给药，或以各种组合给药，以及与其它治疗药剂一起结合形式给药。如此配制的组合物根据需要可选择本领域技术人员已知的任何适当的方式把药物进行给药。使用药物组合物时，是将安全有效量的本发明的药物施用于人，具体剂量还应考虑给药途径、病人健康状况等因素，这些都是熟练医师技能范围之内的。本发明的药物可根据需要制备成各种剂型。包括但不限于，经皮、粘膜、鼻、口颊、舌下或经口使用的片剂、溶液剂、颗粒剂、贴剂、膏剂、胶囊剂、气雾剂或栓剂。本发明的药物的施用途径不受限制，只要它能发挥期望的治疗效果或预防效果即可，包括但不限于静脉内，腹膜内，眼内，动脉内，肺内，口服，小泡内，肌肉内，气管内，皮下的，通过皮肤，通过胸膜，局部的，吸入，通过粘膜，皮肤，肠胃，关节内，心室内，直肠，阴道，颅骨内，尿道内，肝内，瘤内。在某些情况下，可以系统地给药。在某些情况下是局部地给药。本发明的药物的剂量不受限制，只要获得期望的治疗效果或者预防效果即可。本发明的治疗药物或预防药物的剂量可以使用例如对疾病的治疗效果或者预防效果作为指标来确定。本文所用的“治疗”涵盖患有相关疾病或病症的哺乳动物例如人类中治疗相关的疾病或疾病状态，并且包括：(1)预防疾病或疾病状态在哺乳动物中发生，尤其是当该哺乳动物易感于所述疾病状态，但尚未被诊断出患有这种疾病状态时；(2)抑制疾病或疾病状态，即阻止其发生；或者(3)缓解疾病或疾病状态，即使疾病或疾病状态消退。"
  },
  {
    "专利名": "一种口服幽门螺杆菌疫苗重组蛋白抗原及制备和应用",
    "申请号": "CN202410532695.1",
    "公开日": "20240531",
    "IPC 分类号": "C12N9/80;A61K38/50;C12N15/70;A61K39/02;A61P31/04",
    "申请人": "成都欧林生物科技股份有限公司",
    "关键词": "口服疫苗、重组蛋白抗原、UreB蛋白、组氨酸、谷胱甘肽转移酶、融合蛋白、纯化、发酵液产率、免疫应答、免疫保护、幽门螺杆菌、蛋白纯化",
    "摘要": "本发明涉及生物医学领域，具体涉及一种口服幽门螺杆菌疫苗重组蛋白抗原及制备和应用。现有技术中存在UreB蛋白纯化难度大，口服重组蛋白疫苗耐受性和抗原被稀释、降解甚至变性失活的技术问题。本发明提供一种口服幽门螺杆菌疫苗重组蛋白抗原UreB及其制备方法，在UreB蛋白上增加了组氨酸（his）和谷胱甘肽转移酶（GST）蛋白，表达为his GST UreB融合蛋白，通过纯化后UreB蛋白纯度达到95%，每升发酵液的产率可以获得122mg蛋白。且动物实验证明其有效刺激机体产生免疫应答并具备良好的免疫保护作用，可作为预防幽门螺杆菌感染的疫苗候选成分。",
    "说明书": "一种口服幽门螺杆菌疫苗重组蛋白抗原及制备和应用技术领域本发明涉及生物医学领域，具体涉及一种口服幽门螺杆菌疫苗重组蛋白抗原及制备和应用。背景技术幽门螺杆菌（Helicobacter pylori尿素酶(Urase)是一种镍依赖性酶，催化尿素水解成氨和碳酸，是幽门螺杆菌在细胞内和细胞膜上表达的最丰富的蛋白质，占总Hp蛋白质的5％-10％。脲酶分解尿素产生氨，通过中和胃酸帮助细菌在胃中定植，并为细菌蛋白质合成提供氨。脲酶在细菌表面和内部均有分布，由UreA和UreB两个亚基购成。在HP的致病机制方面，尿素酶主要通过水解尿素产生氨和二氧化碳,调节细菌细胞周围的pH值，是HP在高强度胃酸中得以生存和定植的关键，同时尿素酶是HP重要的定植因子和毒力因子。不同地区的HP菌株具有多样性和易变异等特点，但不同HP菌株间UreB的核酸序列具有高度的保守性和同源性，且分子量大，特异性强，能有效地诱导机体产生稳定的免疫保护作用，与UreA相比，UreB具有更好的免疫保护作用。因此，UreB被列为最有前景的候选抗原之一。在所有被Hp感染的患者中，尤其是在那些具有明显症状的患者中，都可以检测到尿素酶B抗体，并且该抗体水平在一定程度上与疾病状况的严重性有关。人体黏膜免疫系统（Human mucosal immune system，HMIS）主要由弥散分布于呼吸道、生殖泌尿道及消化道等处的黏膜及黏膜下的淋巴细胞构成，是人体最大的一个器官，其表面积大于皮肤表面积。其中，肠道黏膜是人体最主要的黏膜部位。人类肠道具有约400cm2细菌DNA是Toll样受体9的天然配体，含有非甲基化CpG序列的合成寡聚脱氧核苷酸（ODNs）可以模拟细菌DNA结构并引发类似的活性。Cp-GODNs可以触发表达TLR9的免疫细胞（包括人浆细胞样树突细胞和B细胞），产生Th1免疫及其相关细胞因子为特征的固有免疫反应。CpG-ODNs用作疫苗佐剂时，可提高专职的抗原提呈细胞的功能，并促进抗原特异性的体液和细胞免疫反应。根据结构和生物功能，含CpG的序列可分为三大类：CpG-A类、CpG-B类和CpG-C类，其中CpG-B级分子是临床疫苗研究中最常用的。CpG-ODN的结构和功能密切相关。事实上，分子的高级结构决定了CpG-ODN是在细胞内定位于早期还是晚期溶酶体，这些溶酶体与不同的信号通路相关。多聚体CpG-A ODN主要定位于早期溶酶体，在浆细胞样树突状细胞中，它们导致IFN-α的强烈诱导。单体CpG-B ODNs集中在晚期内体区室，可以促进浆细胞样树突状细胞和B细胞的细胞成熟。CpG-C ODN定位于两个区室，诱导IFN-α的产生和细胞成熟。影响含CpG序列生物效应的其他结构修饰包括通过非核苷化学连接体连接两个或多个短的硫代磷酸酯骨架CpG ODN，以产生线性嵌合免疫调节化合物和/或含CpG纳米颗粒化合物的制剂。1018是一种合成的CpG-B类寡核苷酸，具有硫代磷酸酯骨架和序列5′-TGACTGTGAACGCG发明内容本发明的目的在于提供一种口服幽门螺杆菌疫苗重组蛋白抗原及制备和应用，解决现有技术中UreB蛋白纯化难度大，口服重组蛋白疫苗耐受性和抗原被稀释、降解甚至变性失活的技术问题。为实现上述目的，本发明提供了以下技术方案：本发明提供的一种口服幽门螺杆菌疫苗重组蛋白抗原，所述抗原为UreB，氨基酸序列如SEQ ID NO：1所示，融合蛋白his-GST-UreB的氨基酸序列如SEQ ID NO：2所示，融合蛋白his-GST-UreB编码核苷酸序列如SEQ ID NO:3所示。本发明提供了一种口服幽门螺杆菌疫苗重组蛋白抗原的制备方法，包括以下步骤：S1、质粒构建，蛋白表达：将核苷酸序列如SEQ ID NO:3所示的his-GST-UreB基因链接在表达载体中，构建好的表达载体转入重组工程菌中进行诱导表达；S2、发酵；S3、纯化；S31、菌体重悬；将菌体与A液按照质量比1:10加入A液进行稀释、重悬，至菌体均匀重悬于A液中；S32、菌体破碎，离心过滤收集上清液；S33、Ni-FF1层析：采用A液平衡、上样、A液复平衡、7.5%B液洗杂、30%B液洗脱步骤收集样品；S34、G25换液：采用C液平衡、上样、C液洗脱步骤收集样品；S35、酶切：蛋白和pp酶按照v/v=20:1的比例加入pp酶，轻微搅拌混合均匀，2-8℃进行静置过夜酶切；过滤，取样检测；S36、Ni-FF2层析:采用C液平衡、上样、C液复平衡、4%D液洗脱、50%D液洗杂步骤收集样品；S37、QHP层析:平衡：F液平衡1-2CV，E液平衡1-5CV；上样；复平衡2-3CV；0-100%F液，10CV洗脱收集洗脱峰；S8、超滤换液、除菌过滤得到UreB原液。进一步的，所述S1中表达载体为pET-29b（+），重组工程菌为pET-UreB/BL21。进一步的，所述S2包括以下子步骤：S21、菌种开启：pET29-UreB/BL21种子菌的第四代以1：600v/v的比例接种于三角瓶中，所述三角瓶中有LB培养基，在36.0-38.0℃、200-240rpm、4-8h培养得到一代生产菌种；S22、种子罐培养：一代生产菌种按照0.5-2.0%，V/V的接种量比例接种于种子罐，罐内装LB培养基，在深层通气：10.0-50.0L/分钟、36.0-38.0℃、50～300rpm、pH6.70~7.30培养3.0-8.0h，得到二代生产菌种；S23、发酵罐培养：二代生产菌种按照8%-12%的接种量接种发酵罐，在36.0～38.0℃、深层通气50.0～350.0L/分钟、100～500rpm、pH6.70~7.30培养3.0～7.0小时，菌种扩增结束；S24、诱导培养：温度：29.0～31.0℃；深层通气：50.0～350.0L/分钟；转速：100～500rpm；pH：6.70~7.30；诱导时间4.0小时；S25、离心收集菌体沉淀。进一步的，所述S21、S22、S24结束后取菌液样品做纯菌检查和镜检，细菌为革兰氏阴性杆菌，S21、S22、S23、S25结束后菌液OD600600进一步的，所述S32具体为：将重悬的菌体进行剪切均质：2~8℃条件下均质，700-900Bar，3次；均质后的液体于12000g离心力下离心30min；收集上清，使用0.6-0.8μm深层滤板进行澄清过滤，再使用0.65μm滤芯进行澄清过滤。进一步的，所述S33中平衡2-3CV；上样；复平衡3-5CV；洗杂：7.5%B，2-5CV；洗脱：30%B，2-5CV；所述A液为50mMTris+0.15MNaCl+0.5%Tween-80，pH8.0，所述B液为50mMTris+0.15MNaCl+0.5M咪唑+0.5%Tween-80，pH8.0。进一步的，所述C液为50mMTris+0.15M NaCl,pH8.0，所述S36中平衡2-3CV；上样；复平衡2-5CV；洗脱条件：4%D液，20mM咪唑，3-5CV；洗杂：50%D液，250mM咪唑，1-3CV，所述D液为50mM Tris+0.15MNaCl+500mM咪唑,pH8.0。进一步的，所述S37中E液为20mM Tris+1mMDTT，pH7.5，F液为20mM Tris+0.5ML-Arg+1mMDTT；所述S38中超滤换液为用30KD膜包进行超滤浓缩处理三步层析样液，浓缩至原来体积的1/5-1倍，等体积补加G液，连续洗滤5-10个体积，透析结束浓缩样品至三步层析样品液体积的1/2-2倍；所述G液为20mMPB+5mML-Cys·Hcl+5%甘露醇，pH8.0。本发明还提供了一种口服幽门螺杆菌疫苗重组蛋白抗原UreB在预防或治疗幽门螺杆菌感染药物中的用途。进一步的，所述药物为疫苗。基于上述技术方案，本发明实施例至少可以产生如下技术效果：（1）本发明提供的重组蛋白抗原UreB，在UreB蛋白上增加了组氨酸（his）和谷胱甘肽转移酶（GST）蛋白，表达为his-GST-UreB融合蛋白，通过纯化后UreB蛋白纯度达到95%，每升发酵液的产率可以获得122mg蛋白。（2）本发明提供的重组蛋白抗原UreB，单独使用UreB时小鼠攻毒保护率30%，UreB+CpG小鼠攻毒保护率60%。"
  },
  {
    "专利名": "一种幽门螺杆菌口服重组蛋白疫苗及其抗原制备方法",
    "申请号": "CN202410539921.9",
    "公开日": "20240802",
    "IPC 分类号": "C12N15/31;C07K1/20;C12N1/21;C07K14/195;A61K39/39;C12N15/70;C12R1/19;A61K39/02;C07K1/18;A61P31/04;C07K1/34;C07K1/36",
    "申请人": "成都欧林生物科技股份有限公司",
    "关键词": "幽门螺杆菌、口服重组蛋白疫苗、HpaA、CpG1018、抗原制备方法、质粒构建、黏膜免疫、溶酶体、基因工程疫苗、特异性免疫应答、重组工程菌",
    "摘要": "本发明涉及生物医学领域，具体涉及一种幽门螺杆菌口服重组蛋白疫苗及其抗原制备方法。现有技术存在口服重组蛋白疫苗耐受性低和抗原被稀释、降解甚至变性失活的技术问题。本发明提供一种幽门螺杆菌口服重组蛋白疫苗及其抗原制备方法，通过本发明的制备方法，纯化后其蛋白纯度达到90%以上，每升发酵液的产率可以获得96mg蛋白，且动物实验证明其有效刺激机体产生免疫应答并具备良好的免疫保护作用，经过免疫保护实验，其保护率达到80%。",
    "说明书": "一种幽门螺杆菌口服重组蛋白疫苗及其抗原制备方法技术领域本发明涉及生物医学领域，具体涉及一种幽门螺杆菌口服重组蛋白疫苗及其抗原制备方法。背景技术幽门螺杆菌(Helicobacter pylori，Hp)是一种革兰阴性、螺杆状、微需氧菌，可以在胃、黏膜和十二指肠上皮持续存在。1982年澳大利亚学者Marshall和Warren首次报道了从慢性胃炎和胃溃疡患者的胃黏膜中分离出幽门螺旋杆菌，是目前所知能够在人胃中生存的唯一微生物种类。已有大量研究证实，Hp是胃肠道疾病的常见病原体，是慢性B型胃炎、胃和十二指肠溃疡的主要病因。Hp也是胃肠癌、胃黏膜淋巴组织淋巴癌的关键病因，通过对细胞内信号的调控引起胃上皮细胞的遗传不稳定，影响DNA损伤修复系统，促进了胃上皮细胞的肿瘤转化[i]iiHp感染在全世界各地人群中感染率均较高，全球感染率超过50％，主要集中在非洲和巴西等发展中国家，而欧洲、日本和韩国等发达国家地区感染率则相对较低。中国Hp感染超过6亿，每年因胃癌死亡者可达20万人。目前抗生素治疗Hp感染虽有一定积极的临床意义但仍存在明显不足：1)毒副作用；2)易产生耐药菌株；3)费用高；4)疗程长，患者顺应性差；5)疗效不稳定等。疫苗是控制感染性疾病最为经济有效的办法，因此通过Hp疫苗刺激机体产生针对幽门螺杆菌的特异性免疫应答，可以达到预防或者治疗Hp感染的目的。由于Hp大规模培养困难，粗制抗原中有潜在致癌物等有害成分，大大制约了全菌疫苗的研究进展。基因工程疫苗具有安全、有效、价格低廉等特点，易于推广和应用，是Hp疫苗的一个主攻方向。国内外竞相研究Hp疫苗，但迄今尚未成功。Hp能在胃内定植是其致病的前提，而粘附则是定植的关键。Hp仅定植于胃上皮及食管和十二指肠的上皮区域，说明这种粘附作用是由特异的粘附素-受体介导的。已知N-乙酰神经氨酰乳糖结合原纤维样血凝素(NLBH，HpaA)是Hp的主要粘附素之一，它能与多种胃上皮细胞表面受体包括神经节苷脂GM3、硫酸脑苷脂(SLC)及层粘蛋白上的涎酸乳糖成分结合，使Hp紧密粘附于胃上皮细胞，阻断Hp的粘附显然可以防治Hp感染。人体黏膜免疫系统(Human-mucosal-immune-system，HMIS)主要由弥散分布于呼吸道、生殖泌尿道及消化道等处的黏膜及黏膜下的淋巴细胞构成，是人体最大的一个器官，其表面积大于皮肤表面积。其中，肠道黏膜是人体最主要的黏膜部位。人类肠道具有约400cm2细菌DNA是Toll样受体9的天然配体，含有非甲基化CpG序列的合成寡聚脱氧核苷酸(ODNs)可以模拟细菌DNA结构并引发类似的活性。CpG-ODNs可以触发表达TLR9的免疫细胞(包括人浆细胞样树突细胞和B细胞)，产生Th1免疫及其相关细胞因子为特征的固有免疫反应。CpG ODNs用作疫苗佐剂时，可提高专职的抗原提呈细胞的功能，并促进抗原特异性的体液和细胞免疫反应。根据结构和生物功能，含CpG的序列可分为三大类：CpG-A类、CpG-B类和CpG-C类，其中CpG-B级分子是临床疫苗研究中最常用的。CpG-ODN的结构和功能密切相关。事实上，分子的高级结构决定了CpG-ODN是在细胞内定位于早期还是晚期溶酶体，这些溶酶体与不同的信号通路相关。多聚体CpG-A ODN主要定位于早期溶酶体，在浆细胞样树突状细胞中，它们导致IFN-α的强烈诱导。单体CpG-B ODNs集中在晚期内体区室，可以促进浆细胞样树突状细胞和B细胞的细胞成熟。CpG-C ODN定位于两个区室，诱导IFN-α的产生和细胞成熟。影响含CpG序列生物效应的其他结构修饰包括通过非核苷化学连接体连接两个或多个短的硫代磷酸酯骨架CpG ODN，以产生线性嵌合免疫调节化合物和/或含CpG纳米颗粒化合物的制剂。1018是一种合成的CpG-B类寡核苷酸，具有硫代磷酸酯骨架和序列发明内容本发明的目的在于提供一种幽门螺杆菌口服重组蛋白疫苗及其抗原制备方法，解决现有技术中口服重组蛋白疫苗耐受性低和抗原被稀释、降解甚至变性失活的技术问题。为实现上述目的，本发明提供了以下技术方案：本发明提供的一种幽门螺杆菌口服重组蛋白疫苗，所述疫苗包括抗原和佐剂，所述抗原为HpaA，所述佐剂为CpG1018，所述HpaA的氨基酸序列如SEQ ID NO:1所示。本发明还提供一种幽门螺杆菌口服重组蛋白疫苗的抗原的制备方法，包括以下步骤：S1、质粒构建，蛋白表达：将核苷酸序列如SEQ ID NO:2所示的HpaA的基因链接在表达载体中，构建好的表达载体转入重组工程菌中进行诱导表达；S2、发酵；S3、纯化；S31、菌体重悬；将菌体与A液按照质量比1:15加入A液进行稀释、重悬，至菌体均匀重悬于A液中；S32、菌体破碎，离心过滤收集上清液；S33、SPFF层析：平衡2-3CV；上样；复平衡3-5CV；B液，10CV洗脱收集洗脱峰，将洗脱峰用A液稀释，Cond＜6.0ms/cm，过滤收集滤液；S34、SP HP层析：平衡2-3CV；上样；复平衡2-3CV；B液，10CV洗脱收集洗脱峰，洗脱峰稀释，再与C液混合，上清过滤收集滤液；S35、ButyL HP层析：D液平衡2-3CV；上样；复平衡2-3CV；A液，10CV洗脱收集洗脱峰；S36、浓缩换液、除菌过滤得到HpaA原液。进一步的，所述S1中表达载体为pET-29b(+)，重组工程菌为pET-HpaA/BL21。进一步的，所述S2包括以下子步骤：S21、菌种开启：pET29-HpaA/BL21种子菌的第四代以1：600v/v的比例接种于三角瓶中，所述三角瓶中有LB培养基，在36.0-38.0℃、200-240rpm、4-8h培养得到第5代生产菌种；S22、种子罐培养：取第5代生产菌按照0.5-2％的比例接种于种子罐，罐内装LB培养基，在深层通气：10.0-50.0L/分钟、36.0-38.0℃、50～300rpm、pH6.70～7.30培养3.0-8.0h，得到第6代生产菌种；S23、发酵罐培养：第6代生产菌种按照8％-12％的接种量接种发酵罐，在36.0～38.0℃、深层通气50.0～350.0L/分钟、100～500rpm、pH6.70～7.30培养3.0～7.0小时，菌种扩增结束；S24、诱导培养：温度：29.0～31.0℃；深层通气：50.0～350.0L/分钟；转速：100～500rpm；pH：6.70～7.30；诱导时间4.0小时；S25、离心收集菌体沉淀。进一步的，所述S21、S22、S24结束后取菌液样品做纯菌检查和镜检，细菌为革兰氏阴性杆菌，S21、S22、S23、S25结束后菌液OD600值分别为大于1.50、大于1.50、20.00、不超过1.00；所述S23菌液OD600在10.00时开始以0.015L/分钟补加甘油，直到诱导结束；所述S24诱导开始时以0.02L/分钟补加浓缩培养基。进一步的，所述S32具体为：将重悬的菌体进行剪切均质：2～8℃条件下均质，700-900Bar，3次；均质后的液体于12000g离心力下离心30min；收集上清，使用0.6-0.8μm深层滤板进行澄清过滤，再使用0.65μm滤芯进行澄清过滤。进一步的，所述S3中A液为20mMPB，pH6.0；B液为20mMPB+1MNaCl，pH6.0；C液为20mMPB+3M(NH424进一步的，所述S36为用10KDAA膜包进行超滤浓缩处理三步层析样液，浓缩至原来体积的1/5-1，等体积补加E液，连续洗滤5-10个体积，透析结束浓缩样品至三步层析样品液体积的1/2-1；所述E液为20mMPB+5mML-Cys·Hcl+5％甘露醇，pH8.0。基于上述技术方案，本发明实施例至少可以产生如下技术效果：(1)本发明提供的纯化后其蛋白纯度达到90％以上，每升发酵液的产率可以获得96mg蛋白，且动物实验证明其有效刺激机体产生免疫应答并具备良好的免疫保护作用。(2)本发明提供的幽门螺杆菌口服重组蛋白疫苗，耐受性高，EDTA螯合和消耗细胞外Ca2+(3)本发明提供的幽门螺杆菌口服重组蛋白疫苗经过免疫保护实验，其保护率达到80％。"
  },
  {
    "专利名": "一种肠道代谢物调控剂及包含调控剂的药物",
    "申请号": "CN202410433085.6",
    "公开日": "20240514",
    "IPC 分类号": "A61P25/28;A61K31/715;A61P19/06;A23L33/125;A61P31/04;A61K36/8984;A61P1/04",
    "申请人": "华南农业大学",
    "关键词": "肠道代谢物调控剂、石斛多糖、代谢量调控、生物医学、溃疡性结肠炎、阿尔茨海默症、高尿酸血症",
    "摘要": "本发明公开了一种肠道代谢物调控剂及包含调控剂的药物，属于生物医学领域。该肠道代谢物调控剂以石斛多糖为活性成分，该肠道代谢物调控剂能提升肠道内巴豆酸、9氨基吖啶、鹅肌肽、阿巴美塔皮尔、N2苯基4(哌啶甲基)1,3噻唑2胺、4苯基吡啶和4(3,4二氢2H1,5苯并二氧杂环庚烷7氨基)4氧代丁烷等代谢物的代谢量，此肠道代谢物调控剂能应用于制备治疗溃疡性结肠炎、阿尔茨海默症和高尿酸血症等药物。",
    "说明书": "一种肠道代谢物调控剂及包含调控剂的药物技术领域本发明属于生物医学领域，具体涉及一种肠道代谢物调控剂及包含调控剂的药物。背景技术溃疡性结肠炎(Ulcerative colitis,UC)是一种慢性非特异性炎症性肠病，主要发生于结肠黏膜，其特征为结肠黏膜炎症细胞浸润和带血腹泻。UC可由遗传变异、肠道菌群失衡、环境变化、免疫功能障碍以及这些因素之间的相互作用引起。在UC病例中，肠上皮屏障的破坏、肠道微生物群稳态的紊乱、微生物代谢物的改变和免疫反应的破坏是常见的。近年来，世界范围内UC的患病率和发病率不断上升，化学药品、激素、生物制剂和免疫抑制剂已被用于治疗UC，但这些药物的疗效不理想，并产生不良反应。最近的研究表明，中药可以显著缓解UC的临床症状，改善上皮屏障功能，改变肠道菌群的组成和多样性。多项研究证明，多糖可通过减少炎性细胞因子的分泌，促进紧密连接蛋白的表达，改善肠道微生物的组成，可利用其在食疗中预防UC。因此，有必要开发安全有效的天然药物或饮食来预防和治疗UC。石斛是石斛科部落的一个大属，其药用价值高，富含多糖、菲、联苯和黄酮类化合物，数百年来一直是传统药材。多糖是一类由单糖分子通过糖苷键连接组成的大分子聚合物，大量研究表明，多糖具有多种生物活性，如抗炎、抗肿瘤、抗辐射、抗菌、抗疲劳、抗氧化、抗病毒和免疫调节等。目前已有许多报道表明，铁皮石斛多糖（DOP）具有抗氧化、抗衰老、降血糖、调节免疫和治疗胃肠道炎症等多种药理活性。然而，关于用DOP来调节肠道内相关代谢物的代谢量目前尚未见报道，而肠道代谢物的含量对相关疾病的治疗具有积极作用。因此，研究DOP对肠道代谢物代谢量的影响具有重要意义。发明内容针对上述现有技术，本发明公开了一种肠道代谢物调控剂及包含调控剂的药物，以提示此肠道代谢物调控剂应用于制备治疗溃疡性结肠炎、阿尔茨海默症和高尿酸血症等的药物。为了达到上述目的，本发明所采用的技术方案是：一种肠道代谢物调控剂，此调控剂以石斛多糖为活性组分，此调控剂为提升肠道内相关代谢物代谢量的制剂，相关代谢物为巴豆酸（Tiglic acid）、N,N-二甲基-5-硝基-6-[3-(三氟甲基)苯氧基]嘧啶-4-胺（N,N-dimethyl-5-nitro-6-[3-(trifluoromethyl)phenoxy]pyrimidin-4-amine）、2-(14,15-环氧二十碳三烯酰基)甘油（2-(14,15-Epoxyeicosatrienoyl)glycerol）、2-(14,15-环氧乙基三烯)甘油（2-(14,15-Epoxyelcosatrienoy)glycerol）、9-氨基吖啶（9-Aminoacridine）、鹅肌肽（Anserine）、阿巴美塔皮尔（Abametapir）、双环前列腺素E2（Bicyclo Prostaglandin E2）、N-(2,4-二甲基苯基)甲酰胺（N-(2,4-Dimethylphenyl)formamide）、海洛因-d3（heroin-d3）、N2-苯基-4-(哌啶甲基)-1,3-噻唑-2-胺（N2-phenyl-4-(piperidinomethyl)-1,3-thiazol-2-amine）、4-苯基吡啶（4-styrylpyridine）和4-(3,4-二氢-2H-1,5-苯并二氧杂环庚烷-7-氨基)-4-氧代丁烷（4-(3,4-dihydro-2H-1,5-benzodioxepin-7-ylamino)-4-oxobutan）。进一步，调控剂的用量以石斛多糖的摄入量为90~110mg/kg/d为准。本发明还公开了一种治疗溃疡性结肠炎的药物，其包括肠道代谢物调控剂。进一步，此药物的用量以石斛多糖的摄入量为90~110mg/kg/d为准。本发明还公开了一种治疗阿尔茨海默症的药物，其包括肠道代谢物调控剂。进一步，此药物的用量以石斛多糖的摄入量为90~110mg/kg/d为准。本发明还公开了一种治疗高尿酸血症的药物，其包括肠道代谢物调控剂。进一步，此药物的用量以石斛多糖的摄入量为90~110mg/kg/d为准。本发明还公开了一种治疗细菌感染的药物，其包括肠道代谢物调控剂。进一步，此药物的用量以石斛多糖的摄入量为90~110mg/kg/d为准。综上所述，本发明具有以下优点：1、肠道代谢物调控剂对溃疡性结肠炎有良好的改善作用，可用于开发预防和治疗溃疡性结肠炎的药物和功能食品。2、以石斛多糖为活性组分的肠道代谢物调控剂，能提升肠道内9-氨基吖啶的代谢量，可用于开发治疗细菌感染的药物和功能食品。3、以石斛多糖为活性组分的肠道代谢物调控剂，能提升肠道内鹅肌肽的代谢量，可用于开发治疗高尿酸血症的药物和功能食品。4、以石斛多糖为活性组分的肠道代谢物调控剂，能提升肠道内N2-苯基-4-(哌啶甲基)-1,3-噻唑-2-胺的代谢量，可用于开发治疗阿尔茨海默的药物和功能食品。"
  },
  {
    "专利名": "一种用于干预治疗中晚期肺癌的脉冲电场预处理TiLs的制备方法",
    "申请号": "CN202410431590.7",
    "公开日": "20240712",
    "IPC 分类号": "A61K41/00;A61P35/00;C12N5/0783;A61K35/17;C12N13/00;A61N1/36",
    "申请人": "初源诺康医疗技术开发（西安）有限公司",
    "关键词": "脉冲电场、纳秒脉冲、TiLs、密度梯度离心法、细胞膜通透性、抗肿瘤活性、定制化预处理、免疫治疗、中晚期肺癌、肿瘤微环境、动物模型、临床研究",
    "摘要": "本申请涉及生物医学领域，公开了一种用于干预治疗中晚期肺癌的脉冲电场预处理TiLs的制备方法，包括S1、提供一纳秒级脉冲电场装置，该装置能够产生具有特定电压和频率的脉冲电场，其中电压范围设定为10至500伏特，脉冲宽度设定为10至300纳秒，频率设定为1至500赫兹；S2、从确诊为中晚期肺癌的患者体内提取TiLs，通过细针抽吸法结合酶消化法，从患者的肿瘤组织中提取TiLs，并采用密度梯度离心法对TiLs进行纯化处理。本发明通过精细调节纳秒脉冲电场参数，实现了对肿瘤浸润性淋巴细胞(TiLs)的定制化预处理，显著提升了它们对特定肿瘤细胞的识别和杀伤能力。这种方法不仅提高了TiLs的功能效率，也优化了其在体内的持续活性，进一步增强了免疫治疗的长期效果。",
    "说明书": "一种用于干预治疗中晚期肺癌的脉冲电场预处理TiLs的制备方法技术领域本发明涉及生物医学技术领域，具体为一种用于干预治疗中晚期肺癌的脉冲电场预处理TiLs的制备方法。背景技术恶性肿瘤(癌症)是一种由体内正常细胞基因突变引发的疾病，这些突变导致细胞失去生长和分化的正常调控，从而无限制地增殖和分化。恶性肿瘤细胞不仅能侵犯周围组织和器官，还能通过血液和淋巴系统转移到身体其他部位形成转移灶。肺癌是其中一种严重的恶性肿瘤，其发病率和死亡率都很高，尤其是中晚期肺癌，治疗难度较大。传统的肺癌治疗方法包括手术切除、放疗、化疗等，但对于中晚期肺癌患者来说，由于肿瘤的广泛扩散和侵袭性，这些治疗手段往往效果有限。近年来，靶向治疗和免疫疗法的发展为肺癌治疗提供了新的策略。特别是免疫疗法，通过激活和增强患者自身的免疫系统来攻击肿瘤细胞，已经显示出在肺癌治疗中具有潜力。肿瘤浸润性淋巴细胞(TiLs)是肿瘤微环境中的关键免疫细胞，它们能够渗透进入肿瘤组织并对抗肿瘤细胞。TiLs主要包括T细胞亚群，它们通过识别肿瘤细胞表面的抗原和释放细胞因子来发挥抗肿瘤作用。然而，TiLs在肿瘤微环境中常常受到免疫抑制因子的影响，导致其活性和功能受限。因此，本发明提出一种用于干预治疗中晚期肺癌的脉冲电场预处理TiLs的制备方法，来解决现有技术的不足。发明内容针对现有技术的不足，本发明提供了一种用于干预治疗中晚期肺癌的脉冲电场预处理TiLs的制备方法，即利用纳秒级脉冲电场(nsPEF)技术对TiLs进行预处理，以增强其抗肿瘤活性。nsPEF技术通过短暂的高电压脉冲改变细胞膜的通透性和电位，从而可以暂时性地增加细胞膜的透性，使TiLs更容易受到激活和增强其对肿瘤细胞的攻击能力。为实现以上目的，本发明通过以下技术方案予以实现：一种用于干预治疗中晚期肺癌的脉冲电场预处理TiLs的制备方法，包括以下步骤：S1、提供一纳秒级脉冲电场装置，该装置能够产生具有特定电压和频率的脉冲电场，其中电压范围设定为10至500伏特，脉冲宽度设定为10至300纳秒，频率设定为1至500赫兹；S2、从确诊为中晚期肺癌的患者体内提取TiLs，通过细针抽吸法结合酶消化法，从患者的肿瘤组织中提取TiLs，并采用密度梯度离心法对TiLs进行纯化处理；S3、使用S1步骤中提供的纳秒级脉冲电场装置对S2步骤中提取并纯化的TiLs进行预处理，其中预处理参数包括但不限于设定电场强度为30至300伏特/毫米，脉冲宽度为50至200纳秒，频率为10至1000赫兹，每次处理时长为1至10秒，间隔时间为1至5分钟，共进行3至10次处理。优选的，一种用于干预治疗中晚期肺癌的脉冲电场预处理TiLs的制备方法，进一步包括基础研究和临床研究两个阶段，其中基础研究阶段使用动物模型来验证TiLs预处理参数的有效性和安全性，临床研究阶段在获得伦理委员会批准后，在中晚期肺癌患者中进行TiLs的预处理和治疗效果评估。优选的，所述基础研究步骤包括：(a)、制备中晚期肺癌动物模型，选择适宜品种的实验用小鼠，C57BL/6或BALB/c小鼠，并通过皮下接种人肺癌细胞株，A549或H1975，制备实验性肺癌；(b)、从动物模型中提取TiLs，通过手术切除肿瘤组织并应用胶原酶IV和DNA酶I的混合液进行消化处理，随后采用Ficoll-PaquePLUS介质进行密度梯度离心，获得TiLs，并通过免疫荧光标记和流式细胞术进行细胞表型和功能鉴定；(c)、对TiLs进行纳秒级脉冲电场预处理，使用具有精确控制功能的脉冲电场发生器，设定特定参数组合进行预处理，电压设置为200伏特/毫米，脉冲宽度为100纳秒，频率为50赫兹，每次处理时长为5秒，间隔时间为2分钟，总共进行5次处理；(d)、将预处理后的TiLs按照不同的脉冲电场参数分为至少三组，每组在相同的电场参数下进行预处理，然后将TiLs回输至相应的动物模型中，通过肿瘤生长延迟、动物存活时间和免疫细胞浸润程度指标评估预处理TiLs的抗肿瘤效果。优选的，所述步骤(a)中动物模型制备，包括在无菌条件下，通过皮下接种肺癌细胞株，1×1066优选的，所述步骤(b)中的TiLs提取，培养及鉴定，包括将切除的肿瘤组织在无菌条件下置于含有胶原酶IV和DNA酶I的消化缓冲液中，于37℃下轻轻摇晃消化2至4小时，随后通过100μm细胞过滤器过滤，以去除未消化的组织碎片，然后采用Ficoll-PaquePLUS介质进行密度梯度离心，分离出TiLs，并使用CD3、CD4、CD8抗体进行免疫标记，通过流式细胞术进行TiLs的定量和功能状态评估。优选的，所述步骤(c)中的脉冲电场预处理TiLs，详细涉及使用具有可调节输出电压和频率的脉冲电场发生器，其中电场强度可在30至300伏特/毫米之间调节，脉冲宽度可在50至200纳秒之间调节，频率可在10至1000赫兹之间调节，每次处理时长可在1至10秒之间调节，间隔时间可在1至5分钟之间调节，总共进行3至10次处理，以优化TiLs的细胞膜通透性和电位。优选的，所述步骤(d)中的分组，包括将预处理后的TiLs根据预处理参数的不同，分成至少三组，每组根据其预处理参数对动物模型进行TiLs回输治疗，并通过肿瘤体积测量、免疫组化染色和细胞因子分析实验手段评价预处理TiLs的抗肿瘤效果。优选的，所述临床研究步骤包括：①、从确诊为中晚期肺癌的患者的肿瘤组织中提取TiLs，通过外科切除或细针抽吸法获取肿瘤组织样本，并采用胶原酶IV和DNA酶I的混合液进行消化处理，随后使用Ficoll-PaquePLUS介质进行密度梯度离心法对TiLs进行纯化处理，并通过免疫荧光标记和流式细胞术进行TiLs的表型和功能鉴定；②、将提取的TiLs在含有10％热失活胎牛血清和重组人IL-2的RPMI1640培养基中进行培养和扩增，维持在37℃、5％CO2③、对TiLs进行纳秒级脉冲电场预处理，使用具有精确控制功能的脉冲电场发生器，设定最优化的预处理参数，电压设置为200伏特/毫米，脉冲宽度为100纳秒，频率为50赫兹，每次处理时长为5秒，间隔时间为2分钟，总共进行5次处理，以增强TiLs的功能；④、将预处理后的TiLs通过直接注射到患者的肿瘤组织中或静脉注射输送到患者全身，作为中晚期肺癌患者的干预治疗，直接注射时使用导管或特制针头将TiLs注射到肿瘤内部或周边组织中，静脉注射时将TiLs缓慢注入患者的中心静脉或外周静脉中，以允许TiLs通过血液循环分布到全身各处。优选的，所述步骤①中的TiLs提取及鉴定，详细涉及在无菌手术环境下，使用细针抽吸法或外科手术切除法获取患者的肿瘤组织样本，随后置于含有胶原酶IV和DNA酶I的消化缓冲液中，在37℃下轻轻摇晃消化2至4小时，过滤后使用Ficoll-PaquePLUS介质进行密度梯度离心，分离出TiLs，并使用特定免疫标记进行TiLs的定量和功能状态评估；所述步骤②中的TiLs培养和扩增，详细涉及将提取的TiLs接种到含有10％热失活胎牛血清和重组人IL-2的RPMI1640培养基中，并在37℃、5％CO2优选的，所述步骤③中的脉冲电场调控技术的优化及TiLs干预，详细涉及使用具有可调节输出电压和频率的脉冲电场发生器，对TiLs进行预处理，其中电场强度在30至300伏特/毫米之间调节，脉冲宽度在50至200纳秒之间调节，频率在10至1000赫兹之间调节，每次处理时长可在1至10秒之间调节，间隔时间在1至5分钟之间调节，总共进行3至10次处理，优化后的预处理参数能够显著提高TiLs对中晚期肺癌细胞的识别和杀伤功能，增强患者体内的抗肿瘤免疫反应；所述步骤④中的TiLs移植治疗，详细涉及两种TiLs输送方法：直接注射和静脉注射，其中直接注射方法包括使用经过无菌处理的针头或导管，将TiLs精确注射到肿瘤组织内部或周边组织中，从而使TiLs能够直接与肿瘤细胞接触，其中静脉注射方法包括将TiLs稀释在生理盐水中，并缓慢注入患者的中心静脉或外周静脉，利用患者的血液循环将TiLs输送到全身，以寻找并攻击肿瘤细胞。本发明提供了一种用于干预治疗中晚期肺癌的脉冲电场预处理TiLs的制备方法。具备以下有益效果：1、本发明通过精细调节纳秒脉冲电场参数，实现了对肿瘤浸润性淋巴细胞(TiLs)的定制化预处理，显著提升了它们对特定肿瘤细胞的识别和杀伤能力。这种方法不仅提高了TiLs的功能效率，也优化了其在体内的持续活性，进一步增强了免疫治疗的长期效果。2、传统的TiLs治疗依赖于化学诱导剂来激活和扩增细胞，而这些化学物质往往带有不可预测的副作用。相比之下，本发明所采用的物理方法—纳秒脉冲电场，能够以非热量损伤的方式直接作用于细胞，提供了一种更为安全、可控的激活手段，大幅减少了对患者身体的负担。3、本发明利用纳秒脉冲电场“一过性”地抑制DNMT1酶的活性，减少了肿瘤细胞表面抗原的甲基化，从而增强了TiLs的肿瘤识别能力。这种独特的机制不仅提高了TiLs的攻击效率，还可能改变了肿瘤微环境，为免疫逃逸机制提供了新的解决方案。4、本发明所展现的技术方案不仅适用于中晚期肺癌的治疗，其原理和方法也为其他种类的恶性肿瘤治疗提供了新的可能性。通过调整电场参数，可以针对不同的肿瘤类型和患者状况，设计个性化的治疗方案，从而在更广泛的肿瘤治疗领域内实现精准医疗。5、本发明不仅在临床治疗上取得了显著成果，而且在技术层面上为免疫治疗的研究提供了新的工具和理论基础。纳秒脉冲电场技术的引入，极大地促进了免疫治疗领域的技术进步和创新，为未来治疗策略的优化和新疗法的开发奠定了坚实的基础。"
  }
]